<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="regularsize">
        <h2>Agregar Raster Multidimensional</h2><p/>
        <h2><img src="../images/GUID-2C2320A3-EC6E-4FFC-B59B-9551BB02C545-web.png" alt="Agregar Raster Multidimensional"></h2>
        <hr/>
    <p>Generates a multidimensional raster dataset by combining existing multidimensional raster variables along a dimension.
    </p>
    <p>Se voc&ecirc; tiver 30 anos de dados de temperatura de superf&iacute;cie do mar, coletada mensalmente e em cada 5 metros de profundidade at&eacute; 100 metros, alguns aplicativos de exemplo s&atilde;o os seguintes:
        <ul>
            <li>Agregar dados de temperatura mensais em dados anuais.
            </li>
            <li>Agregar dados de temperatura mensais em intervalos de 4 meses.
            </li>
            <li>Agregar dados de temperatura de 0 a 25 metros, ent&atilde;o de 25 a 50 metros, ent&atilde;o de 50 a 100 metros.
            </li>
        </ul>
        
    </p>
    <p>Se  <b>Utilizar extens&atilde;o de mapa atual</b> estiver selecionada, as vari&aacute;veis da camada que s&atilde;o vis&iacute;veis dentro da extens&atilde;o de mapa atual ser&atilde;o analisadas. Se desmarcada, as vari&aacute;veis da camada total ser&atilde;o analisadas, mesmo que estiverem fora da extens&atilde;o de mapa atual.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputMultidimensionalRaster">
        <div><h2>Escolha a camada de imagens multidimensional para agregar</h2></div>
        <hr/>
        <div>
            <p>A camada de imagens de entrada de um raster multidimensional que ser&aacute; agregado.
            </p>
        </div>
    </div>
    <div id="dimension">
        <div><h2>Escolha dimensão para agregar</h2></div>
        <hr/>
        <div>
            <p>A dimens&atilde;o de agrega&ccedil;&atilde;o. Esta &eacute; a dimens&atilde;o ao longo das vari&aacute;veis que ser&atilde;o agregadas.
            </p>
        </div>
    </div>
    <div id="variables">
        <div><h2>Escolher variáveis para agregar</h2></div>
        <hr/>
        <div>
            <p>A vari&aacute;vel ou vari&aacute;veis que ser&atilde;o agregadas ao longo da dimens&atilde;o fornecida. Se nenhuma vari&aacute;vel for especificada, todas as vari&aacute;veis com uma dimens&atilde;o selecionada ser&atilde;o agregadas.
            </p>
            <p>Por exemplo, para agregar seus dados de temperatura diariamente em valores m&eacute;dios mensais, especifique temperatura como a vari&aacute;vel para ser agregada. Se voc&ecirc; n&atilde;o especificar quaisquer vari&aacute;veis e voc&ecirc; tem ambas temperatura diariamente e vari&aacute;veis de precipita&ccedil;&atilde;o di&aacute;rias, ambas as vari&aacute;veis ser&atilde;o agregadas em m&eacute;dias mensais e o raster multidimensional de sa&iacute;da incluir&aacute; ambas as vari&aacute;veis.
            </p>
        </div>
    </div>
    <div id="aggregationMethod">
        <div><h2>Escolher método de agregação</h2></div>
        <hr/>
        <div>
            <p>Especifica o m&eacute;todo matem&aacute;tico que ser&aacute; utilizado para combinar as partes agregadas em um intervalo.
                <ul>
                    <li> <b>M&eacute;dia</b>&mdash;Calcula a m&eacute;dia dos valores de um pixel atrav&eacute;s de todas as divis&otilde;es no intervalo. Este &eacute; o padr&atilde;o.
                    </li>
                    <li> <b>M&aacute;ximo</b>&mdash;Calcula o valor m&aacute;ximo de um pixel atrav&eacute;s de todas as divis&otilde;es no intervalo.
                    </li>
                    <li> <b>Maioria</b>&mdash;Calcula o valor que ocorreu com mais frequ&ecirc;ncia para um pixel atrav&eacute;s de todas as divis&otilde;es no intervalo.
                    </li>
                    <li> <b>M&iacute;nimo</b>&mdash;Calcula o valor m&iacute;nimo de um pixel atrav&eacute;s de todas as divis&otilde;es no intervalo.
                    </li>
                    <li> <b>Minoria</b>&mdash;Calcula o valor que ocorreu com menos frequ&ecirc;ncia para um pixel atrav&eacute;s de todas as divis&otilde;es no intervalo.
                    </li>
                    <li> <b>Mediano</b>&mdash;Calcula o valor mediano de um pixel atrav&eacute;s de todas as divis&otilde;es no intervalo.
                    </li>
                    <li> <b>Percentil</b>&mdash;O percentil de valores de um pixel ser&aacute; calculado em todas as divis&otilde;es do intervalo. O 90&ordm; percentil &eacute; calculado por padr&atilde;o. Voc&ecirc; pode especificar outros valores (de 0 a 100) usando o par&acirc;metro de <b>Valor percentil</b>.
                    </li>
                    <li> <b>Faixa</b>&mdash;Calcula as faixas de valores de um pixel atrav&eacute;s de todas as divis&otilde;es no intervalo.
                    </li>
                    <li> <b>Desvio Padr&atilde;o</b>&mdash;Calcula o desvio padr&atilde;o de valores de um pixel atrav&eacute;s de todas as divis&otilde;es no intervalo.
                    </li>
                    <li> <b>Soma</b>&mdash;Calcula a soma dos valores de um pixel atrav&eacute;s de todas as divis&otilde;es no intervalo.
                    </li>
                    <li> <b>Variedade</b>&mdash;Calcula o n&uacute;mero de valores &uacute;nicos de um pixel atrav&eacute;s de todas as divis&otilde;es no intervalo.
                    </li>
                    <li> <b>Personalizado</b>&mdash;Calcula o valor de um pixel baseado em uma fun&ccedil;&atilde;o de raster personalizada.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="aggregationFunction">
        <div><h2>Escolher modelo de função do raster</h2></div>
        <hr/>
        <div>
            <p>Uma fun&ccedil;&atilde;o de raster personalizada que ser&aacute; utilizada para computar os valores de pixel dos rasters agregados. A entrada &eacute; um item do modelo de fun&ccedil;&atilde;o de raster no portal. Esta entrada &eacute; exigida quando o  <b>M&eacute;todo de Agrega&ccedil;&atilde;o</b> for configurado para <b>Personalizar</b>.
            </p>
        </div>
    </div>
    <div id="aggregationDefinition">
        <div><h2>Escolher definição de agregação</h2></div>
        <hr/>
        <div>
            <p>Especifica o intervalo de dimens&atilde;o em que os dados ser&atilde;o agregados.
                <ul>
                    <li> <b>Todos</b>&mdash;Os valores de dados ser&atilde;o agregados atrav&eacute;s em todas as divis&otilde;es. Este &eacute; o padr&atilde;o.
                    </li>
                    <li> <b>Palavra-Chave do Intervalo</b>&mdash;Os dados de vari&aacute;vel ser&atilde;o agregados utilizando um intervalo comumente conhecido.
                    </li>
                    <li> <b>Valores de Intervalo</b>&mdash;Os dados da vari&aacute;vel ser&atilde;o agregados utilizando um intervalo e unidade especificados pelo usu&aacute;rio.
                    </li>
                    <li> <b>Faixas de Intervalos</b>&mdash;Os dados da vari&aacute;vel ser&atilde;o agregadas entre pares de valores ou datas especificados.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="intervalKeyword">
        <div><h2>Escolher intervalo de palavra-chave</h2></div>
        <hr/>
        <div>
            <p>Especifica o intervalo de palavra-chave que ser&aacute; utilizado ao agregar ao longo da dimens&atilde;o. Esta entrada &eacute; exigida ao  <b>Defini&ccedil;&atilde;o de Agrega&ccedil;&atilde;o</b> &eacute; configurada da <b>Palavra-chave de Intervalo</b> e a agrega&ccedil;&atilde;o deve ser atrav&eacute;s do tempo.
                <ul>
                    <li> <b>A Cada Hora</b>&mdash;Os valores de dados ser&atilde;o agregados em etapas de tempo de hora em hora e o resultado incluir&aacute; cada hora na s&eacute;rie de tempo.
                    </li>
                    <li> <b>Diariamente</b>&mdash;Os valores de dados ser&atilde;o agregados em etapas de tempo di&aacute;rias e o resultado incluir&aacute; cada dia na s&eacute;rie de tempo.
                    </li>
                    <li> <b>Semanalmente</b>&mdash;Os valores de dados ser&atilde;o agregados em etapas de tempo semanais e o resultado incluir&aacute; cada semana na s&eacute;rie de tempo.
                    </li>
                    <li> <b>Mensalmente</b>&mdash;Os valores de dados ser&atilde;o agregados em etapas de tempo mensais e o resultado incluir&aacute; cada m&ecirc;s na s&eacute;rie de tempo.
                    </li>
                    <li> <b>Trimestralmente</b>&mdash;Os valores de dados ser&atilde;o agregados em etapas de tempo trimestrais e o resultado incluir&aacute; cada trimestre na s&eacute;rie de tempo.
                    </li>
                    <li> <b>Anualmente</b>&mdash;Os valores de dados ser&atilde;o agregados em etapas de tempo anuais e o resultado incluir&aacute; cada ano na s&eacute;rie de tempo.
                    </li>
                    <li> <b>Diariamente Recorrente</b>&mdash;Os valores de dados ser&atilde;o agregados em etapas de tempo di&aacute;rias e o resultado incluir&aacute; um valor por dia Juliano agregado. A sa&iacute;da incluir&aacute;, no m&aacute;ximo, 366 divis&otilde;es de tempo di&aacute;rias.
                    </li>
                    <li> <b>Semanalmente Recorrente</b>&mdash;Os valores de dados ser&atilde;o agregados em etapas de tempo mensais e o resultado incluir&aacute; um valor por semana agregado. A sa&iacute;da incluir&aacute;, no m&aacute;ximo, 53 divis&otilde;es de tempo mensais.
                    </li>
                    <li> <b>Mensalmente Recorrente</b>&mdash;Os valores de dados ser&atilde;o agregados em etapas de tempo mensais e o resultado incluir&aacute; um valor por m&ecirc;s agregado. A sa&iacute;da incluir&aacute;, no m&aacute;ximo, 12 divis&otilde;es de tempo mensais.
                    </li>
                    <li> <b>Trimestralmente Recorrente</b>&mdash;Os valores de dados ser&atilde;o agregados em etapas de tempo semanais e o resultado incluir&aacute; um valor por trimestre agregado. A sa&iacute;da incluir&aacute;, no m&aacute;ximo, 4 divis&otilde;es de tempo trimestrais.
                    </li>
                    <li> <b>Por D&eacute;cada</b>&mdash;Os valores de dados ser&atilde;o agregados em 3 per&iacute;odos de 10 dias cada. O &uacute;ltimo per&iacute;odo pode conter mais ou menos do que 10 dias. A sa&iacute;da incluir&aacute; 3 divis&otilde;es para cada m&ecirc;s.
                    </li>
                    <li> <b>Pentadial</b>&mdash;Os valores de dados ser&atilde;o agregados em 6 per&iacute;odos de 5 dias cada. O &uacute;ltimo per&iacute;odo pode conter mais ou menos do que 5 dias. A sa&iacute;da incluir&aacute; 6 divis&otilde;es para cada m&ecirc;s.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="intervalValue">
        <div><h2>Intervalo do Valor</h2></div>
        <hr/>
        <div>
            <p>O tamanho do intervalo que ser&aacute; utilizado para a agrega&ccedil;&atilde;o. Este par&acirc;metro &eacute; exigido quando o par&acirc;metro  <b>Defini&ccedil;&atilde;o de Agrega&ccedil;&atilde;o</b> for configurado para <b>Valor de Intervalo</b>.
            </p>
            <p>Por exemplo, para agregar 30 anos de dados de temperatura mensais em incrementos de 5 anos, insira 5 como o  <b>Intervalo de Valor</b>, e especifique <b>Unidade</b> como <b>Anos</b>.
            </p>
        </div>
    </div>
    <div id="intervalUnit">
        <div><h2>Unidade</h2></div>
        <hr/>
        <div>
            <p>A unidade que ser&aacute; utilizada para o valor de deslocamento. Esta entrada &eacute; exigida quando a  <b>Dimens&atilde;o</b> for um campo de tempo e <b>Defini&ccedil;&atilde;o de Agrega&ccedil;&atilde;o</b> for configurada para <b>Valor de Intervalo</b>.
            </p>
            <p>Se voc&ecirc; estiver agregando qualquer coisa diferente do tempo, esta op&ccedil;&atilde;o n&atilde;o estar&aacute; dispon&iacute;vel e a unidade do valor de intervalo ir&aacute; corresponder &agrave; unidade da vari&aacute;vel dos dados raster multidimensional de entrada.
                <ul>
                    <li> <b>Horas</b>&mdash;Os valores de dados ser&atilde;o agregados em divis&otilde;es de tempo em hora em hora no intervalo fornecido.
                    </li>
                    <li> <b>Dias</b>&mdash;Os valores de dados ser&atilde;o agregados em divis&otilde;es de tempo di&aacute;rios no intervalo fornecido.
                    </li>
                    <li> <b>Semanas</b>&mdash;Os valores de dados ser&atilde;o agregados em divis&otilde;es de tempo semanais no intervalo fornecido.
                    </li>
                    <li> <b>Meses</b>&mdash;Os valores de dados ser&atilde;o agregados em divis&otilde;es de tempo mensais no intervalo fornecido.
                    </li>
                    <li> <b>Anos</b>&mdash;Os valores de dados ser&atilde;o agregados em divis&otilde;es de tempo anuais no intervalo fornecido.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="intervalRanges">
        <div><h2>Definir faixas</h2></div>
        <hr/>
        <div>
            <p>As faixas de intervalo ser&atilde;o utilizadas para agregar grupos de valores. Eles consistem de pares de valores de faixa m&iacute;nima e m&aacute;xima, com tipo de dados Duplo ou Data. Esta entrada &eacute; exigida quando a  <b>Defini&ccedil;&atilde;o de Agrega&ccedil;&atilde;o</b> for configurado para <b>Faixas de Intervalo</b>.
            </p>
        </div>
    </div>
    <div id="ignoreNodata">
        <div><h2>Ignorar valores ausentes no cálculo</h2></div>
        <hr/>
        <div>
            <p>Especifica se os valores ausentes s&atilde;o ignorados na an&aacute;lise.
                <ul>
                    <li>Marcado&mdash;A an&aacute;lise incluir&aacute; todos os pixels v&aacute;lidos ao longo de uma dimens&atilde;o fornecida e ignorar&aacute; quaisquer pixels de NoData. Este &eacute; o padr&atilde;o.
                    </li>
                    <li>Desmarcado--A an&aacute;lise resultar&aacute; em NoData se houver quaisquer valores de NoData para os pixels ao longo da dimens&atilde;o fornecida.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Nome da camada resultante</h2></div>
        <hr/>
        <div>
            
            <p>O nome da camada que ser&aacute; criada em  <b>Meu Conte&uacute;do</b> e adicionada no mapa. O nome padr&atilde;o &eacute; baseado no nome da ferramenta e o nome da camada de entrada. Se a camada j&aacute; existir, voc&ecirc; ser&aacute; solicitado para fornecer outro nome.
            </p>
            <p>Voc&ecirc; pode especificar o nome de uma pasta em  <b>Meu Conte&uacute;do</b> onde o resultado ser&aacute; salvo utilizando a caixa suspensa <b>Salvar resultados em</b> . Se você tiver os privilégios para criar camadas de imagens de mosaico e dinâmicas, será possível especificar qual tipo de camada gerar na saída usando a caixa suspensa Salvar resultado como. </p>
        </div>
    </div>
    <div id="percentileValue">
        <div><h2>Valor de percentil</h2></div>
        <hr/>
        <div>
            <p>O percentil para calcular. O padr&atilde;o &eacute; 90, indicando o 90&ordm; percentil.
            </p>
            <p>Os valores podem variar de 0 at&eacute; 100. O 0&ordm; percentil &eacute; essencialmente equivalente &agrave; estat&iacute;stica m&iacute;nima e o 100&ordm; percentil &eacute; equivalente &agrave; m&aacute;xima. Um valor de 50 produzir&aacute; essencialmente o mesmo resultado que a estat&iacute;stica mediana.
            </p>
        </div>
    </div>
    <div id="percentileInterpolationType">
        <div><h2>Tipo de interpolação de percentil</h2></div>
        <hr/>
        <div>
            <p>Especifica o m&eacute;todo de interpola&ccedil;&atilde;o de percentil que ser&aacute; usado quando houver um n&uacute;mero par de valores do raster de entrada a ser calculado.
            </p>
        </div>
    </div>
</div>
</html>
