<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="smallsize">
        <h2>Extrair Raster</h2><p/>
        <h2><img src="../images/GUID-DC9CBCB9-A07C-42D3-A0CB-2FB1483CBF4C-web.png" alt="Ferramenta Extrair Raster do Portal"></h2>
        <hr/>
    <p>Esta ferramenta pode recortar um raster para um limite, ou para uma &aacute;rea retangular ou para uma forma que voc&ecirc; defina interativamente na tela. Voc&ecirc; pode recortar na extens&atilde;o da &aacute;rea que voc&ecirc; tem atualmente exibida no seu mapa ou pela &aacute;rea de estudo definida por um pol&iacute;gono.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputLayer">
        <div><h2>Escolher dados de entrada para extrair</h2></div>
        <hr/>
        <div>
            <p>A camada de entrada para recortar.
            </p>
        </div>
    </div>
    <div id="clippingGeometry">
        <div><h2>Especificar geometria de recorte</h2></div>
        <hr/>
        <div>
            <p>Escolha o tipo de extens&atilde;o para utilizar ao recortar a geometria da camada:
                <ul>
                    <li>Utilizar extens&atilde;o atual&mdash;A extens&atilde;o de mapa atual ser&aacute; utilizada para recortar a camada resultante. Este &eacute; o padr&atilde;o.
                        

                    </li>
                    <li>Escolher &aacute;rea de estudo&mdash;Permite a voc&ecirc; definir uma geometria de recorte usando a ferramenta de desenhar.
                        

                    </li>
                    <li>Escolher camada&mdash;Escolha uma camada de fei&ccedil;&atilde;o ou camada de imagem para definir a extens&atilde;o ou escolha uma camada de fei&ccedil;&atilde;o de pol&iacute;gono para definir a geometria de recorte. Quando uma camada de fei&ccedil;&atilde;o de pol&iacute;gono &eacute; selecionada, uma caixa de sele&ccedil;&atilde;o &eacute; exibida para especificar se usar fei&ccedil;&otilde;es de entrada para recortar a geometria. Por padr&atilde;o, est&aacute; desmarcado. Significa que a camada de fei&ccedil;&atilde;o de entrada &eacute; usada para definir a extens&atilde;o. Se estiver marcado, significa que as fei&ccedil;&otilde;es de entrada s&atilde;o usadas para recortar a geometria.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="clippingType">
        <div><h2>Especificar tipo de recorte</h2></div>
        <hr/>
        <div>
            <p>Especifique se deseja reter a &aacute;rea de dentro ou de fora de sua geometria de recorte:
                <ul>
                    <li>Dados dentro da geometria&mdash;Imagens dentro das extens&otilde;es de recorte ser&atilde;o removidas. Este &eacute; o padr&atilde;o.
                        

                    </li>
                    <li>Dados fora da geometria&mdash;Imagens fora das extens&otilde;es de recorte ser&atilde;o removidas.
                        

                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="outputLayer">
        <div><h2>Nome da camada resultante</h2></div>
        <hr/>
        <div>
            
            <p>O nome da camada que ser&aacute; criada em  <b>Meu Conte&uacute;do</b> e adicionada no mapa. O nome padr&atilde;o &eacute; baseado no nome da ferramenta e o nome da camada de entrada. Se a camada j&aacute; existir, voc&ecirc; ser&aacute; solicitado para fornecer outro nome.
            </p>
            <p>Voc&ecirc; pode especificar o nome de uma pasta em  <b>Meu Conte&uacute;do</b> onde o resultado ser&aacute; salvo utilizando a caixa suspensa <b>Salvar resultados em</b> . Se você tiver os privilégios para criar camadas de imagens de mosaico e dinâmicas, será possível especificar qual tipo de camada gerar na saída usando a caixa suspensa Salvar resultado como. </p>
        </div>
    </div>
</div>
</html>
