<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Localizar Estatística de Parâmetro</h2><p/>
        <h2><img src="../images/GUID-6DE9D49F-C9CA-48B8-B14F-C8EF05FBFA42-web.png" alt="Localizar Estat&iacute;stica de Par&acirc;metro"></h2>
        <hr/>
    <p>Extracts the dimension value  or band index at which a given statistic is attained for each pixel in a multidimensional or multiband raster.
    </p>
    <p>Utilize esta ferramenta para extrair o valor de dimens&atilde;o (por exemplo, data, altura ou profundidade) no qual uma estat&iacute;stica espec&iacute;fica seja alcan&ccedil;ada na pilha de rasters em um conjunto de dados raster multidimensional. Alternativamente localize o n&uacute;mero de banda no qual a estat&iacute;stica seja alcan&ccedil;ada em um raster de m&uacute;ltiplas bandas.
    </p>
    <p>Por exemplo, voc&ecirc; pode desejar conhecer o m&ecirc;s no qual cada pixel alcan&ccedil;ou a temperatura de superf&iacute;cie do mar mais alta em 30 anos de coleta de dados. Outro exemplo &eacute; que voc&ecirc; tem uma imagem de sensoriamento remoto de oito bandas e voc&ecirc; deseja conhecer a banda em que o valor de reflect&acirc;ncia m&iacute;nimo foi alcan&ccedil;ado para cada pixel.
    </p>
    <p>Se  <b>Utilizar extens&atilde;o de mapa atual</b> estiver selecionado, as vari&aacute;veis ou bandas da camada que s&atilde;o vis&iacute;veis dentro da extens&atilde;o de mapa atual ser&atilde;o analisadas. Se desmarcado, as vari&aacute;veis ou bandas de toda a camada ser&atilde;o analisadas, mesmo que estiverem fora da extens&atilde;o de mapa atual.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputRaster">
        <div><h2>Escolher camada de imagens de múltiplas bandas ou multidimensional para analisar</h2></div>
        <hr/>
        <div>
            <p>O raster de m&uacute;ltiplas bandas ou multidimensional de entrada a ser analisado.
            </p>
        </div>
    </div>
    <div id="dimension">
        <div><h2>Escolher dimensão na qual a estatística será extraída</h2></div>
        <hr/>
        <div>
            <p>A dimens&atilde;o em que a estat&iacute;stica ser&aacute; extra&iacute;da. Se o raster de entrada n&atilde;o for um raster multidimensional, este par&acirc;metro n&atilde;o &eacute; exigido.
            </p>
        </div>
    </div>
    <div id="variables">
        <div><h2>Escolher variáveis que serão analisadas</h2></div>
        <hr/>
        <div>
            <p>A vari&aacute;vel ou vari&aacute;veis a serem analisadas. Se o raster de entrada n&atilde;o for multidimensional, os valores de pixel do raster de bandas m&uacute;ltiplas s&atilde;o consideradas a vari&aacute;vel. Se o raster de entrada for multidimensional e nenhuma vari&aacute;vel for especificada, todas as vari&aacute;veis com a dimens&atilde;o selecionada ser&atilde;o analisada.
            </p>
            <p>Por exemplo, para localizar os anos em que os valores de temperatura foram mais alto, especifique a temperatura como a vari&aacute;vel a ser analisada. Se voc&ecirc; n&atilde;o especificar quaisquer vari&aacute;veis e voc&ecirc; tem ambas a temperatura e vari&aacute;veis de precipita&ccedil;&atilde;o, ambas as vari&aacute;veis ser&atilde;o analisadas e o raster multidimensional de sa&iacute;da incluir&aacute; ambas as vari&aacute;veis.
            </p>
        </div>
    </div>
    <div id="statisticsType">
        <div><h2>Escolher tipo de estatística</h2></div>
        <hr/>
        <div>
            <p>Especifique a estat&iacute;stica para extrair da vari&aacute;vel ou vari&aacute;veis ao longo das dimens&otilde;es fornecidas.
            </p>
            <ul>
                <li> <b>Par&acirc;metro do m&iacute;nimo</b>&mdash;O valor de dimens&atilde;o em que o valor da vari&aacute;vel m&iacute;nima for alcan&ccedil;ado ser&aacute; extra&iacute;do. Este &eacute; o padr&atilde;o.
                </li>
                <li> <b>Par&acirc;metro do m&aacute;ximo</b>&mdash;O valor de dimens&atilde;o em que o valor da vari&aacute;vel m&aacute;xima for alcan&ccedil;ado ser&aacute; extra&iacute;do.
                </li>
                <li> <b>Par&acirc;metro da m&eacute;dia</b>&mdash;O valor de dimens&atilde;o em que o valor da vari&aacute;vel m&eacute;dia for alcan&ccedil;ado ser&aacute; extra&iacute;do.
                </li>
                <li> <b>Par&acirc;metro de dura&ccedil;&atilde;o</b>&mdash;A dura&ccedil;&atilde;o de dimens&atilde;o mais longa em que os valores de vari&aacute;vel caiem entre os valores m&iacute;nimo e m&aacute;ximo.
                </li>
            </ul>
            
        </div>
    </div>
    <div id="multipleOccurrenceValue">
        <div><h2>Especificar o valor de múltiplas ocorrências</h2></div>
        <hr/>
        <div>
            <p>O valor de pixel para utilizar para indicar que uma estat&iacute;stica de par&acirc;metro fornecida foi alcan&ccedil;ada mais de uma vez no conjunto de dados de raster de entrada. Se n&atilde;o especificado, o valor de pixel ser&aacute; o valor da dimens&atilde;o a primeira vez que a estat&iacute;stica de par&acirc;metro for alcan&ccedil;ada.
            </p>
        </div>
    </div>
    <div id="minValue">
        <div><h2>Especificar valor mínimo</h2></div>
        <hr/>
        <div>
            <p>O valor de vari&aacute;vel m&iacute;nimo a ser utilizado para extrair a dura&ccedil;&atilde;o.
            </p>
            <p>Este par&acirc;metro &eacute; exigido quando a  <b>Dura&ccedil;&atilde;o</b> for selecionada como o tipo de estat&iacute;stica.
            </p>
        </div>
    </div>
    <div id="maxValue">
        <div><h2>Especificar valor máximo</h2></div>
        <hr/>
        <div>
            <p>O valor de vari&aacute;vel m&aacute;ximo a ser utilizado para extrair a dura&ccedil;&atilde;o.
            </p>
            <p>Esta etapa &eacute; exigida quando a  <b>Dura&ccedil;&atilde;o</b> for selecionada como o tipo de estat&iacute;stica.
            </p>
        </div>
    </div>
    <div id="dimensionDefinition">
        <div><h2>Escolher definição de dimensão</h2></div>
        <hr/>
        <div>
            <p>Especifica como a estat&iacute;stica ser&aacute; extra&iacute;da a partir da dimens&atilde;o.
                <ul>
                    <li> <b>Todos</b>&mdash;A estat&iacute;stica ser&aacute; extra&iacute;da atrav&eacute;s de todas as dimens&otilde;es. Este &eacute; o padr&atilde;o.
                    </li>
                    <li> <b>Palavra-Chave de Intervalo</b>&mdash;A estat&iacute;stica ser&aacute; extra&iacute;da da dimens&atilde;o de tempo de acordo com a palavra-chave de intervalo.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="intervalKeyword">
        <div><h2>Escolher intervalo de palavra-chave</h2></div>
        <hr/>
        <div>
            <p>A unidade de tempo em que a estat&iacute;stica ser&aacute; extra&iacute;da.
            </p>
            <p>Por exemplo, voc&ecirc; tem cinco anos dados de temperatura de superf&iacute;cie do mar di&aacute;rios e voc&ecirc; deseja saber o ano foi observado a temperatura m&aacute;xima. Configure  <b>Par&acirc;metro do m&aacute;ximo</b> como o tipo de estat&iacute;stica, configure <b>Palavra-Chave de Intervalo</b> como a defini&ccedil;&atilde;o de dimens&atilde;o, e configurar <b>Anualmente</b> como o intervalo de palavra-chave nesta etapa.
            </p>
            <p>Alternativamente, se voc&ecirc; desejar saber o m&ecirc;s em que a temperatura m&aacute;xima foi constantemente observada, configure  <b>Par&acirc;metro do m&aacute;ximo</b> como o tipo de estat&iacute;stica, configure a <b>Palavra-Chave de Intervalo</b> como a defini&ccedil;&atilde;o de dimens&atilde;o, e configure <b>Mensalmente Recorrente</b> como o intervalo de palavra-chave nesta etapa. Isto gerar&aacute; um raster em que cada pixel cont&eacute;m o m&ecirc;s em que a estat&iacute;stica foi alcan&ccedil;ada atrav&eacute;s do registro de cinco anos (18/08/2018, 25/08/2016, 07/08/2013, por exemplo).
            </p>
            <p>Esta etapa &eacute; exigida quando  <b>StdTime</b> for configurado como a dimens&atilde;o em que a estat&iacute;stica ser&aacute; extra&iacute;da, e <b>Palavra-Chave de Intervalo</b> &eacute; selecionada para definir como a estat&iacute;stica ser&aacute; extra&iacute;da da dimens&atilde;o de tempo.
                <ul>
                    <li> <b>Diariamente Recorrente</b>&mdash; A estat&iacute;stica ser&aacute; extra&iacute;da pelos dias.
                    </li>
                    <li> <b>Semanalmente Recorrente</b>&mdash; A estat&iacute;stica ser&aacute; extra&iacute;da pelas semanas.
                    </li>
                    <li> <b>Mensalmente Recorrente</b>&mdash; A estat&iacute;stica ser&aacute; extra&iacute;da pelos meses.
                    </li>
                    <li> <b>Trimestralmente Recorrente</b>&mdash; A estat&iacute;stica ser&aacute; extra&iacute;da por trimestres.
                    </li>
                    <li> <b>A cada hora</b>&mdash;A estat&iacute;stica ser&aacute; extra&iacute;da na hora em que a estat&iacute;stica foi alcan&ccedil;ada.
                    </li>
                    <li> <b>Diariamente</b>&mdash;A estat&iacute;stica ser&aacute; extra&iacute;da no dia em que a estat&iacute;stica foi alcan&ccedil;ada.
                    </li>
                    <li> <b>Semanalmente</b>&mdash;A estat&iacute;stica ser&aacute; extra&iacute;da na semana em que a estat&iacute;stica foi alcan&ccedil;ada.
                    </li>
                    <li> <b>Mensalmente</b>&mdash;A estat&iacute;stica ser&aacute; extra&iacute;da no m&ecirc;s em que a estat&iacute;stica foi alcan&ccedil;ada.
                    </li>
                    <li> <b>Trimestralmente</b>&mdash;A estat&iacute;stica ser&aacute; extra&iacute;da no trimestre em que a estat&iacute;stica foi alcan&ccedil;ada.
                    </li>
                    <li> <b>Anualmente</b>&mdash;A estat&iacute;stica ser&aacute; extra&iacute;da no ano em que a estat&iacute;stica foi alcan&ccedil;ada.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="ignoreNodata">
        <div><h2>Ignorar valores ausentes no cálculo</h2></div>
        <hr/>
        <div>
            <p>Especifica se os valores ausentes s&atilde;o ignorados na an&aacute;lise.
                <ul>
                    <li>Se a caixa estiver marcada, a an&aacute;lise incluir&aacute; todos os pixels v&aacute;lidos ao longo de uma dimens&atilde;o fornecida e ignorar&aacute; quaisquer pixels de NoData. Este &eacute; o padr&atilde;o.
                    </li>
                    <li>Se a caixa estiver desmarcada, a an&aacute;lise resultar&aacute; em NoData se houver quaisquer valores de NoData para os pixels ao longo da dimens&atilde;o fornecida.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Nome da camada resultante</h2></div>
        <hr/>
        <div>
            
            <p>O nome da camada que ser&aacute; criada em  <b>Meu Conte&uacute;do</b> e adicionada no mapa. O nome padr&atilde;o &eacute; baseado no nome da ferramenta e o nome da camada de entrada. Se a camada j&aacute; existir, voc&ecirc; ser&aacute; solicitado para fornecer outro nome.
            </p>
            <p>Voc&ecirc; pode especificar o nome de uma pasta em  <b>Meu Conte&uacute;do</b> onde o resultado ser&aacute; salvo utilizando a caixa suspensa <b>Salvar resultados em</b> . Se você tiver os privilégios para criar camadas de imagens de mosaico e dinâmicas, será possível especificar qual tipo de camada gerar na saída usando a caixa suspensa Salvar resultado como. </p>
        </div>
    </div>
</div>
</html>
