<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="smallsize">
        <h2>Gerar Raster de Tendência</h2><p/>
        <h2><img src="../images/GUID-A95F821A-8CAF-45F3-93E5-14BDF5DA0BCD-web.png" alt="Gerar Raster de Tend&ecirc;ncia"></h2>
        <hr/>
    <p>Estimates the trend for each pixel along a dimension for one or more variables in a multidimensional raster.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputMultidimensionalRaster">
        <div><h2>Escolher camada de imagens multidimensionais para analisar tendência</h2></div>
        <hr/>
        <div>
            <p>A camada de imagens de entrada de um raster multidimensional que ser&aacute; agregado.
            </p>
        </div>
    </div>
    <div id="dimension">
        <div><h2>Escolher dimensão na qual a tendência de variável será analisada</h2></div>
        <hr/>
        <div>
            <p>A dimens&atilde;o em que uma tend&ecirc;ncia ser&aacute; extra&iacute;da para a vari&aacute;vel ou vari&aacute;veis selecionadas na an&aacute;lise.
            </p>
        </div>
    </div>
    <div id="variables">
        <div><h2>Escolher variáveis para analisar tendência</h2></div>
        <hr/>
        <div>
            <p>A vari&aacute;vel ou vari&aacute;veis em que as tend&ecirc;ncias ser&atilde;o calculadas. Se nenhuma vari&aacute;vel for especificada, a primeira vari&aacute;vel no raster multidimensional ser&aacute; analisada.
            </p>
        </div>
    </div>
    <div id="trendLineType">
        <div><h2>Escolha o tipo de linha para ajustar os valores de variáveis ao longo de uma dimensão</h2></div>
        <hr/>
        <div>
            <p>Especifica o tipo de linha a ser utilizado para ajustar os valores de pixels ao longo de uma dimens&atilde;o.
                <ul>
                    <li> <b>Linear</b>&mdash;Os valores de pixel da vari&aacute;vel ser&atilde;o ajustados ao longo de uma linha de tend&ecirc;ncia linear. Este &eacute; o padr&atilde;o.
                    </li>
                    <li> <b>Polinomial</b>&mdash;Os valores de pixel da vari&aacute;vel ser&atilde;o ajustados ao longo de uma segunda linha de tend&ecirc;ncia de ordem polinomial.
                    </li>
                    <li> <b>Harm&ocirc;nica</b>&mdash;Os valores de pixel da vari&aacute;vel ser&atilde;o ajustados ao longo de uma linha de tend&ecirc;ncia harm&ocirc;nica.
                    </li>
                    <li> <b>Mann-Kendall</b>&mdash;Os valores de pixel da vari&aacute;vel ser&atilde;o avaliados usando o teste de tend&ecirc;ncia de Mann-Kendall.
                    </li>
                    <li> <b>Sazonal-Kendall</b>&mdash;Os valores de pixel da vari&aacute;vel ser&atilde;o avaliados usando o teste de tend&ecirc;ncia Sazonal-Kendall.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="seasonalPeriod">
        <div><h2>Especificar a unidade de tempo para a duração de um período sazonal</h2></div>
        <hr/>
        <div>
            <p>Especifica a unidade de tempo a ser usada para a dura&ccedil;&atilde;o de um per&iacute;odo sazonal ao realizar o teste Sazonal-Kendall.
                <ul>
                    <li> <b>Dias</b>&mdash;A unidade para a dura&ccedil;&atilde;o do per&iacute;odo sazonal &eacute; dias. Este &eacute; o padr&atilde;o.
                    </li>
                    <li> <b>Meses</b>&mdash;A unidade para a dura&ccedil;&atilde;o do per&iacute;odo sazonal &eacute; meses.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="cycleLength">
        <div><h2>Especifique o comprimento de ciclo harmônico</h2></div>
        <hr/>
        <div>
            <p>O comprimento do modelo de varia&ccedil;&atilde;o peri&oacute;dico. Este par&acirc;metro &eacute; exigido quando o tipo da linha de tend&ecirc;ncia for configurado para  <b>Harm&ocirc;nico</b>. Por exemplo, o verde das folhas frequentemente tem um ciclo forte de varia&ccedil;&atilde;o em um ano &uacute;nico, ent&atilde;o o comprimento do ciclo &eacute; de 1 ano. Dados de temperatura de hora em hora tem um ciclo forte de varia&ccedil;&atilde;o ao longo de uma dia &uacute;nico, ent&atilde;o o comprimento do ciclo &eacute; de 1 dia.
            </p>
            <p>O comprimento padr&atilde;o &eacute; de 1 ano para dados que variam em um ciclo anual.
            </p>
            <p>Este par&acirc;metro &eacute; somente inclu&iacute;do na an&aacute;lise de tend&ecirc;ncia quando a dimens&atilde;o sendo analisada for o tempo e o tipo da linha de tend&ecirc;ncia for configurado para  <b>Harm&ocirc;nico</b>.
            </p>
        </div>
    </div>
    <div id="cycleUnit">
        <div><h2>Escolha a unidade de tempo de comprimento de ciclo harmônico</h2></div>
        <hr/>
        <div>
            <p>Especifica a unidade de tempo a ser utilizada para o comprimento de um ciclo harm&ocirc;nico.
                <ul>
                    <li> <b>Dias</b>&mdash;A unidade do comprimento do ciclo harm&ocirc;nico &eacute; de dias.
                    </li>
                    <li> <b>Anos</b>&mdash;A unidade do comprimento do ciclo harm&ocirc;nico &eacute; de anos. Este &eacute; o padr&atilde;o.
                    </li>
                </ul>
                
            </p>
            <p>Este par&acirc;metro &eacute; somente inclu&iacute;do na an&aacute;lise de tend&ecirc;ncia quando a dimens&atilde;o sendo analisada for o tempo e o tipo da linha de tend&ecirc;ncia for configurado para  <b>Harm&ocirc;nico</b>.
            </p>
        </div>
    </div>
    <div id="frequency">
        <div><h2>Especifique o número de frequência para o ajuste de tendência harmônica</h2></div>
        <hr/>
        <div>
            <p>A frequ&ecirc;ncia para utilizar no ajuste da tend&ecirc;ncia harm&ocirc;nica. Este par&acirc;metro especifica a frequ&ecirc;ncia de ciclos em um ano.
            </p>
            <p>O valor padr&atilde;o &eacute; 1 ou um ciclo harm&ocirc;nico por ano.
            </p>
            <p>Este par&acirc;metro &eacute; somente inclu&iacute;do na an&aacute;lise de tend&ecirc;ncia quando a dimens&atilde;o sendo analisada for o tempo.
            </p>
        </div>
    </div>
    <div id="polynomialOrder">
        <div><h2>Especifique o número de ordem polinômio para o ajuste de tendência</h2></div>
        <hr/>
        <div>
            <p>O n&uacute;mero de ordem polinomial para utilizar no ajuste da tend&ecirc;ncia polinomial.
            </p>
            <p>Este par&acirc;metro &eacute; somente inclu&iacute;do na an&aacute;lise de tend&ecirc;ncia quando a dimens&atilde;o sendo analisada for o tempo.
            </p>
            <p>O valor padr&atilde;o &eacute; 2 ou polin&ocirc;mio de segunda ordem.
            </p>
        </div>
    </div>
    <div id="modelStatistics">
        <div><h2>Escolha a estatística de modelo para ser incluído no raster de tendência</h2></div>
        <hr/>
        <div>
            <p>Esta ferramenta fornece tr&ecirc;s tipos de estat&iacute;stica de linha de ajuste de tend&ecirc;ncia : o erro quadr&aacute;tico m&eacute;dio (RMSE), a estat&iacute;stica de bom ajuste quadrado de R (R quadrado), e a estat&iacute;stica de valor p do coeficiente de declividade (Valor p do coeficiente de declividade). Cada estat&iacute;stica tem uma caixa de sele&ccedil;&atilde;o correspondente para especificar se ela ser&aacute; calculada e inclu&iacute;da como uma das bandas m&uacute;ltiplas no raster de tend&ecirc;ncia de sa&iacute;da.
                <ul>
                    <li>
                        <p>RMSE
                        </p>
                        <ul>
                            <li>Marcado&mdash;O RMSE ser&aacute; calculado e inclu&iacute;do como uma das bandas m&uacute;ltiplas no raster de tend&ecirc;ncia de sa&iacute;da. Este &eacute; o padr&atilde;o.
                            </li>
                            <li>Desmarcado&mdash;O RMSE n&atilde;o ser&aacute; calculado.
                            </li>
                        </ul>
                        
                    </li>
                    <li>
                        <p>R-quadrado
                        </p>
                        <ul>
                            <li>Marcado&mdash;O valor de R quadrado ser&aacute; calculado e inclu&iacute;do como um das bandas m&uacute;ltiplas na raster de tend&ecirc;ncia de sa&iacute;da.
                            </li>
                            <li>Desmarcado&mdash;O valor de R quadrado n&atilde;o ser&aacute; calculado. Este &eacute; o padr&atilde;o.
                            </li>
                        </ul>
                        
                    </li>
                    <li>
                        <p>Valor P do coeficiente de declividade
                        </p>
                        <ul>
                            <li>Marcado&mdash;O valor p ser&aacute; calculado e inclu&iacute;do como uma das bandas m&uacute;ltiplas no raster de tend&ecirc;ncia de sa&iacute;da.
                            </li>
                            <li>Desmarcado&mdash;O valor p n&atilde;o ser&aacute; calculado. Este &eacute; o padr&atilde;o.
                            </li>
                        </ul>
                        
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="ignoreNodata">
        <div><h2>Ignorar valores ausentes no cálculo</h2></div>
        <hr/>
        <div>
            <p>Especifica se os valores ausentes s&atilde;o ignorados na an&aacute;lise.
                <ul>
                    <li>Marcado&mdash;A an&aacute;lise incluir&aacute; todos os pixels v&aacute;lidos ao longo de uma dimens&atilde;o fornecida e ignorar&aacute; quaisquer pixels de NoData. Este &eacute; o padr&atilde;o.
                    </li>
                    <li>Desmarcado--A an&aacute;lise resultar&aacute; em NoData se houver quaisquer valores de NoData dos pixels ao longo da dimens&atilde;o fornecida.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Nome da camada resultante</h2></div>
        <hr/>
        <div>
            
            <p>O nome da camada que ser&aacute; criada em  <b>Meu Conte&uacute;do</b> e adicionada no mapa. O nome padr&atilde;o &eacute; baseado no nome da ferramenta e o nome da camada de entrada. Se a camada j&aacute; existir, voc&ecirc; ser&aacute; solicitado para fornecer outro nome.
            </p>
            <p>Voc&ecirc; pode especificar o nome de uma pasta em  <b>Meu Conte&uacute;do</b> onde o resultado ser&aacute; salvo utilizando a caixa suspensa <b>Salvar resultados em</b> . Se você tiver os privilégios para criar camadas de imagens de mosaico e dinâmicas, será possível especificar qual tipo de camada gerar na saída usando a caixa suspensa Salvar resultado como. </p>
        </div>
    </div>
</div>
</html>
