<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="smallsize">
        <h2>Regressão Geograficamente Ponderada</h2><p/>
        <h2><img src="../images/GUID-B304F70A-6F43-4FB0-A786-66CBCF222530-web.png" alt="Diagrama do fluxo de trabalho GeographicallyWeightedRegression"></h2>
        <hr/>
    <p>Executa Regress&atilde;o Geograficamente Ponderada (GWR) que cria um formul&aacute;rio local de regress&atilde;o linear utilizado para modelar relacionamentos variados espacialmente.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputLayer">
        <div><h2>Escolha uma camada para analisar</h2></div>
        <hr/>
        <div>
            <p>A camada que cont&eacute;m fei&ccedil;&otilde;es de ponto que cont&ecirc;m as vari&aacute;veis dependentes e explanat&oacute;rias.
            </p>
            <p>Al&eacute;m de escolher uma camada do seu mapa, voc&ecirc; pode selecionar  <b>Escolher Camada de An&aacute;lise</b> na parte inferior da lista suspensa para procurar por seu conte&uacute;do para um conjunto de dados de compartilhamento do arquivo de grandes dados ou camada de fei&ccedil;&atilde;o. Voc&ecirc; pode, opcionalmente, aplicar um filtro &agrave; sua camada de entrada ou aplicar uma sele&ccedil;&atilde;o nas camadas hospedadas adicionadas no seu mapa. Filtros e sele&ccedil;&otilde;es s&atilde;o aplicados somente para an&aacute;lise. 
            </p>
        </div>
    </div>
    <div id="dependentVariable">
        <div><h2>Escolha o campo para modelo</h2></div>
        <hr/>
        <div>
            <p>O campo num&eacute;rico que cont&eacute;m os valores observados a serem modelados e o tipo de valor que voc&ecirc; est&aacute; modelando.
            </p>
        </div>
    </div>
    <div id="explanatoryVariables">
        <div><h2>Escolha os campos explanatórios</h2></div>
        <hr/>
        <div>
            <p>Um ou mais campos representando as vari&aacute;veis explanat&oacute;rias (campos) que ajudam a prever o valor. Somente campos num&eacute;ricos estar&atilde;o vis&iacute;veis.
            </p>
        </div>
    </div>
    <div id="NeighborhoodType">
        <div><h2>Escolha como a vizinhança será determinada</h2></div>
        <hr/>
        <div>
            <p>Especifica se a vizinhan&ccedil;a utilizou &eacute; constru&iacute;da como uma dist&acirc;ncia fixa ou permitida para variar em extens&atilde;o espacial dependendo da densidade das fei&ccedil;&otilde;es.
                <ul>
                    <li> <b>N&uacute;mero de Vizinhos</b>&mdash;O tamanho da vizinhan&ccedil;a &eacute; uma fun&ccedil;&atilde;o de um n&uacute;mero especificado de vizinhos inclu&iacute;dos em c&aacute;lculos para cada fei&ccedil;&atilde;o. Onde as fei&ccedil;&otilde;es forem densas, a extens&atilde;o espacial da vizinhan&ccedil;a &eacute; menor; onde as fei&ccedil;&otilde;es forem escassas, a extens&atilde;o espacial da vizinhan&ccedil;a &eacute; maior. Quando voc&ecirc; escolher esta op&ccedil;&atilde;o, selecione o n&uacute;mero de vizinhos que deseja incluir. O n&uacute;mero deve ser um inteiro entre 2 e 5000.
                    </li>
                    <li> <b>Banda de Dist&acirc;ncia</b>&mdash;O tamanho de vizinhan&ccedil;a &eacute; uma constante ou dist&acirc;ncia fixa para cada fei&ccedil;&atilde;o. Quando voc&ecirc; escolher esta op&ccedil;&atilde;o, selecione a banda de dist&acirc;ncia para representar a extens&atilde;o espacial da vizinhan&ccedil;a.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="localWeightingScheme">
        <div><h2>Escolha como as feições de vizinhança são ponderadas</h2></div>
        <hr/>
        <div>
            <p>Especifica o tipo de n&uacute;cleo que ser&aacute; utilizado para fornecer a pondera&ccedil;&atilde;o espacial no modelo. O n&uacute;cleo define como cada fei&ccedil;&atilde;o &eacute; relacionada a outras fei&ccedil;&otilde;es dentro de sua vizinhan&ccedil;a.
                <ul>
                    <li> <b>Bisquare</b>&mdash;Um peso de 0 ser&aacute; atribu&iacute;da para qualquer fei&ccedil;&atilde;o fora da vizinhan&ccedil;a especificada. Este &eacute; o padr&atilde;o.
                    </li>
                    <li> <b>Gaussiano</b>&mdash;Todas as fei&ccedil;&otilde;es receber&atilde;o pesos, mas os pesos se tornam exponencialmente menores de acordo com a distante da fei&ccedil;&atilde;o alvo.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="outputTrainedName">
        <div><h2>Nome da camada resultante</h2></div>
        <hr/>
        <div>
            <p> O nome da camada que ser&aacute; criada. Se voc&ecirc; estiver gravando em um ArcGIS Data Store, seus resultados ser&atilde;o salvos em  <b>Meu Conte&uacute;do</b> e adicionados no mapa. Se voc&ecirc; estiver gravando em um compartilhamento do arquivo de grandes dados, seus resultados ser&atilde;o armazenados no compartilhamento do arquivo de grandes dados e adicionados em seu manifesto. N&atilde;o ser&atilde;o adicionados no mapa. O nome padr&atilde;o &eacute; baseado no nome da ferramenta e o nome da camada de entrada. Se a camada j&aacute; existe, a ferramenta falhar&aacute;.
            </p>
            <p>Ao gravar no  ArcGIS Data Store  (armazenamento de grandes dados de espa&ccedil;o-tempo ou relacional) utilizando a caixa suspensa  <b>Salvar resultados em</b> , voc&ecirc; pode especificar o nome de uma pasta em <b>Meu Conte&uacute;do</b> onde o resultado ser&aacute; salvo.
            </p>
        </div>
    </div>
</div>
</html>
