<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="smallsize">
        <h2>Caminho Favorável como Raster</h2><p/>
        <h2><img src="../images/GUID-75C94369-AAAA-4556-8F89-9B6AA39012C9-web.png" alt="Ilustra&ccedil;&atilde;o da ferramenta Caminho Favor&aacute;vel como Raster"></h2>
        <hr/>
    <p>Esta ferramenta calcula o caminho ideal dos destinos &agrave;s origens como um raster.
    </p>
    <p>Aplica&ccedil;&otilde;es de exemplo incluem o seguinte:
        <ul>
            <li>Encontrar a rota favor&aacute;vel para uma nova estrada.
                


            </li>
            <li>Encontrar o tra&ccedil;ado &agrave; jusante deu ma localiza&ccedil;&atilde;o.
            </li>
        </ul>
        
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputDestinationRasterOrFeatures">
        <div><h2>Escolher feições ou raster de destino</h2></div>
        <hr/>
        <div>
            <p>Uma camada de fei&ccedil;&atilde;o ou raster que identifica as c&eacute;lulas a partir das quais o caminho favor&aacute;vel &eacute; determinado at&eacute; a origem favor&aacute;vel.
            </p>
            <p>Se a entrada for um raster, dever&aacute; consistir em c&eacute;lulas com valores v&aacute;lidos (zero &eacute; um valor v&aacute;lido) para os destinos e as c&eacute;lulas restantes dever&atilde;o ser atribu&iacute;das a NoData. O tipo do raster de entrada deve ser inteiro.
            </p>
        </div>
    </div>
    <div id="destinationField">
        <div><h2>Campo de destino (opcional)</h2></div>
        <hr/>
        <div>
            <p>O campo utilizado para obter valores das localiza&ccedil;&otilde;es de destino.
            </p>
            <p>Este campo deve ser do tipo inteiro.
            </p>
        </div>
    </div>
    <div id="inputDistanceAccumulationRaster">
        <div><h2>Escolher raster de acumulação de distância</h2></div>
        <hr/>
        <div>
            <p>O raster de acumula&ccedil;&atilde;o de dist&acirc;ncia &eacute; utilizado para determinar o caminho favor&aacute;vel dos destinos at&eacute; as origens.
            </p>
            <p>O raster de acumula&ccedil;&atilde;o de dist&acirc;ncia geralmente &eacute; criado com as ferramentas Acumula&ccedil;&atilde;o de Dist&acirc;ncia ou Aloca&ccedil;&atilde;o de Dist&acirc;ncia. Cada c&eacute;lula do raster de acumula&ccedil;&atilde;o de dist&acirc;ncia representa a dist&acirc;ncia cumulativa de custo m&iacute;nima sobre uma superf&iacute;cie de cada c&eacute;lula at&eacute; um conjunto de c&eacute;lulas de origem.
            </p>
        </div>
    </div>
    <div id="inputBackDirectionRaster">
        <div><h2>Escolher raster da direção de volta ou direção do fluxo</h2></div>
        <hr/>
        <div>
            <p>O raster da dire&ccedil;&atilde;o de volta cont&eacute;m as dire&ccedil;&otilde;es calculadas em graus. A dire&ccedil;&atilde;o identifica a pr&oacute;xima c&eacute;lula ao longo do caminho favor&aacute;vel de volta at&eacute; a origem de custo acumulativo mais pr&oacute;xima, evitando barreiras.
            </p>
            <p>O raster da dire&ccedil;&atilde;o de volta geralmente &eacute; criado com as ferramentas Acumula&ccedil;&atilde;o de Dist&acirc;ncia ou Aloca&ccedil;&atilde;o de Dist&acirc;ncia. Neste caso, o intervalo de valores &eacute; de 0 graus a 360 graus. O valor 0 &eacute; reservado para as c&eacute;lulas de origem. Devido ao leste (direita) ser 90 graus e os valores aumentarem no sentido hor&aacute;rio (180 &eacute; sul, 270 &eacute; oeste e 360 &eacute; norte).
            </p>
            <p>O caminho favor&aacute;vel criado pode ser um caminho de fluxo com base na dire&ccedil;&atilde;o de fluxo D8. Para gerar um caminho favor&aacute;vel desta maneira, use um raster de dire&ccedil;&atilde;o de fluxo D8 como entrada para este par&acirc;metro.
            </p>
        </div>
    </div>
    <div id="pathType">
        <div><h2>Tipo de caminho (opcional)</h2></div>
        <hr/>
        <div>
            <p>Especifica uma palavra-chave que define como os valores e zonas nos dados de destino de entrada ser&atilde;o interpretados nos c&aacute;lculos do caminho.
                <ul>
                    <li> <b>Para Cada Zona</b>&mdash;Para cada zona nos dados de destino de entrada, um caminho de menor custo &eacute; determinado. Com esta op&ccedil;&atilde;o, o caminho de menor custo para cada zona come&ccedil;a na c&eacute;lula com a menor pondera&ccedil;&atilde;o de dist&acirc;ncia de custo na zona. Este &eacute; o padr&atilde;o.
                         
                    </li>
                    <li> <b>&Uacute;nico Melhor</b>&mdash;Para todas as c&eacute;lulas nos dados de destino de entrada, o caminho de menor custo &eacute; derivado da c&eacute;lula com o m&iacute;nimo dos caminhos de menor custo at&eacute; as c&eacute;lulas de origem.
                    </li>
                    <li> <b>Cada C&eacute;lula</b>&mdash;Para cada c&eacute;lula com valores v&aacute;lidos nos dados de destino de entrada, um caminho de menor custo &eacute; determinado. Com esta op&ccedil;&atilde;o, cada c&eacute;lula dos dados de destino de entrada &eacute; tratada separadamente e um caminho de menor custo &eacute; determinado para cada c&eacute;lula.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="outputRasterName">
        <div><h2>Nome da camada de raster resultante</h2></div>
        <hr/>
        <div>
            
            <p>O nome da camada que ser&aacute; criada em  <b>Meu Conte&uacute;do</b> e adicionada no mapa. O nome padr&atilde;o &eacute; baseado no nome da ferramenta e o nome da camada de entrada. Se a camada j&aacute; existir, voc&ecirc; ser&aacute; solicitado para fornecer outro nome.
            </p>
            <p>Voc&ecirc; pode especificar o nome de uma pasta em  <b>Meu Conte&uacute;do</b> onde o resultado ser&aacute; salvo utilizando a caixa suspensa <b>Salvar resultados em</b> . Se você tiver os privilégios para criar camadas de imagens de mosaico e dinâmicas, será possível especificar qual tipo de camada gerar na saída usando a caixa suspensa Salvar resultado como. </p>
        </div>
    </div>
</div>
</html>
