<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Sobrepor Camadas</h2><p/>
        <h2><img src="../images/GUID-00A64703-4E97-4398-AE5C-F1885375BC30-web.png" alt="Sobrepor Camadas
"></h2>
        <hr/>
    <p>Sobrepor Camadas combina duas ou mais camadas em uma camada. Voc&ecirc; pode pensar na sobreposi&ccedil;&atilde;o como a troca de uma pilha de mapas e cria&ccedil;&atilde;o de um &uacute;nico mapa contendo todas as informa&ccedil;&otilde;es localizadas na pilha. A sobreposi&ccedil;&atilde;o &eacute; mais que uma jun&ccedil;&atilde;o de trabalho da linha; todos os atributos das fei&ccedil;&otilde;es na sobreposi&ccedil;&atilde;o s&atilde;o inclu&iacute;das no produto final. A sobreposi&ccedil;&atilde;o &eacute; utilizada para responder uma das perguntas mais b&aacute;sicas da geografia: O que est&aacute; por cima do que? 
    </p>
    <p>Os seguintes s&atilde;o exemplos:
        <ul>
            <li>Quais lotes est&atilde;o dentro da plan&iacute;cie alagada de 100 anos? (Dentro &eacute; um outro modo de dizer sobre.)
                  
            </li>
            <li>Qual uso do solo est&aacute; sobre qual tipo de solo?
                 
            </li>
            <li>Quais po&ccedil;os est&atilde;o dentro de bases militares abandonadas?
            </li>
        </ul>
        
    </p>
    <p>Se  <b>Utilizar extens&atilde;o de mapa atual</b> estiver selecionada, somente as fei&ccedil;&otilde;es nas camadas de entrada e de sobreposi&ccedil;&atilde;o que s&atilde;o vis&iacute;veis dentro da extens&atilde;o de mapa atual ser&atilde;o sobrepostas. Se n&atilde;o estiver selecionada, todas as fei&ccedil;&otilde;es na camada de entrada e camada de sobreposi&ccedil;&atilde;o ser&atilde;o sobrepostas, mesmo que estiverem fora da extens&atilde;o de mapa atual.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputLayer">
        <div><h2>Escolha a camada de entrada</h2></div>
        <hr/>
        <div>
            <p>A camada de ponto, linha ou &aacute;rea que ser&aacute; sobreposta.
            </p>
            <p>Al&eacute;m de escolher uma camada do seu mapa, voc&ecirc; pode selecionar  <b>Escolher Camada de An&aacute;lise</b> localizado na parte inferior da lista suspensa. Esta op&ccedil;&atilde;o abre uma galeria onde voc&ecirc; pode procurar e selecionar conjunto de dados de v&aacute;rias fontes para utilizar em sua an&aacute;lise. 
            </p>
        </div>
    </div>
    <div id="overlayLayer">
        <div><h2>Escolher camada de sobreposição</h2></div>
        <hr/>
        <div>
            <p>A camada a ser sobreposta na camada de entrada.  
            </p>
            <p>Al&eacute;m de escolher uma camada do seu mapa, voc&ecirc; pode selecionar  <b>Escolher Camada de An&aacute;lise</b> na parte inferior da lista suspensa para procurar por seu conte&uacute;do para um conjunto de dados de compartilhamento do arquivo de grandes dados ou camada de fei&ccedil;&atilde;o. Voc&ecirc; pode, opcionalmente, aplicar um filtro &agrave; sua camada de entrada ou aplicar uma sele&ccedil;&atilde;o nas camadas hospedadas adicionadas no seu mapa. Filtros e sele&ccedil;&otilde;es s&atilde;o aplicados somente para an&aacute;lise. 
            </p>
        </div>
    </div>
    <div id="OverlayType">
        <div><h2>Escolher método de sobreposição</h2></div>
        <hr/>
        <div>
            <p>Especifica o m&eacute;todo de sobreposi&ccedil;&atilde;o que combinar&aacute; a camada de entrada e a camada de sobreposi&ccedil;&atilde;o.  

                <ul>
                    <li> <b>Interseccionar</b>&mdash;Somente as fei&ccedil;&otilde;es ou por&ccedil;&otilde;es de fei&ccedil;&otilde;es na camada de sobreposi&ccedil;&atilde;o que sobrep&otilde;em com fei&ccedil;&otilde;es na camada de entrada ser&atilde;o combinadas.
                    </li>
                    <li> <b>Apagar</b>&mdash;As fei&ccedil;&otilde;es ou partes de fei&ccedil;&otilde;es na camada de sobreposi&ccedil;&atilde;o que sobrep&otilde;em com &aacute;reas na camada de entrada ser&atilde;o combinadas.
                    </li>
                    <li> <b>Uni&atilde;o</b>&mdash;Todas as fei&ccedil;&otilde;es de ambas as camadas ser&atilde;o combinadas, criando uma uni&atilde;o geom&eacute;trica da camada de entrada e camada de sobreposi&ccedil;&atilde;o.  Todas as fei&ccedil;&otilde;es e seus atributos ser&atilde;o gravados na camada.
                    </li>
                    <li> <b>Identidade</b>&mdash;As fei&ccedil;&otilde;es ou por&ccedil;&otilde;es de fei&ccedil;&otilde;es na camada de entrada camada de sobreposi&ccedil;&atilde;o ser&atilde;o combinadas. As fei&ccedil;&otilde;es ou por&ccedil;&otilde;es de fei&ccedil;&otilde;es que sobrep&otilde;em em ambas camada de entrada e camada de sobreposi&ccedil;&atilde;o ser&atilde;o gravadas na camada de sa&iacute;da.
                    </li>
                    <li> <b>Diferen&ccedil;a Sim&eacute;trica</b>&mdash;As fei&ccedil;&otilde;es ou por&ccedil;&otilde;es de fei&ccedil;&otilde;es da camada de entrada e a camada de sobreposi&ccedil;&atilde;o que n&atilde;o sobrep&otilde;em ser&atilde;o combinadas.
                    </li>
                </ul>
                
            </p> 
        </div>
    </div>
    <div id="outputLayer">
        <div><h2>Nome da camada resultante</h2></div>
        <hr/>
        <div>
            <p>O nome da camada que ser&aacute; criada em  <b>Meu Conte&uacute;do</b> e adicionada no mapa. Ter&aacute; o mesmo tipo de fei&ccedil;&atilde;o (&aacute;reas, linhas ou pontos) como camadas de entrada e de sobreposi&ccedil;&atilde;o. O nome padr&atilde;o &eacute; baseado no m&eacute;todo de sobreposi&ccedil;&atilde;o e nome da camada de entrada. Se a camada j&aacute; existir, voc&ecirc; ser&aacute; solicitado para fornecer outro nome.
            </p>
            <p>Ao utilizar a caixa suspensa  <b>Salvar resultado em</b>, &eacute; poss&iacute;vel especificar o nome de uma pasta em <b>Meu Conte&uacute;do</b> onde o resultado ser&aacute; salvo.
            </p>
        </div>
    </div>
</div>
</html>
