<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="smallsize">
        <h2>Prever Utilizando Raster de Tendência</h2><p/>
        <h2><img src="../images/GUID-E3758820-51A9-46DE-AAF6-E27B68DE4012-web.png" alt="Prever Utilizando Raster de Tend&ecirc;ncia"></h2>
        <hr/>
    <p>Computes a forecasted multidimensional raster using the output trend raster from the  Generate Trend Raster tool.
    </p>
    <p>Se  <b>Utilizar extens&atilde;o de mapa atual</b> estiver selecionada, as vari&aacute;veis da camada que s&atilde;o vis&iacute;veis dentro da extens&atilde;o de mapa atual ser&atilde;o analisadas. Se desmarcada, as vari&aacute;veis da camada total ser&atilde;o analisadas, mesmo que estiverem fora da extens&atilde;o de mapa atual.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputMultidimensionalRaster">
        <div><h2>Escolher camada de imagens multidimensionais para prever</h2></div>
        <hr/>
        <div>
            <p>O raster de tend&ecirc;ncia multidimensional de entrada da ferramenta  Gerar Raster de Tend&ecirc;ncia .
            </p>
        </div>
    </div>
    <div id="variables">
        <div><h2>Escolher as variáveis que serão previstas</h2></div>
        <hr/>
        <div>
            <p>A vari&aacute;vel ou vari&aacute;veis que ser&atilde;o previstas na an&aacute;lise. Se nenhuma vari&aacute;vel for especificada, todas as vari&aacute;veis ser&atilde;o utilizadas.
            </p>
        </div>
    </div>
    <div id="dimensionDefinition">
        <div><h2>Escolha o método utilizado para fornecer valores de dimensão de previsão</h2></div>
        <hr/>
        <div>
            <p>Especifica o m&eacute;todo utilizado para fornecer valores de dimens&atilde;o de previs&atilde;o.
                <ul>
                    <li> <b>Por Valor</b>&mdash;A previs&atilde;o ser&aacute; calculada para um valor de dimens&atilde;o &uacute;nico ou uma lista de valores de dimens&atilde;o especificados na pr&oacute;xima etapa. Este &eacute; o padr&atilde;o. Por exemplo, voc&ecirc; deseja prever a precipita&ccedil;&atilde;o anual pelos anos 2050, 2100 e 2150.
                    </li>
                    <li> <b>Por Intervalo</b>&mdash;A previs&atilde;o ser&aacute; calculada para um intervalo de dimens&atilde;o definido por um valor inicial e um valor final. Por exemplo, voc&ecirc; deseja prever a precipita&ccedil;&atilde;o anual para cada ano entre 2050 e 2150.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="dimensionValues">
        <div><h2>Especificar valores de dimensão para previsão</h2></div>
        <hr/>
        <div>
            <p>O valor de dimens&atilde;o ou valores a serem utilizados na previs&atilde;o.
            </p>
            <p>O formato do tempo, profundidade, e valores de altura devem corresponder ao formato dos valores de dimens&atilde;o utilizados para gerar o raster de tend&ecirc;ncia. Se o raster de tend&ecirc;ncia foi gerado para a dimens&atilde;o StdTime, o formato dever&aacute; ser YYYY-MM-DDTHH:MM:SS, por exemplo 2050-01-01T00:00:00. M&uacute;ltiplos valores s&atilde;o separados com um ponto-e-v&iacute;rgula.
            </p>
            <p>Este par&acirc;metro &eacute; exigido quando o m&eacute;todo  <b>Por Valor</b> &eacute; selecionado para definir valores de dimens&atilde;o para previs&atilde;o.
            </p>
        </div>
    </div>
    <div id="start">
        <div><h2>Iniciar</h2></div>
        <hr/>
        <div>
            <p>A data inicial, altura ou profundidade do intervalo de dimens&atilde;o a ser utilizado na previs&atilde;o.
            </p>
        </div>
    </div>
    <div id="end">
        <div><h2>Final</h2></div>
        <hr/>
        <div>
            <p>A data final, altura ou profundidade do intervalo de dimens&atilde;o a ser utilizado na previs&atilde;o.
            </p>
        </div>
    </div>
    <div id="dimensionInterval">
        <div><h2>Definir o intervalo de dimensão para previsão</h2></div>
        <hr/>
        <div>
            <p>Define a data inicial e data final, altura ou profundidade do intervalo de dimens&atilde;o a ser utilizado na previs&atilde;o.
            </p>
        </div>
    </div>
    <div id="intervalValue">
        <div><h2>Especificar o número de etapas entre os valores inicial e final</h2></div>
        <hr/>
        <div>
            <p>O n&uacute;mero de etapas entre dois valores de dimens&atilde;o a ser inclu&iacute;do na previs&atilde;o. O valor padr&atilde;o &eacute; 1.
            </p>
            <p>Por exemplo, para prever valores de temperatura a cada cinco anos, utilize um valor de 5.
            </p>
        </div>
    </div>
    <div id="intervalUnit">
        <div><h2>Escolha a unidade que será utilizada para o intervalo de valor do tempo.</h2></div>
        <hr/>
        <div>
            <p>Especifica a unidade que ser&aacute; utilizada para o intervalo de valor. Isto se aplica somente quando a dimens&atilde;o de an&aacute;lise &eacute; uma dimens&atilde;o de tempo.
            </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Nome da camada resultante</h2></div>
        <hr/>
        <div>
            
            <p>O nome da camada que ser&aacute; criada em  <b>Meu Conte&uacute;do</b> e adicionada no mapa. O nome padr&atilde;o &eacute; baseado no nome da ferramenta e o nome da camada de entrada. Se a camada j&aacute; existir, voc&ecirc; ser&aacute; solicitado para fornecer outro nome.
            </p>
            <p>Voc&ecirc; pode especificar o nome de uma pasta em  <b>Meu Conte&uacute;do</b> onde o resultado ser&aacute; salvo utilizando a caixa suspensa <b>Salvar resultados em</b> . Se você tiver os privilégios para criar camadas de imagens de mosaico e dinâmicas, será possível especificar qual tipo de camada gerar na saída usando a caixa suspensa Salvar resultado como. </p>
        </div>
    </div>
</div>
</html>
