<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Amostra</h2><p/>
        <h2><img src="../images/GUID-3950CCA3-C1D0-493F-A33D-93673443ADD2-web.png" alt="Amostra"></h2>
        <hr/>
    <p>Esta ferramenta cria uma tabela ou uma classe de fei&ccedil;&atilde;o de ponto que mostra os valores das c&eacute;lulas de um raster, ou conjunto de rasters, para locais definidos. Os locais s&atilde;o definidos por c&eacute;lulas de raster, fei&ccedil;&otilde;es de pol&iacute;gono, fei&ccedil;&otilde;es de polilinha ou por um conjunto de pontos.
    </p>
    <p>Alguns exemplos de aplica&ccedil;&otilde;es desta ferramenta incluem o seguinte:
        <ul>
            <li> Extraia atributos para localiza&ccedil;&atilde;o da torre de celular de v&aacute;rios rasters, como uso do solo, tipo de solo, eleva&ccedil;&atilde;o e dist&acirc;ncia at&eacute; a estrada.
            </li>
            <li>Extraia a temperatura do solo em diferentes profundidades para um determinado conjunto de pontos.
            </li>
            <li>A partir de 30 anos de dados mensais de temperatura da superf&iacute;cie do mar, resuma em locais de animais ou dentro de &aacute;reas de vida para um determinado momento quando uma esp&eacute;cie animal foi observada.
            </li>
        </ul>
        
    </p>
    <p>Se  <b>Utilizar extens&atilde;o de mapa atual</b> estiver selecionado, as vari&aacute;veis ou bandas da camada que s&atilde;o vis&iacute;veis dentro da extens&atilde;o de mapa atual ser&atilde;o analisadas. Se desmarcado, as vari&aacute;veis ou bandas de toda a camada ser&atilde;o analisadas, mesmo que estiverem fora da extens&atilde;o de mapa atual.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inRasters">
        <div><h2>Escolher camadas de imagens para amostrar</h2></div>
        <hr/>
        <div>
            <p>Uma &uacute;nica imagem ou uma lista de imagens cujos valores ser&atilde;o amostrados com base nos dados do local de entrada. 
            </p>
            <p>Para amostrar todas as partes de uma camada de imagens multidimensional, ela deve ser o &uacute;nico raster de entrada.
            </p>
        </div>
    </div>
    <div id="inLocationData">
        <div><h2>Escolher camada de localização</h2></div>
        <hr/>
        <div>
            <p>Dados que identificam as posi&ccedil;&otilde;es que voc&ecirc; deseja amostrar.
            </p>
            <p>Os dados do local de entrada podem ser um raster ou uma classe de fei&ccedil;&atilde;o de ponto, polilinha ou pol&iacute;gono.
            </p>
        </div>
    </div>
    <div id="uniqueIdField">
        <div><h2>Especificar campo ID Único</h2></div>
        <hr/>
        <div>
            <p>Um campo que cont&eacute;m um valor diferente para cada local ou fei&ccedil;&atilde;o na classe de fei&ccedil;&atilde;o ou raster do local de entrada.
            </p>
        </div>
    </div>
    <div id="acquisitionDefinition">
        <div><h2>Especificar informações de aquisição dos dados de localização (Opcional)</h2></div>
        <hr/>
        <div>
            <p>Especifique o tempo, a profundidade ou outros dados de aquisi&ccedil;&atilde;o associados a c&eacute;lulas ou fei&ccedil;&otilde;es de localiza&ccedil;&atilde;o.
            </p>
            <p>Para cada dimens&atilde;o, h&aacute; tr&ecirc;s op&ccedil;&otilde;es para especificar as informa&ccedil;&otilde;es de aquisi&ccedil;&atilde;o associadas a c&eacute;lulas ou fei&ccedil;&otilde;es de localiza&ccedil;&atilde;o:
            </p>
            <ul>
                <li> <b>Valor ou campo &uacute;nico</b>&mdash;Quando esta op&ccedil;&atilde;o &eacute; selecionada, as seguintes informa&ccedil;&otilde;es devem ser especificadas:
                    <ul>
                        <li> <b>Valor ou campo de dimens&atilde;o</b>&mdash;Selecione um campo de valores de dimens&atilde;o nos dados de localiza&ccedil;&atilde;o ou insira um valor de dimens&atilde;o espec&iacute;fico.
                        </li>
                    </ul>
                    
                    

                </li>
                <li> <b>Valor ou campo &uacute;nico com valores relativos</b>&mdash;Se esta op&ccedil;&atilde;o estiver selecionada, as informa&ccedil;&otilde;es abaixo dever&atilde;o ser especificadas juntas para definir o intervalo dentro do qual as estat&iacute;sticas ser&atilde;o calculadas para vari&aacute;veis:
                    <ul>
                        <li> <b>Valor ou campo de dimens&atilde;o</b>&mdash;Selecione um campo de valores de dimens&atilde;o nos dados de localiza&ccedil;&atilde;o.
                        </li>
                        <li> <b>Valor relativo antes</b>&mdash;Especifica um n&uacute;mero n&atilde;o negativo utilizado para subtrair do <b>Valor ou campo de dimens&atilde;o</b> para definir o come&ccedil;o de um intervalo do valor de dimens&atilde;o. Este valor representa o n&uacute;mero de dias se a dimens&atilde;o for hora.
                        </li>
                        <li> <b>Valor relativo ap&oacute;s</b>&mdash;Especifica um n&uacute;mero n&atilde;o negativo utilizado para adicionar ao <b>Valor ou campo de dimens&atilde;o</b> para definir o final de um intervalo do valor de dimens&atilde;o. Este valor representa o n&uacute;mero de dias se a dimens&atilde;o for hora.
                        </li>
                    </ul>
                    
                </li>
                <li> <b>Valores ou campos iniciais e finais</b>&mdash;Se esta op&ccedil;&atilde;o estiver selecionada, as informa&ccedil;&otilde;es abaixo dever&atilde;o ser especificadas juntas para definir o intervalo dentro do qual as estat&iacute;sticas ser&atilde;o calculadas para vari&aacute;veis:
                    <ul>
                        <li> <b>Valores ou campo inicial</b>&mdash;Selecione um campo de valores de dimens&atilde;o nos dados de localiza&ccedil;&atilde;o ou insira um valor de dimens&atilde;o espec&iacute;fico para definir o come&ccedil;o de um intervalo do valor de dimens&atilde;o.
                        </li>
                        <li> <b>Valores ou campo final</b>&mdash;Selecione um campo de valores de dimens&atilde;o nos dados de localiza&ccedil;&atilde;o ou insira um valor de dimens&atilde;o espec&iacute;fico para definir o final de um intervalo do valor de dimens&atilde;o.
                        </li>
                    </ul>
                    
                    

                </li>
            </ul>
            
            <p>Este par&acirc;metro est&aacute; dispon&iacute;vel somente quando o par&acirc;metro  <b>Escolher camada de imagens para amostrar</b> &eacute; um raster multidimensional.
            </p>
        </div>
    </div>
    <div id="bufferDistance">
        <div><h2>Especificar valor ou campo de distância do buffer</h2></div>
        <hr/>
        <div>
            <p>A dist&acirc;ncia especificada em torno das fei&ccedil;&otilde;es dos dados de localiza&ccedil;&atilde;o. A dist&acirc;ncia do buffer &eacute; especificada nas unidades lineares da refer&ecirc;ncia espacial da fei&ccedil;&atilde;o de localiza&ccedil;&atilde;o. Se a fei&ccedil;&atilde;o utilizar uma refer&ecirc;ncia geogr&aacute;fica, a unidade ser&aacute; em graus.
            </p>
            <p>As estat&iacute;sticas ser&atilde;o calculadas dentro desta &aacute;rea do buffer.
            </p>
            <p>Este par&acirc;metro est&aacute; dispon&iacute;vel somente quando  <b>Escolher camada de imagens para amostrar</b> &eacute; um raster multidimensional.
            </p>
        </div>
    </div>
    <div id="statisticsType">
        <div><h2>Escolher tipo de estatística</h2></div>
        <hr/>
        <div>
            <p>O tipo de estat&iacute;stica ser calculada.
            </p>
            <ul>
                <li> <b>M&iacute;nimo</b>&mdash;Localiza o valor m&iacute;nimo dentro do intervalo especificado.
                </li>
                <li> <b>M&aacute;ximo</b>&mdash;Localiza o valor m&aacute;ximo dentro do intervalo especificado.
                </li>
                <li> <b>Mediano</b>&mdash;Localiza o valor mediano dentro do intervalo especificado.
                </li>
                <li> <b>M&eacute;dia</b>&mdash;Calcula a m&eacute;dia para o intervalo especificado.
                </li>
                <li> <b>Soma</b>&mdash;Calcula a soma das vari&aacute;veis dentro do intervalo especificado.
                </li>
                <li> <b>Maioria</b>&mdash;Localiza o valor que ocorre com mais frequ&ecirc;ncia.
                </li>
                <li> <b>Minoria</b>&mdash;Localiza o valor que ocorre com menos frequ&ecirc;ncia.
                </li>
                <li> <b>Desvio Padr&atilde;o</b>&mdash;Calcula o desvio padr&atilde;o.
                </li>
                <li> <b>Percentil</b>&mdash;Calcula um percentil definido dentro do intervalo especificado.
                </li>
            </ul>
            
            <p>Este par&acirc;metro est&aacute; dispon&iacute;vel somente quando o par&acirc;metro  <b>Escolher camada de imagens para amostrar</b> &eacute; um raster multidimensional, e os par&acirc;metros <b>Escolher camada de localiza&ccedil;&atilde;o</b> s&atilde;o polilinhas ou pol&iacute;gonos, ou <b>Especificar campo ou valor de dist&acirc;ncia do buffer (Opcional)</b> &eacute; selecionado.
            </p>
        </div>
    </div>
    <div id="percentileValue">
        <div><h2>Valor de percentil</h2></div>
        <hr/>
        <div>
            <p>Este valor pode variar de 0 a 100. O padr&atilde;o &eacute; 90.
            </p>
            <p>Este par&acirc;metro est&aacute; dispon&iacute;vel somente quando o par&acirc;metro  <b>Escolher tipo de estat&iacute;stica</b> &eacute; configurado para <b>Percentil</b>.
            </p>
        </div>
    </div>
    <div id="resamplingType">
        <div><h2>Especificar técnica de reamostragem</h2></div>
        <hr/>
        <div>
            <p>Algoritmo de reamostragem utilizado ao amostrar um raster.
            </p>
            <ul>
                <li> <b>Mais pr&oacute;ximo</b>&mdash;O vizinho mais pr&oacute;ximo, que utiliza o valor da c&eacute;lula mais pr&oacute;xima para atribuir um valor para a c&eacute;lula de sa&iacute;da durante a reamostragem. Este &eacute; o padr&atilde;o.
                </li>
                <li> <b>Bilinear</b>&mdash;Interpola&ccedil;&atilde;o bilinear, que determina o novo valor de uma c&eacute;lula baseado em uma m&eacute;dia da dist&acirc;ncia ponderada dos quatro centros da c&eacute;lula de entrada mais pr&oacute;xima.
                </li>
                <li> <b>C&uacute;bica</b>&mdash;Convolu&ccedil;&atilde;o c&uacute;bica, que determina o novo valor de uma c&eacute;lula baseado no ajuste de uma curva de suaviza&ccedil;&atilde;o atrav&eacute;s de 16 centros da c&eacute;lula de entrada mais pr&oacute;xima.
                </li>
            </ul>
            
        </div>
    </div>
    <div id="layout">
        <div><h2>Especificar layout de saída</h2></div>
        <hr/>
        <div>
            <p>Especifica se os valores amostrados aparecem em linhas ou colunas na tabela de sa&iacute;da.
            </p>
            <ul>
                <li> <b>Os valores amostrados aparecem na linha</b>&mdash;Os valores amostrados aparecem em linhas separadas na tabela de sa&iacute;da. Este &eacute; o padr&atilde;o.
                </li>
                <li> <b>Os valores amostrados aparecem na coluna</b>&mdash;Os valores amostrados aparecem em colunas separadas na tabela de sa&iacute;da.
                </li>
            </ul>
            
            <p>Este par&acirc;metro est&aacute; dispon&iacute;vel somente quando o par&acirc;metro  <b>Escolher camada de imagens para amostrar</b> &eacute; um raster multidimensional e cont&eacute;m uma vari&aacute;vel e uma dimens&atilde;o, e cada parte &eacute; um raster de banda &uacute;nica.
            </p>
        </div>
    </div>
    <div id="outputType">
        <div><h2>Especificar tipo de saída</h2></div>
        <hr/>
        <div>
            <p>Especifica se gerar uma classe de fei&ccedil;&atilde;o de ponto com valores amostrados em sua tabela ou somente uma tabela com valores amostrados.
            </p>
            <ul>
                <li> <b>Tabela</b>&mdash;Gera uma tabela com valores amostrados. Este &eacute; o padr&atilde;o.
                </li>
                <li> <b>Fei&ccedil;&otilde;es</b>&mdash;Gera uma classe de fei&ccedil;&atilde;o de ponto com valores amostrados em sua tabela. Se os par&acirc;metros <b>Escolher camada de localiza&ccedil;&atilde;o</b> forem polilinhas ou pol&iacute;gonos, cada ponto na sa&iacute;da ser&aacute; o centr&oacute;ide de cada geometria das fei&ccedil;&otilde;es do local de entrada. 
                </li>
            </ul>
            
        </div>
    </div>
    <div id="outputName">
        <div><h2>Nome da camada resultante</h2></div>
        <hr/>
        <div>
            
            <p>O nome da camada que ser&aacute; criada em  <b>Meu Conte&uacute;do</b> e adicionada no mapa. O nome padr&atilde;o &eacute; baseado no nome da ferramenta e o nome da camada de entrada. Se a camada j&aacute; existir, voc&ecirc; ser&aacute; solicitado para fornecer outro nome.
            </p>
            <p>Voc&ecirc; pode especificar o nome de uma pasta em  <b>Meu Conte&uacute;do</b> onde o resultado ser&aacute; salvo utilizando a caixa suspensa <b>Salvar resultados em</b> .
            </p>
        </div>
    </div>
</div>
</html>
