<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Resumir Atributos</h2><p/>
        <h2><img src="../images/GUID-F64B533F-B0BB-4519-9F31-BCF814084999-web.png" alt="Resumir Atributos"></h2>
        <hr/>
    <p>Esta ferramenta resume todos os valores de compara&ccedil;&atilde;o em um ou mais campos e calcula as estat&iacute;sticas deles. A estat&iacute;stica mais b&aacute;sica &eacute; a contagem de fei&ccedil;&otilde;es que foi resumida, mas voc&ecirc; pode calcular estat&iacute;sticas mais avan&ccedil;adas tamb&eacute;m. 

    </p>
    <p>Por exemplo, suponha que voc&ecirc; tenha fei&ccedil;&otilde;es de ponto de locais de armazenamento com um campo representando o  <i>DISTRICT_MANAGER_NAME</i> e voc&ecirc; deseja resumir as vendas de caf&eacute; por gerente. Voc&ecirc; pode especificar o campo <i>DISTRICT_MANAGER_NAME</i> como o campo para dissolver e todas as linhas de dados representando os gerentes individuais que ser&atilde;o resumidos. Isto significa que todos locais de armazenamento que s&atilde;o gerenciados por Manager1 ser&atilde;o resumidos em uma linha com estat&iacute;sticas sum&aacute;rias calculadas. Nesta inst&acirc;ncia, a estat&iacute;stica como contagem do n&uacute;mero de lojas e a soma de <i>TOTAL_SALES</i> para todas as lojas que o Manager1 gerencia seriam calculadas como tamb&eacute;m para qualquer outro gerente listado no campo <i>DISTRICT_MANAGER_NAME</i>.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputLayer">
        <div><h2>Escolha a entrada para resumir</h2></div>
        <hr/>
        <div>
            <p>A camada que cont&eacute;m os campos que ser&atilde;o resumidos.  
            </p>
            <p>Al&eacute;m de escolher uma camada de seu mapa, voc&ecirc; pode escolher  <b>Procurar Camadas</b> na parte inferior da lista suspensa para procurar por seu conte&uacute;do para um conjunto de dados de compartilhamento de arquivo big data ou camada de fei&ccedil;&atilde;o.  
            </p>
        </div>
    </div>
    <div id="fields">
        <div><h2>Escolha os campos nos quais você deseja dissolver</h2></div>
        <hr/>
        <div>
            <p>  Lista de campos a partir da camada de entrada.  Os campos selecionados ser&atilde;o resumidos e utilizados para calcular estat&iacute;sticas. Por exemplo, se voc&ecirc; escolheu um campo denominado <i>PropertyType</i> com os valores de comerciais e residenciais, todos os campos residenciais seriam resumidos, com estat&iacute;stica sum&aacute;ria calculada e todos os campos comerciais seriam resumidos.
            </p>
        </div>
    </div>
    <div id="summaryFields">
        <div><h2>Escolha os campos e estatísticas que você deseja calcular (opcional)</h2></div>
        <hr/>
        <div>
            <p> Voc&ecirc; pode calcular as estat&iacute;stica em fei&ccedil;&otilde;es que s&atilde;o resumidas. Nos campos num&eacute;ricos voc&ecirc; pode calcular o seguinte:
                <ul>
                    <li>Contagem
                    </li>
                    <li>M&eacute;dio
                    </li>
                    <li>M&iacute;n
                    </li>
                    <li>M&aacute;x
                    </li>
                    <li>Intervalo
                    </li>
                    <li>Vari&acirc;ncia
                    </li>
                    <li>Desvio Padr&atilde;o
                    </li>
                </ul>
                
            </p>
            <p>Nos campos de string voc&ecirc; pode calcular o seguinte:
                <ul>
                    <li>Contagem
                    </li>
                    <li>Qualquer&mdash;Esta estat&iacute;stica &eacute; uma amostra aleat&oacute;ria de um valor de string no campo especificado.
                    </li>
                </ul>
                Todas as estat&iacute;sticas s&atilde;o calculadas em valores n&atilde;o nulos. A camada resultante conter&aacute; um novo atributo para cada estat&iacute;stica calculada. Qualquer n&uacute;mero de estat&iacute;stica pode ser adicionado ao escolher um atributo e estat&iacute;stica. 
            </p>
        </div>
    </div>
    <div id="dataStore">
        <div><h2>Escolher armazenamento de dados</h2></div>
        <hr/>
        <div>
            <p>Este &eacute; um par&acirc;metro tempor&aacute;rio para pr&eacute; lan&ccedil;amento para configurar o armazenamento de dados onde os resultados s&atilde;o salvos. Ambos os armazenamentos de dados s&atilde;o parte do  ArcGIS Data Store. Se voc&ecirc; selecionar o armazenamento de dados spatiotemporal mas n&atilde;o ter um instalado, a ferramenta falhar&aacute;. </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Nome da camada resultante</h2></div>
        <hr/>
        <div>
            <p> Este &eacute; o nome da camada que ser&aacute; criada em <b>Meu Conte&uacute;do</b> e adicionada ao mapa.  O nome padr&atilde;o &eacute; baseado no nome da ferramenta e o nome da camada de entrada. Se a camada j&aacute; existe, a ferramenta falhar&aacute;.
            </p>
            <p>Ao utilizar a caixa suspensa  <b>Salvar resultado em</b>, &eacute; poss&iacute;vel especificar o nome de uma pasta em <b>Meu Conte&uacute;do</b> onde o resultado ser&aacute; salvo.
            </p>
        </div>
    </div>
</div>
</html>
