<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Estatística Zonal como Tabela</h2><p/>
        <h2><img src="../images/GUID-2847466F-BF22-4545-BDCE-7EB7B1D15F2D-web.png" alt="Diagrama de Estat&iacute;stica Zonal como Tabela"></h2>
        <hr/>
    <p>Esta ferramenta resume os valores de um raster dentro das zonas de outro conjunto de dados e relata os resultados em uma tabela.
    </p>
    <p>Alguns exemplos de aplicativos desta ferramenta incluem o seguinte:
        <ul>
            <li>Fornecida uma camada de limites da bacia e uma camada de limites de uso do solo por tipo de uso do solo, calcule a &aacute;rea total em acres do tipo de uso do solo para cada bacia.
                

            </li>
            <li>Fornecida uma camada de lotes em um munic&iacute;pio e uma camada de limites da cidade, resuma o valor m&eacute;dio de lotes desocupados dentro de cada limite da cidade.
                

            </li>
        </ul>
        
    </p>
    <p>Se  <b>Utilizar extens&atilde;o de mapa atual</b> estiver selecionada, somente aquelas fei&ccedil;&otilde;es na camada de entrada e camada a serem resumidas que s&atilde;o vis&iacute;veis dentro da extens&atilde;o de mapa atual ser&atilde;o analisadas. Se n&atilde;o selecionada, todas as fei&ccedil;&otilde;es em ambas a camada de entrada e a camada a ser resumida ser&atilde;o analisadas, mesmo que estiverem fora da extens&atilde;o de mapa atual.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputZoneRasterOrFeatures">
        <div><h2>Escolher feições ou raster de zona</h2></div>
        <hr/>
        <div>
            <p>A entrada que define os limites das zonas, ou &aacute;reas, que ser&atilde;o resumidas.
            </p>
            <p>A entrada pode ser um raster inteiro ou dados de fei&ccedil;&otilde;es. Para rasters, as zonas s&atilde;o definidas por todos os locais na entrada que tenham o mesmo valor de c&eacute;lula. Para fei&ccedil;&otilde;es, as zonas podem ser sobrepostas. As &aacute;reas n&atilde;o t&ecirc;m que ser cont&iacute;guas.
            </p>
        </div>
    </div>
    <div id="zoneField">
        <div><h2>Campo de Zona</h2></div>
        <hr/>
        <div>
            <p>O campo que cont&eacute;m os valores que definem cada zona.
            </p>
            <p>Pode ser um n&uacute;mero inteiro ou um campo de string do conjunto de dados da zona.
            </p>
        </div>
    </div>
    <div id="inputValueRaster">
        <div><h2>Escolher raster de valor</h2></div>
        <hr/>
        <div>
            <p>O raster que cont&eacute;m os valores sobre os quais calcular uma estat&iacute;stica.
            </p>
            <p>Pode ser inteiro ou ponto flutuante. No entanto, quando &eacute; do tipo ponto flutuante, as op&ccedil;&otilde;es para calcular maioria, minoria e variedade n&atilde;o estar&atilde;o dispon&iacute;veis.
            </p>
        </div>
    </div>
    <div id="ignoreNodata">
        <div><h2>Ignorar NoData nos cálculos (opcional)</h2></div>
        <hr/>
        <div>
            <p> Especifica se os valores de NoData s&atilde;o ignorados na an&aacute;lise.
            </p>
            <ul>
                <li>Marcado&mdash;A an&aacute;lise incluir&aacute; as c&eacute;lulas que possuem um valor no raster do valor de entrada dentro de qualquer zona espec&iacute;fica para determinar o valor de sa&iacute;da para essa zona. As c&eacute;lulas NoData no raster de valor ser&atilde;o ignoradas no c&aacute;lculo da estat&iacute;stica. Este &eacute; o padr&atilde;o.
                </li>
                <li>Desmarcado&mdash;A an&aacute;lise resultar&aacute; em NoData se houver algum valor NoData para as c&eacute;lulas do raster de valor dentro de uma zona espec&iacute;fica.
                </li>
            </ul>
            
        </div>
    </div>
    <div id="statisticType">
        <div><h2>Tipo de estatística (opcional)</h2></div>
        <hr/>
        <div>
            <p>Especifica o tipo de estat&iacute;stica a ser calculado.
            </p>
            <p> A entrada pode ser um dos seguintes: <b>Todos</b>, <b>M&eacute;dia</b>, <b>Maioria</b>, <b>M&aacute;ximo</b>, <b>M&eacute;dia</b>, <b>M&iacute;nimo</b>, <b>Minoria</b>, <b>Percentil</b>, <b>Intervalo</b>, <b>Desvio padr&atilde;o</b>, <b>Soma</b>, <b>Variedade</b>, <b>M&iacute;nimo e M&aacute;ximo</b>, <b>M&eacute;dia e Desvio padr&atilde;o</b>, ou <b>M&iacute;nimo, M&aacute;ximo e M&eacute;dia</b>. O padr&atilde;o &eacute; <b>Todos</b>.
            </p>
        </div>
    </div>
    <div id="percentileValues">
        <div><h2>Valores de percentil (opcional)</h2></div>
        <hr/>
        <div>
            <p>O percentil para calcular. O padr&atilde;o &eacute; 90, indicando o 90&ordm; percentil.
            </p>
            <p>O valor podem variar de 0 at&eacute; 100. O resultado da especifica&ccedil;&atilde;o do 0&ordm; percentil &eacute; essencialmente equivalente ao da estat&iacute;stica m&iacute;nima e o 100&ordm; percentil &eacute; equivalente ao m&aacute;ximo. Um valor de 50 produzir&aacute; essencialmente o mesmo resultado que a estat&iacute;stica mediana.
            </p>
            <p> Este par&acirc;metro s&oacute; &eacute; suportada se o par&acirc;metro <b>Tipo estat&iacute;sticas</b> estiver definido como <b>Percentil</b> ou <b>Todos</b>.
            </p>
        </div>
    </div>
    <div id="percentileInterpolationType">
        <div><h2>Tipo de interpolação de percentil (opcional)</h2></div>
        <hr/>
        <div>
            <p>Especifica o m&eacute;todo de interpola&ccedil;&atilde;o de percentil a ser usado quando o n&uacute;mero de valores do raster de entrada a ser calculado &eacute; par.
            </p>
            <ul>
                <li>  <b>Auto Detectar</b>&mdash;Se o raster de valor de entrada for do tipo pixel inteiro, o m&eacute;todo <b>Mais pr&oacute;ximo</b> &eacute; usado Se o raster de valor de entrada for do tipo pixel de ponto flutuante, ent&atilde;o o m&eacute;todo <b>Linear</b> ser&aacute; usado. Este &eacute; o padr&atilde;o.
                </li>
                <li> <b>Mais pr&oacute;ximo</b>&mdash;&Eacute; usado o valor dispon&iacute;vel mais pr&oacute;ximo do percentil desejado.
                </li>
                <li> <b>Linear</b>&mdash;A m&eacute;dia ponderada dos dois valores circundantes do percentil desejado &eacute; usada.
                </li>
            </ul>
            
            <p> Este par&acirc;metro s&oacute; &eacute; suportada se o par&acirc;metro <b>Tipo estat&iacute;sticas</b> estiver definido como <b>Percentil</b> ou <b>Todos</b>.
            </p>
        </div>
    </div>
    <div id="processAsMultidimensional">
        <div><h2>Processar como multidimensional (opcional)</h2></div>
        <hr/>
        <div>
            <p>Especifica como os servi&ccedil;os de imagem multidimensional de entrada ser&atilde;o processados ​​se forem multidimensionais.
            </p>
            <ul>
                <li>Marcado&mdash;As estat&iacute;sticas ser&atilde;o calculadas a partir da parte atual do conjunto de dados multidimensional de entrada. Este &eacute; o padr&atilde;o.
                    

                </li>
                <li>Desmarcado&mdash;As estat&iacute;sticas ser&atilde;o calculadas para todas as dimens&otilde;es do conjunto de dados multidimensional de entrada.
                </li>
            </ul>
            
        </div>
    </div>
    <div id="outputTableName">
        <div><h2>Nome da tabela de resultados</h2></div>
        <hr/>
        <div>
            <p>O nome da camada que ser&aacute; criada em  <b>Meu Conte&uacute;do</b> e adicionada no mapa. O nome padr&atilde;o &eacute; baseado no nome da ferramenta e o nome da camada de entrada. Se a camada j&aacute; existir, voc&ecirc; ser&aacute; solicitado para fornecer outro nome.
            </p>
            <p>Voc&ecirc; pode especificar o nome de uma pasta em  <b>Meu Conte&uacute;do</b> onde o resultado ser&aacute; salvo utilizando a caixa suspensa <b>Salvar resultados em</b> .
            </p>
        </div>
    </div>
</div>
</html>
