// COPYRIGHT © 2020 Esri
//
// All rights reserved under the copyright laws of the United States
// and applicable international laws, treaties, and conventions.
//
// This material is licensed for use under the Esri Master License
// Agreement (MLA), and is bound by the terms of that agreement.
// You may redistribute and use this code without modification,
// provided you adhere to the terms of the MLA and include this
// copyright notice.
//
// See use restrictions at http://www.esri.com/legal/pdfs/mla_e204_e300/english
//
// For additional information, contact:
// Environmental Systems Research Institute, Inc.
// Attn: Contracts and Legal Services Department
// 380 New York Street
// Redlands, California, USA 92373
// USA
//
// email: contracts@esri.com
//
// See http://js.arcgis.com/3.33/esri/copyright.txt for details.

define({countryCodes:{WORLD:"עולם",AD:"אנדורה",AE:"איחוד האמירויות הערביות",AF:"אפגניסטן",AG:"אנטיגואה וברבודה",AI:"אנגווילה",AL:"אלבניה",AM:"ארמניה",AO:"אנגולה",AQ:"אנטארקטיקה",AR:"ארגנטינה",AS:"סמואה האמריקאית",AT:"אוסטריה",AU:"אוסטרליה",AW:"ארובה",AZ:"אזרבייגאן",BA:"בוסניה והרצגובינה",BB:"ברבדוס",BD:"בנגלדש",BE:"בלגיה",BF:"בורקינה פאסו",BG:"בולגריה",BH:"בחריין",BI:"בורונדי",BJ:"בנין",BL:"סן ברתלמי",BM:"ברמודה",BN:"ברוניי דרוסלאם",BO:"בוליביה",BQ:"בונאייר, סנט אוסטתיוס וסאבה",BR:"ברזיל",BS:"בהאמה",BT:"בהוטן",BV:"האי בווה",BW:"בוטסוואנה",BY:"בלארוס",BZ:"בליז",CA:"קנדה",CD:"הרפובליקה הדמוקרטית של קונגו",CF:"הרפובליקה המרכז אפריקאית",CG:"קונגו",CH:"שוויץ",CI:"חוף השנהב",CK:"איי קוק",CL:"צ'ילה",CM:"קמרון",CN:"סין",CO:"קולומביה",CR:"קוסטה ריקה",CU:"קובה",CV:"כף ורדה",CW:"קוראסאו",CY:"קפריסין",CZ:"הרפובליקה הצ'כית",DE:"גרמניה",DJ:"ג'יבוטי",DK:"דנמרק",DM:"דומיניקה",DO:"הרפובליקה הדומיניקנית",DZ:"אלג'יריה",EC:"אקוודור",EE:"אסטוניה",EG:"מצרים",EH:"סהרה המערבית",ER:"אריתריאה",ES:"ספרד",ET:"אתיופיה",FI:"פינלנד",FJ:"פיג'י",FK:"איי פוקלנד (מלבינאס)",FM:"מיקרונזיה",FO:"איי פארו",FR:"צרפת",GA:"גבון",GB:"בריטניה",GD:"גרנדה",GE:"גיאורגיה",GF:"גיניאה הצרפתית",GG:"גרנזי",GH:"גאנה",GI:"גיברלטר",GL:"גרינלנד",GM:"גמביה",GN:"גינאה",GP:"גוואדלופה",GQ:"גינאה המשוונית",GR:"יוון",GS:"דרום גאורגיה ואיי הסנדוויץ הדרומיים",GT:"גווטמלה",GW:"גינאה-ביסאו",GY:"גיאנה",HK:"הונג קונג",HM:"האי הרד ואיי מקדונלד",HN:"הונדורס",HR:"קרואטיה",HT:"האיטי",HU:"הונגריה",ID:"אינדונזיה",IE:"אירלנד",IL:"ישראל",IM:"איי מאן",IN:"הודו",IO:"הטריטוריה הבריטית באוקיינוס ההודי",IQ:"עירק",IR:"איראן",IS:"איסלנד",IT:"איטליה",JE:"ג'רסי",JM:"ג'מייקה",JO:"ירדן",JP:"יפן",KE:"קניה",KG:"קירגיזסטן",KH:"קמבודיה",KI:"קיריבטי",KM:"קומורו",KN:"סנט קיטס ונוויס",KP:"צפון קוריאה",KR:"קוריאה הצפונית",KW:"כווית",KY:"איי קיימן",KZ:"קזחסטאן",LA:"לאוס",LB:"לבנון",LC:"סנט לוסיה",LI:"ליכטנשטיין",LK:"סרי לנקה",LR:"ליבריה",LS:"לסוטו",LT:"ליטא",LU:"לוקסמבורג",LV:"לטביה",LY:"לוב",MA:"מרוקו",MC:"מונקו",MD:"מולדובה",ME:"מונטנגרו",MF:"סיינט מרטין (החלק הצרפתי)",MG:"מדגסקר",MH:"איי מרשל",MK:"מקדוניה",ML:"מאלי",MM:"מיאנמר",MN:"מונגוליה",MO:"מקאו",MP:"איי מריאנה הצפוניים",MQ:"מרטיניק",MR:"מאוריטניה",MS:"מונטסראט",MT:"מלטה",MU:"מאוריציוס",MV:"האיים המלדיביים",MW:"מלאווי",MX:"מקסיקו",MY:"מלזיה",MZ:"מוזמביק",NA:"נמיביה",NC:"קלדוניה החדשה",NE:"ניז'ר",NG:"ניגריה",NI:"ניקרגואה",NL:"הולנד",NO:"נורבגיה",NP:"נפאל",NR:"נאורו",NU:"ניואה",NZ:"ניו זילנד",OM:"עומאן",PA:"פנמה",PE:"פרו",PF:"פולינזיה הצרפתית",PG:"פפואה גינאה החדשה",PH:"פיליפינים",PK:"פקיסטן",PL:"פולין",PM:"סן פייר ומיקלון",PN:"פיטקרן",PS:"הרשות הפלסטינית",PT:"פורטוגל",PW:"פלאו",PY:"פרגוואי",QA:"קטאר",RE:"ראוניון",RO:"רומניה",RS:"סרביה",RU:"הפדרציה הרוסית",RW:"רואנדה",SA:"ערב הסעודית",SB:"איי שלמה",SC:"איי סיישל",SD:"סודן",SE:"שוודיה",SG:"סינגפור",SH:"סנט הלנה, אסנשן וטריסטן דה קונה",SI:"סלובניה",SJ:"סוואלברד ויאן מאיין",SK:"סלובקיה",SL:"סיירה לאון",SM:"סן מרינו",SN:"סנגל",SO:"סומליה",SR:"סורינאם",SS:"דרום סודן",ST:"סאו טומה ופרינסיפה",SV:"אל סלבדור",SX:"סיינט מארטן (החלק ההולנדי)",SY:"סוריה",SZ:"סוואזילנד",TC:"איי טורק וקייקוס",TD:"צ'אד",TF:"הטריטוריות הדרומיות של צרפת",TG:"טוגו",TH:"תאילנד",TJ:"טג'יקיסטן",TK:"טוקלאו",TL:"מזרח טימור",TM:"טורקמניסטן",TN:"תוניס",TO:"טונגה",TR:"טורקיה",TT:"טרינידד וטובגו",TV:"טובאלו",TW:"טאיואן, פרובינציה של סין",TZ:"טנזניה",UA:"אוקראינה",UG:"אוגנדה",UM:"האיים המרוחקים הקטנים של ארצות הברית",US:"ארצות הברית",UY:"אורוגוואי",UZ:"אוזבקיסטן",VA:"הכס הקדוש (מדינת עיר ותיקן)",VC:"סנט וינסנט והגרנדינים",VE:"וונצואלה",VG:"איי הבתולה הבריטיים",VN:"וויאטנם",VU:"ונואטו",WF:"ואליס ופוטונה",WS:"סמואה",XK:"הרפובליקה של קוסובו",YE:"תימן",YT:"מיוט",ZA:"דרום אפריקה",ZM:"זמביה",ZW:"זימבבואה"}});
