<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Koosta rasteri sijainnissa</h2><p/>
        <h2><img src="../images/GUID-D61C156C-2B2C-488C-BF28-B6CB9277BF4B-web.png" alt="Koosta rasteri sijainnissa -ty&ouml;kalu"></h2>
        <hr/>
    <p>T&auml;m&auml; ty&ouml;kalu laskee yhteen rasterin arvot toisen aineistoryhm&auml;n vy&ouml;hykkeill&auml;.
    </p>
    <p>Seuraavassa on luettelo joistakin t&auml;m&auml;n ty&ouml;kalun sovelluksista:
        <ul>
            <li>Jos k&auml;yt&ouml;ss&auml; ovat vesijakoalueiden rajojen karttataso ja maank&auml;ytt&ouml;tyypin mukaisten kaavoitusrajojen karttataso, ty&ouml;kalu laskee tietyn maank&auml;ytt&ouml;aluetyypin kokonaispinta-alan eekkerein&auml; kullekin vesijakoalueelle.
                

            </li>
            <li>Jos k&auml;yt&ouml;ss&auml; ovat piirikunnan kiinteist&ouml;jen karttataso ja kaupunkien rajojen karttataso, ty&ouml;kalu tekee yhteenvedon siit&auml;, mik&auml; on kunkin kaupungin rajojen sis&auml;ll&auml; olevien vapaiden kiinteist&ouml;jen keskim&auml;&auml;r&auml;inen arvo.
                

            </li>
        </ul>
        
    </p>
    <p>Jos  <b>K&auml;yt&auml; nykyist&auml; karttalaajuutta</b> -toiminto on valittuna, vain l&auml;ht&ouml;karttatason ja yhteenvetokarttatason nykyisess&auml; karttalaajuudessa n&auml;kyv&auml;t kohteet analysoidaan. Jos toimintoa ei ole valittu, analyysiin sis&auml;llytet&auml;&auml;n kaikki l&auml;ht&ouml;- ja yhteenvetokarttatason kohteet, vaikka ne eiv&auml;t sijaitsisikaan nykyisen karttalaajuuden alueella.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="sumWithinLayer">
        <div><h2>Valitse aluekarttataso, jonka rajojen sisällä olevasta rasterikarttatasosta haluat laatia yhteenvedon</h2></div>
        <hr/>
        <div>
            <p>L&auml;ht&ouml;aineisto, joka m&auml;&auml;ritt&auml;&auml; yhteenvedett&auml;vien vy&ouml;hykkeiden tai alueiden rajat.
            </p>
            <p>L&auml;ht&ouml;aineisto voi olla kokonaislukurasteri tai kohdeaineisto. Rastereissa vy&ouml;hykkeet m&auml;&auml;r&auml;ytyv&auml;t kaikkien niiden l&auml;ht&ouml;aineiston sijaintien mukaan, joilla on sama soluarvo. Kohteissa vy&ouml;hykkeet voivat olla p&auml;&auml;llekk&auml;isi&auml;. Alueiden ei tarvitse olla vierekk&auml;isi&auml;.
            </p>
        </div>
    </div>
    <div id="zoneField">
        <div><h2>Määritä rajat valitsemalla kenttä</h2></div>
        <hr/>
        <div>
            <p>Kentt&auml;, joka sis&auml;lt&auml;&auml; kunkin vy&ouml;hykkeen m&auml;&auml;ritt&auml;v&auml;t arvot.
            </p>
            <p>T&auml;m&auml; voi olla vy&ouml;hykeaineistoryhm&auml;n kokonaisluku tai merkkijonokentt&auml;.
            </p>
        </div>
    </div>
    <div id="sumRasterLayer">
        <div><h2>Valitse rasterikarttataso, josta haluat laatia yhteenvedon</h2></div>
        <hr/>
        <div>
            <p>Rasteri, joka sis&auml;lt&auml;&auml; arvot, joista tilastotiedot lasketaan.
            </p>
            <p>Sen tyyppi voi olla joko kokonaisluku tai liukuluku. Jos tyyppin&auml; on liukuluku, enemmist&ouml;-, v&auml;hemmist&ouml;- tai diversiteettilaskuja ei voi laskea.
            </p>
        </div>
    </div>
    <div id="sumStatistic">
        <div><h2>Valitse laskettava tilastotieto</h2></div>
        <hr/>
        <div>
            <p>M&auml;&auml;ritt&auml;&auml; laskettavan tilastotyypin.
            </p>
            <p> L&auml;ht&ouml;aineisto voi olla jokin seuraavista: <b>Keskiarvo</b>, <b>Enemmist&ouml;</b>, <b>Maksimi</b>, <b>Mediaani</b>, <b>Minimi</b>, <b>V&auml;hemmist&ouml;</b>, <b>Prosenttipiste</b>, <b>Vaihteluv&auml;li</b>, <b>Keskihajonta</b>, <b>Summa</b> tai <b>Diversiteetti</b>. Oletusarvo on <b>Keskiarvo</b>.
            </p>
        </div>
    </div>
    <div id="percentileValue">
        <div><h2>Prosenttiarvo</h2></div>
        <hr/>
        <div>
            <p>Laskettava prosenttipiste. Oletusarvo on 90, joka tarkoittaa 90. prosenttiarvoa.
            </p>
            <p>Arvo voi olla v&auml;lilt&auml; 0&ndash;100. 0. prosenttipisteen m&auml;&auml;ritt&auml;minen vastaa periaatteessa Minimi-tilastotietoa, ja 100. prosenttipiste vastaa Maksimi-tilastotietoa. Arvo 50 tuottaa saman tuloksen kuin Mediaani-tilastotieto.
            </p>
            <p> T&auml;t&auml; parametria tuetaan vain, jos <b>Valitse laskettava tilastotieto</b> -parametrin arvoksi on m&auml;&auml;ritetty <b>Prosenttipiste</b>.
            </p>
        </div>
    </div>
    <div id="missingValues">
        <div><h2>Ohita puuttuvat arvot laskelmassa</h2></div>
        <hr/>
        <div>
            <p> M&auml;&auml;ritt&auml;&auml;, ohitetaanko puuttuvat arvot analyysissa.
            </p>
            <ul>
                <li>Valittu &ndash; analyysi sis&auml;lt&auml;&auml; solut, joiden l&auml;ht&ouml;arvorasterin arvo on mill&auml; tahansa tietyll&auml; vy&ouml;hykkeell&auml;, jotta voidaan m&auml;&auml;ritt&auml;&auml; kyseisen vy&ouml;hykkeen tulosarvo. Arvorasterin NoData-solut ohitetaan tilastollisessa laskennassa. T&auml;m&auml; on oletusarvo.
                </li>
                <li>Ei valittu &ndash; analyysin tuloksena on NoData, jos arvorasterin solujen arvona on NoData-arvoja tietyll&auml; vy&ouml;hykkeell&auml;.
                </li>
            </ul>
            
        </div>
    </div>
    <div id="processAsMultidimensional">
        <div><h2>Käsittele moniulotteisena</h2></div>
        <hr/>
        <div>
            <p>M&auml;&auml;ritt&auml;&auml;, miten l&auml;ht&ouml;aineiston kuvapalvelut k&auml;sitell&auml;&auml;n, jos ne ovat moniulotteisia.
            </p>
            <ul>
                <li>Valittu &ndash; tilastotiedot lasketaan l&auml;ht&ouml;aineiston moniulotteisen aineistoryhm&auml;n nykyisest&auml; viipaleesta. T&auml;m&auml; on oletusarvo.
                    

                </li>
                <li>Ei valittu &ndash; tilastotiedot lasketaan l&auml;ht&ouml;aineiston moniulotteisen aineistoryhm&auml;n kaikille ulottuvuuksille.
                </li>
            </ul>
            
        </div>
    </div>
    <div id="resultLayer">
        <div><h2>Tulostason nimi</h2></div>
        <hr/>
        <div>
            
            <p>Sen karttatason nimi, joka luodaan  <b>Oma sis&auml;lt&ouml;</b> -kohtaan ja lis&auml;t&auml;&auml;n karttaan. Oletusnimi perustuu ty&ouml;kalun nimeen ja l&auml;ht&ouml;karttatason nimeen. Jos taso on jo luotu, sinua pyydet&auml;&auml;n antamaan toinen nimi.
            </p>
            <p>Voit m&auml;&auml;ritt&auml;&auml; kansion nimen  <b>Oma sis&auml;lt&ouml;</b> -osiossa, johon tulos tallennetaan avattavan <b>Tallenna tulos kohteeseen</b> -valikon avulla. Jos sinulla on käyttöoikeudet, jotka sallivat sekä tiilitettyjen että dynaamisten kuva-aineistokarttatasojen luonnin, voit määrittää tulosaineiston karttatasotyypin avattavan Tallenna tulos nimellä -ruudun avulla. </p>
        </div>
    </div>
</div>
</html>
