<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Finn argumentstatistikk</h2><p/>
        <h2><img src="../images/GUID-6DE9D49F-C9CA-48B8-B14F-C8EF05FBFA42-web.png" alt="Finn argumentstatistikk"></h2>
        <hr/>
    <p>Trekker ut dimensjonsverdien eller b&aring;ndindeksen der en gitt statistikk oppn&aring;dd for hver piksel i et flerdimensjonalt raster eller flerb&aring;ndsraster.
    </p>
    <p>Bruk dette verkt&oslash;yet til &aring; trekke ut dimensjonsverdien (for eksempel dato, h&oslash;yde eller dybde) der en bestemt statistikk er oppn&aring;dd i stabelen av rastere i et flerdimensjonalt rasterdatasett. Alternativt kan du finne b&aring;ndnummeret der statistikken er n&aring;dd i et raster med flere b&aring;nd.
    </p>
    <p>Det kan for eksempel v&aelig;re du vil vite hvilken m&aring;ned hver piksel n&aring;dde den h&oslash;yeste havoverflatetemperaturen i l&oslash;pet av 30 &aring;rs datainnsamling. Et annet eksempel kan v&aelig;re at du har et fjernm&aring;lingsbilde med &aring;tte b&aring;nd og vil vite i hvilket b&aring;nd minimum refleksjonsfaktor ble n&aring;dd for hver piksel.
    </p>
    <p>Hvis det er merket av for  <b>Bruk gjeldende kartutstrekning</b> analyseres variablene eller b&aring;ndene i laget som vises innenfor gjeldende kartutstrekning. Hvis alternativet ikke er avmerket, analyseres variablene eller b&aring;ndene i hele laget, selv om de befinner seg utenfor gjeldende kartutstrekning.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputRaster">
        <div><h2>Velg et flerdimensjonalt bildelag eller bildelag med flere bånd som skal analyseres</h2></div>
        <hr/>
        <div>
            <p>Det inng&aring;ende flerdimensjonale rasteret eller flerb&aring;ndsrasteret som skal analyseres.
            </p>
        </div>
    </div>
    <div id="dimension">
        <div><h2>Velg dimensjon som statistikken skal trekkes ut fra</h2></div>
        <hr/>
        <div>
            <p>Dimensjonen som statistikken trekkes ut fra. Hvis inndatarasteret ikke er et flerdimensjonalt raster, er denne parameteren ikke obligatorisk.
            </p>
        </div>
    </div>
    <div id="variables">
        <div><h2>Velg variabelen(e) som skal analyseres</h2></div>
        <hr/>
        <div>
            <p>Variabelen eller variablene som skal analyseres. Hvis inndatarasteret ikke er flerdimensjonalt, anses pikselverdiene i flerb&aring;ndsrasteret som variabelen. Hvis inndatarasteret er flerdimensjonalt og ingen variabel er angitt, analyseres alle variablene i den valgte dimensjonen.
            </p>
            <p>Hvis du for eksempel vil finne ut hvilke &aring;r som hadde de h&oslash;yeste temperaturene, angir du temperatur som variabelen som skal analyseres. Hvis du ikke spesifiserer noen variabler, og du har b&aring;de temperatur og nedb&oslash;r som variabler, blir begge variablene analysert, og det resulterende flerdimensjonale rasteret inneholder begge variablene.
            </p>
        </div>
    </div>
    <div id="statisticsType">
        <div><h2>Velg statistikktype</h2></div>
        <hr/>
        <div>
            <p>Angir hvilken statistikk som skal trekkes ut fra variabelen eller variablene langs den gitte dimensjonen.
            </p>
            <ul>
                <li> <b>Argumentet for minimum</b> &ndash;&nbsp;Dimensjonsverdien der minimumsverdien for variabelen er n&aring;dd, blir trukket ut. Dette er standardalternativet.
                </li>
                <li> <b>Argumentet for maksimum</b> &ndash;&nbsp;Dimensjonsverdien der maksimumsverdien for variabelen er n&aring;dd, blir trukket ut.
                </li>
                <li> <b>Argumentet for median</b> &ndash; Dimensjonsverdien der medianverdien for variabelen er n&aring;dd, blir trukket ut.
                </li>
                <li> <b>Argumentet for varighet</b> &ndash; Den lengste dimensjonsvarigheten der variabelverdiene faller mellom minimums- og maksimumsverdien.
                </li>
            </ul>
            
        </div>
    </div>
    <div id="multipleOccurrenceValue">
        <div><h2>Angi verdi for flere forekomster</h2></div>
        <hr/>
        <div>
            <p>Pikselverdien som brukes for &aring; indikere at en gitt argumentstatistikk ble n&aring;dd mer enn &eacute;n gang i datasettet for inndatarasteret. Hvis ikke angitt, blir pikselverdien lik verdien av dimensjonen f&oslash;rste gang argumentstatistikken blir n&aring;dd.
            </p>
        </div>
    </div>
    <div id="minValue">
        <div><h2>Angi minimumsverdi</h2></div>
        <hr/>
        <div>
            <p>Den minste variabelverdien som skal brukes til &aring; trekke ut varighet.
            </p>
            <p>Denne parameteren er obligatorisk n&aring;r  <b>Varighet</b> er valgt som statistikktype.
            </p>
        </div>
    </div>
    <div id="maxValue">
        <div><h2>Angi maksimumsverdi</h2></div>
        <hr/>
        <div>
            <p>Den st&oslash;rste variabelverdien som skal brukes til &aring; trekke ut varighet.
            </p>
            <p>Dette trinnet er obligatorisk n&aring;r  <b>Varighet</b> er valgt som statistikktype.
            </p>
        </div>
    </div>
    <div id="dimensionDefinition">
        <div><h2>Velg dimensjonsdefinisjon</h2></div>
        <hr/>
        <div>
            <p>Angir hvordan statistikken skal trekkes ut fra dimensjonen.
                <ul>
                    <li> <b>Alle</b> &ndash; Statistikken trekkes ut p&aring; tvers av alle dimensjoner. Dette er standardalternativet.
                    </li>
                    <li> <b>Intervalln&oslash;kkelord</b> &ndash; Statistikken trekkes ut fra tidsdimensjonen i henhold til intervalln&oslash;kkelordet.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="intervalKeyword">
        <div><h2>Velg nøkkelordintervall</h2></div>
        <hr/>
        <div>
            <p>Tidsenheten som statistikken skal trekkes ut fra.
            </p>
            <p>Hvis du for eksempel har data p&aring; fem &aring;rs daglige havoverflatetemperaturer, og du vil vite i hvilket &aring;r den maksimale temperaturen ble observert. Angi  <b>Argumentet for maksimum</b> som statistikktype, sett, og angi <b>Intervalln&oslash;kkelord</b> som dimensjonsdefinisjon, og angi <b>&Aring;rlig</b> som n&oslash;kkelordsintervall i dette trinnet.
            </p>
            <p>Hvis du heller vil vite i hvilken m&aring;ned maksimumstemperaturen ble observert over en lengre periode, angir du  <b>Argumentet for maksimum</b> som statistikktype, angir <b>Intervalln&oslash;kkelord</b> som dimensjonsdefinisjon og angir <b>Gjentas m&aring;nedlig</b> som n&oslash;kkelordintervall i dette trinnet. Dette vil generere et raster der hver piksel inneholder m&aring;neden der statistikken ble n&aring;dd p&aring; tvers av registreringene for fem &aring;r (f.eks. 18.08.2018, 25.08.2016, 07.08.2013).
            </p>
            <p>Dette trinnet er obligatorisk n&aring;r  <b>StdTime</b> er angitt som dimensjonen statistikken skal trekkes ut fra, og <b>Intervalln&oslash;kkelord</b> er valgt for &aring; definere hvordan statistikken skal trekkes ut fra tidsdimensjonen.
                <ul>
                    <li> <b>Gjentas daglig</b> &ndash;&nbsp;Statistikken trekkes ut p&aring; tvers av dager.
                    </li>
                    <li> <b>Gjentas ukentlig</b> &ndash;&nbsp;Statistikken trekkes ut p&aring; tvers av uker.
                    </li>
                    <li> <b>Gjentas m&aring;nedlig</b> &ndash;&nbsp;Statistikken trekkes ut p&aring; tvers av m&aring;neder.
                    </li>
                    <li> <b>Gjentas kvartalsvis</b> &ndash;&nbsp;Statistikken trekkes ut p&aring; tvers av kvartaler.
                    </li>
                    <li> <b>Hver time</b> &ndash; Statistikken trekkes ut fra den timen da statistikken ble n&aring;dd.
                    </li>
                    <li> <b>Daglig</b> &ndash; Statistikken trekkes ut fra den dagen da statistikken ble n&aring;dd.
                    </li>
                    <li> <b>Ukentlig</b> &ndash; Statistikken trekkes ut fra den uken da statistikken ble n&aring;dd.
                    </li>
                    <li> <b>M&aring;nedlig</b> &ndash; Statistikken trekkes ut fra den m&aring;neden da statistikken ble n&aring;dd.
                    </li>
                    <li> <b>Kvartalsvis</b> &ndash; Statistikken trekkes ut fra det kvartalet da statistikken ble n&aring;dd.
                    </li>
                    <li> <b>&Aring;rlig </b> &ndash; Statistikken trekkes ut fra det &aring;ret da statistikken ble n&aring;dd.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="ignoreNodata">
        <div><h2>Ignorer manglende verdier i beregningen</h2></div>
        <hr/>
        <div>
            <p>Angir om manglende verdier ignoreres i analysen.
                <ul>
                    <li>Hvis boksen er avmerket, omfatter analysen alle gyldige piksler langs en gitt dimensjon og ignorerer eventuelle NoData-piksler. Dette er standardalternativet.
                    </li>
                    <li>Hvis boksen ikke er avmerket, resulterer analysen i NoData hvis det finnes NoData-verdier for pikselen langs den gitte dimensjonen.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Navn på resultatlag</h2></div>
        <hr/>
        <div>
            
            <p>Navnet p&aring; laget som opprettes i  <b>Mitt innhold</b> og legges til kartet. Standardnavnet er basert p&aring; verkt&oslash;ynavnet og navnet p&aring; inndatalaget. Hvis laget finnes allerede, blir du bedt om &aring; oppgi et annet navn.
            </p>
            <p>Du kan angi navnet p&aring; en mappe i  <b>Mitt innhold</b>, der resultatet blir lagret via rullegardinlisten <b>Lagre resultat i</b>. Hvis du har tillatelse til å opprette både flisinndelte og dynamiske bildelag, kan du også angi hvilken lagtype du vil generere i utdataene ved hjelp av rullegardinlisten Lagre resultat som. </p>
        </div>
    </div>
</div>
</html>
