<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Prøve</h2><p/>
        <h2><img src="../images/GUID-3950CCA3-C1D0-493F-A33D-93673443ADD2-web.png" alt="Pr&oslash;ve"></h2>
        <hr/>
    <p>Dette verkt&oslash;yet oppretter en tabell eller punktgeoobjektklasse som viser verdiene i cellene fra et raster, eller sett av rastere, for definerte posisjoner. Posisjonene defineres av rasterceller, polygongeoobjekter, polylinjegeoobjekter eller av et sett med punkter.
    </p>
    <p>Eksempler p&aring; bruksomr&aring;der for dette verkt&oslash;yet er blant annet:
        <ul>
            <li> Skille ut attributter for lokasjon av mobilmaster fra flere rastere, for eksempel arealbruk, jordtype, h&oslash;yde og avstand til vei.
            </li>
            <li>Skille ut jordtemperatur ved forskjellige dybder for et gitt sett av punkter.
            </li>
            <li>Fra 30 &aring;r med data om havoverflatetemperatur som er samlet inn m&aring;nedlig, kan du oppsummere ved tilholdssteder for dyr eller innenfor hjemmeomr&aring;der p&aring; et gitt tidspunkt da en dyreart ble observert.
            </li>
        </ul>
        
    </p>
    <p>Hvis det er merket av for  <b>Bruk gjeldende kartutstrekning</b> analyseres variablene eller b&aring;ndene i laget som vises innenfor gjeldende kartutstrekning. Hvis alternativet ikke er avmerket, analyseres variablene eller b&aring;ndene i hele laget, selv om de befinner seg utenfor gjeldende kartutstrekning.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inRasters">
        <div><h2>Velg ett eller flere bildelag som skal samples</h2></div>
        <hr/>
        <div>
            <p>Ett enkelt bilde eller en liste over bilder hvis verdier blir samplet p&aring; basis av lokasjonsinndataene. 
            </p>
            <p>Hvis alle inndelinger fra et flerdimensjonalt bildelag skal samples, m&aring; det v&aelig;re det eneste inndatarasteret.
            </p>
        </div>
    </div>
    <div id="inLocationData">
        <div><h2>Velg lokasjonslag</h2></div>
        <hr/>
        <div>
            <p>Data som identifiserer posisjoner du vil sample.
            </p>
            <p>Lokasjonsinndataene kan v&aelig;re et raster eller en punkt-, polylinje- eller polygongeoobjektklasse
            </p>
        </div>
    </div>
    <div id="uniqueIdField">
        <div><h2>Angi unik ID-feltet</h2></div>
        <hr/>
        <div>
            <p>Et felt som inneholder en forskjellig verdi for hver lokasjon eller hvert geoobjekt i inndatalokasjonsrasteret eller geoobjektklassen.
            </p>
        </div>
    </div>
    <div id="acquisitionDefinition">
        <div><h2>Oppgi opplysninger om innhenting av lokasjonsdata (valgfritt)</h2></div>
        <hr/>
        <div>
            <p>Angi tidspunkt, dybde eller andre innhentingsdata forbundet med lokasjonsceller eller geoobjekter.
            </p>
            <p>For hver dimensjon er det tre alternativer for &aring; angi innhentingsinformasjonen om lokasjonsceller eller geoobjekter:
            </p>
            <ul>
                <li> <b>Ett felt eller &eacute;n verdi</b> &ndash;&nbsp;N&aring;r dette alternativet velges, m&aring; f&oslash;lgende opplysninger oppgis:
                    <ul>
                        <li> <b>Dimensjonsfelt eller -verdi</b> &ndash;&nbsp;Velg et felt med dimensjonsverdier fra lokasjonsdataene, eller angi en spesifikk dimensjonsverdi.
                        </li>
                    </ul>
                    
                    

                </li>
                <li> <b>Ett felt eller en verdi med relative verdier</b> &ndash;&nbsp;Hvis dette alternativet velges, m&aring; opplysningene nedenfor spesifiseres samlet for &aring; definere omr&aring;det som statistikken skal beregnes innenfor, for variabler:
                    <ul>
                        <li> <b>Dimensjonsfelt eller -verdi</b> &ndash;&nbsp;Velg et felt med dimensjonsverdier fra lokasjonsdataene.
                        </li>
                        <li> <b>Relativ verdi f&oslash;r</b> &ndash;&nbsp;Angi et ikke-negativt tall &aring; trekke fra <b>Dimensjonsfelt eller -verdi</b> for &aring; definere starten p&aring; et omr&aring;de for dimensjonsverdier. Hvis dimensjonen er tid, representerer denne verdien antall dager.
                        </li>
                        <li> <b>Relativ verdi etter</b> &ndash;&nbsp;Angi et ikke-negativt tall &aring; legge til <b>Dimensjonsfelt eller -verdi</b> for &aring; definere slutten p&aring; et omr&aring;de for dimensjonsverdier. Hvis dimensjonen er tid, representerer denne verdien antall dager.
                        </li>
                    </ul>
                    
                </li>
                <li> <b>Start- og sluttfelt eller verdier</b> &ndash;&nbsp;Hvis dette alternativet velges, m&aring; opplysningene nedenfor spesifiseres samlet for &aring; definere omr&aring;det som statistikken skal beregnes innenfor, for variabler:
                    <ul>
                        <li> <b>Startfelt eller -verdier</b> &ndash;&nbsp;Velg et felt med dimensjonsverdier fra lokasjonsdataene, eller angi en spesifikk dimensjonsverdi for &aring; definere starten p&aring; et omr&aring;de for dimensjonsverdier.
                        </li>
                        <li> <b>Sluttfelt eller -verdier</b> &ndash;&nbsp;Velg et felt med dimensjonsverdier fra lokasjonsdataene, eller angi en spesifikk dimensjonsverdi for &aring; definere slutten p&aring; et omr&aring;de for dimensjonsverdier.
                        </li>
                    </ul>
                    
                    

                </li>
            </ul>
            
            <p>Denne parameteren er bare tilgjengelig n&aring;r parameteren  <b>Velg ett eller flere bildelag til utvalget</b> er et flerdimensjonalt raster.
            </p>
        </div>
    </div>
    <div id="bufferDistance">
        <div><h2>Angi bufferavstandsfelt eller -verdi</h2></div>
        <hr/>
        <div>
            <p>Den angitte avstanden rundt lokasjonsdatageoobjektene. Bufferavstanden angis i de line&aelig;re enhetene som er brukt i lokasjonsgeoobjektets romlige referanse. Hvis geoobjektet har en geografisk referanse, vil enheten v&aelig;re grader.
            </p>
            <p>Statistikk beregnes innenfor dette bufferomr&aring;det.
            </p>
            <p>Denne parameteren er bare tilgjengelig n&aring;r  <b>Velg ett eller flere bildelag til utvalget</b> er et flerdimensjonalt raster.
            </p>
        </div>
    </div>
    <div id="statisticsType">
        <div><h2>Velg statistikktype</h2></div>
        <hr/>
        <div>
            <p>Typen statistikk som skal beregnes.
            </p>
            <ul>
                <li> <b>Minimum</b> &ndash; Finner minimumsverdien innenfor det angitte omr&aring;det.
                </li>
                <li> <b>Maksimum</b> &ndash; Finner maksimumsverdien innenfor det angitte omr&aring;det.
                </li>
                <li> <b>Median</b> &ndash;Finner medianverdien innenfor det angitte omr&aring;det.
                </li>
                <li> <b>Gjennomsnitt</b> &ndash; Beregner gjennomsnittet for det angitte omr&aring;det.
                </li>
                <li> <b>Sum</b> &ndash; Beregner summen av variablene innenfor det angitte omr&aring;det.
                </li>
                <li> <b>Majoritet</b> &ndash; Finner verdien som forekommer oftest.
                </li>
                <li> <b>Minoritet</b> &ndash; Finner verdien som forekommer sjeldnest.
                </li>
                <li> <b>Standardavvik</b> &ndash; Beregner standardavviket.
                </li>
                <li> <b>Persentil</b> &ndash; Beregner en definert persentil innenfor det angitte omr&aring;det.
                </li>
            </ul>
            
            <p>Denne parameteren er bare tilgjengelig n&aring;r parameteren  <b>Velg ett eller flere bildelag til utvalget</b> er et flerdimensjonalt raster, og parameterne <b>Velg lokasjonslag</b> er polylinjer eller polygoner, eller <b>Angi bufferavstandsfelt eller -verdi (valgfritt)</b> er angitt.
            </p>
        </div>
    </div>
    <div id="percentileValue">
        <div><h2>Persentilverdi</h2></div>
        <hr/>
        <div>
            <p>Verdien kan v&aelig;re fra 0 til 100. Standardverdien er 90.
            </p>
            <p>Denne parameteren er bare tilgjengelig n&aring;r parameteren  <b>Velg statistikktype</b> er satt til <b>Persentil</b>.
            </p>
        </div>
    </div>
    <div id="resamplingType">
        <div><h2>Angi resamplingsteknikk</h2></div>
        <hr/>
        <div>
            <p>Resamplingsalgoritmen som brukes ved sampling av et raster.
            </p>
            <ul>
                <li> <b>N&aelig;rmest</b> &ndash;&nbsp;N&aelig;rmeste nabo, som bruker verdien til n&aelig;rmeste celle til &aring; tilordne en verdi for utdatacellen ved resampling. Dette er standardalternativet.
                </li>
                <li> <b>Biline&aelig;r</b> &ndash;&nbsp;Biline&aelig;r interpolasjon, som bestemmer den nye verdien av en celle basert p&aring; et vektet avstandsgjennomsnitt av de fire n&aelig;rmeste inndatacellesentrene.
                </li>
                <li> <b>Kubisk</b> &ndash;&nbsp;Kubisk konvolusjon bestemmer den nye verdien av en celle ved &aring; tilpasse en jevn kurve gjennom de 16 n&aelig;rmeste inndatacellesentrene.
                </li>
            </ul>
            
        </div>
    </div>
    <div id="layout">
        <div><h2>Angi layout for utdata</h2></div>
        <hr/>
        <div>
            <p>Angir om de samplede verdier skal vises i rader eller kolonner i utdatatabellen.
            </p>
            <ul>
                <li> <b>Samplede verdier vises i rad</b> &ndash; Samplede verdier vises i separate rader i utdatatabellen. Dette er standardalternativet.
                </li>
                <li> <b>Samplede verdier vises i kolonne</b> &ndash; Samplede verdier vises i separate kolonner i utdatatabellen.
                </li>
            </ul>
            
            <p>Denne parameteren er bare tilgjengelig n&aring;r parameteren  <b>Velg ett eller flere bildelag til utvalget</b> er et flerdimensjonalt raster og inneholder &eacute;n variabel og &eacute;n dimensjon, og hver inndeling er et raster med ett b&aring;nd.
            </p>
        </div>
    </div>
    <div id="outputType">
        <div><h2>Angi utdatatype</h2></div>
        <hr/>
        <div>
            <p>Angir om det skal genereres en punktgeoobjektklasse med samplede verdier i tabellen, eller bare en tabell med samplede verdier.
            </p>
            <ul>
                <li> <b>Tabell</b> &ndash; Generer en tabell med samplede verdier. Dette er standardalternativet.
                </li>
                <li> <b>Geoobjekter</b> &ndash; Generer en punktgeoobjektklasse med samplede verdier i tabellen. Hvis parameterne <b>Velg lokasjonslag</b> er polylinjer eller polygoner, er hvert punkt i utdataene tyngdepunktet i hver geometri i inndatalokasjonsgeoobjektene. 
                </li>
            </ul>
            
        </div>
    </div>
    <div id="outputName">
        <div><h2>Navn på resultatlag</h2></div>
        <hr/>
        <div>
            
            <p>Navnet p&aring; laget som opprettes i  <b>Mitt innhold</b> og legges til kartet. Standardnavnet er basert p&aring; verkt&oslash;ynavnet og navnet p&aring; inndatalaget. Hvis laget finnes allerede, blir du bedt om &aring; oppgi et annet navn.
            </p>
            <p>Du kan angi navnet p&aring; en mappe i  <b>Mitt innhold</b>, der resultatet blir lagret via rullegardinlisten <b>Lagre resultat i</b>.
            </p>
        </div>
    </div>
</div>
</html>
