<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Converteix un ràster a entitat</h2><p/>
        <h2><img src="../images/GUID-7BBBCE28-2FDA-46B8-99D7-65F560AB2F2B-web.png" alt="Eina Converteix un r&agrave;ster a entitat"></h2>
        <hr/>
    <p>Aquesta eina converteix un r&agrave;ster en un dataset d'entitats, com ara punts, l&iacute;nies o pol&iacute;gons.
    </p>
    <p>El par&agrave;metre  <b>Trieu un camp</b> us permet triar quin camp d'atribut del dataset r&agrave;ster d'entrada esdevindr&agrave; un atribut a la classe d'entitat de sortida. Aquest par&agrave;metre nom&eacute;s est&agrave; disponible per a r&agrave;sters enters que tenen atributs addicionals a la taula associada.
    </p>
    <p>El r&agrave;ster d'entrada pot tenir qualsevol mida de cel&middot;la.
    </p>
    <p>Els r&agrave;sters enters es poden convertir en entitats de punts, l&iacute;nies o pol&iacute;gons; aix&ograve; no obstant, els r&agrave;sters de punt flotant nom&eacute;s es poden convertir en entitats de punts.
    </p>
    <p>Si s'ha activat  <b>Utilitza l'extensi&oacute; del mapa actual</b>, nom&eacute;s es convertiran les cel&middot;les de r&agrave;ster que siguin visibles a l'extensi&oacute; de mapa actual. Si l'opci&oacute; est&agrave; desactivada, es convertiran totes les cel&middot;les de la capa de r&agrave;ster, encara que estiguin fora de l'extensi&oacute; de mapa actual. Preneu nota d'aix&ograve; si la capa de r&agrave;ster &eacute;s gran o t&eacute; una resoluci&oacute; molt alta.
    </p>
    <p>Els casos d'&uacute;s d'aquesta eina inclouen el seg&uuml;ent:
        <ul>
            <li>Creeu entitats de pol&iacute;gons a partir d'un r&agrave;ster de classificaci&oacute; d'&uacute;s del s&ograve;l.
                

            </li>
            <li>Les transmissions identificades en un DEM es poden convertir en entitats de l&iacute;nies.
                

            </li>
            <li>Un DEM es pot convertir en entitats de punts que es poden utilitzar en un flux de treball no basat en r&agrave;ster.
                

            </li>
        </ul>
        
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputLayer">
        <div><h2>Trieu una capa de ràster per convertir</h2></div>
        <hr/>
        <div>
            <p>Capa de r&agrave;ster d'entrada que es convertir&agrave; en capes d'entitats.
            </p>
        </div>
    </div>
    <div id="field">
        <div><h2>Trieu un camp</h2></div>
        <hr/>
        <div>
            <p>Camp que especifica el valor de conversi&oacute;.
            </p>
            <p>Pot ser qualsevol enter o valor de text.
            </p>
            <p>Un camp que contingui valors de punt flotant nom&eacute;s es pot utilitzar si la sortida es fa a un dataset de punts.
            </p>
            <p>L'opci&oacute; per defecte &eacute;s el camp  <i>Value</i>, que cont&eacute; el valor de cada cel&middot;la del r&agrave;ster.
            </p>
        </div>
    </div>
    <div id="outputType">
        <div><h2>Trieu el tipus de sortida</h2></div>
        <hr/>
        <div>
            <p>Especifica el tipus de sortida.
            </p>
            <ul>
                <li> <b>Punt</b>: el r&agrave;ster es convertir&agrave; en un dataset de punts. Aquesta &eacute;s l'opci&oacute; per defecte.
                    
 
                </li>
                <li> <b>L&iacute;nia</b>: el r&agrave;ster es convertir&agrave; en un dataset d'entitats de l&iacute;nies.
                    
 
                </li>
                <li> <b>Pol&iacute;gon</b>: el r&agrave;ster es convertir&agrave; en un dataset d'entitats de pol&iacute;gons.
                    

                </li>
            </ul>
            
        </div>
    </div>
    <div id="simplifyLinesOrPolygons">
        <div><h2>Simplifica les línies o els polígons</h2></div>
        <hr/>
        <div>
            <p>Especifica si les l&iacute;nies o pol&iacute;gons se simplificaran (se suavitzaran). La suavitzaci&oacute; es du a terme de manera que la l&iacute;nia cont&eacute; un nombre m&iacute;nim de segments, a la vegada que es mant&eacute; tan a prop com sigui possible de les vores del r&agrave;ster original.
            </p>
            <ul>
                <li>Activada: les entitats de l&iacute;nies o pol&iacute;gons se suavitzaran per produir un resultat m&eacute;s generalitzat. Aquesta &eacute;s l'opci&oacute; per defecte.
                    

                </li>
                <li>Desactivada: les entitats de l&iacute;nies o pol&iacute;gons seguiran els l&iacute;mits de la cel&middot;la del dataset r&agrave;ster.
                    

                </li>
            </ul>
            
            <p>Aquest par&agrave;metre nom&eacute;s s'admet si el tipus de sortida &eacute;s una l&iacute;nia o un pol&iacute;gon.
            </p>
        </div>
    </div>
    <div id="createMultipartFeatures">
        <div><h2>Crea entitats multipart</h2></div>
        <hr/>
        <div>
            <p>Especifica si els pol&iacute;gons de sortida estan formats per entitats d'una part o multipart.
            </p>
            <ul>
                <li>Activada: es crearan entitats multipart a partir dels pol&iacute;gons que tinguin el mateix valor.
                    

                </li>
                <li>Desactivada: es crearan entitats individuals (d'una sola part) per a cada pol&iacute;gon. Aquesta &eacute;s l'opci&oacute; per defecte.
                    

                </li>
            </ul>
            
            <p>Aquest par&agrave;metre nom&eacute;s s'admet si el tipus de sortida &eacute;s un pol&iacute;gon.
            </p>
        </div>
    </div>
    <div id="maxVerticesPerFeature">
        <div><h2>Nombre màxim de vèrtexs per entitat de polígon</h2></div>
        <hr/>
        <div>
            <p>L&iacute;mit de v&egrave;rtexs que s'utilitza per subdividir un pol&iacute;gon en pol&iacute;gons m&eacute;s petits.
            </p>
            <p>Si es deixa buit, els pol&iacute;gons de sortida no es dividiran. Aquesta &eacute;s l'opci&oacute; per defecte.
            </p>
            <p>Aquest par&agrave;metre nom&eacute;s s'admet si el tipus de sortida &eacute;s un pol&iacute;gon.
            </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Nom de la capa de resultats</h2></div>
        <hr/>
        <div>
            
            <p>Nom de la capa que es crear&agrave; a  <b>El meu contingut</b> i s'afegir&agrave; al mapa. El nombre predeterminado se basa en el nombre de la herramienta y en el nombre de la capa de entrada. Si la capa ja existeix, se us demanar&agrave; que proporcioneu un altre nom.
            </p>
            <p>Podeu especificar el nom d'una carpeta de  <b>El meu contingut</b> on es desar&agrave; el resultat mitjan&ccedil;ant el quadre desplegable <b>Desa el resultat a</b>.
            </p>
        </div>
    </div>
</div>
</html>
