<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Muestra</h2><p/>
        <h2><img src="../images/GUID-3950CCA3-C1D0-493F-A33D-93673443ADD2-web.png" alt="Muestra"></h2>
        <hr/>
    <p>Aquesta eina crea una taula o una classe d'entitat de punt que mostra els valors de les cel&middot;les d'un r&agrave;ster o d'un conjunt de r&agrave;sters per a ubicacions definides. Les ubicacions es defineixen amb cel&middot;les de r&agrave;ster, entitats de pol&iacute;gon, entitats de polil&iacute;nia o un conjunt de punts.
    </p>
    <p>Exemples d'aplicacions d'aquesta eina:
        <ul>
            <li> Extreure atributs per a la ubicaci&oacute; de l'antena de telefonia de diversos r&agrave;sters, com l'&uacute;s del s&ograve;l, el tipus de s&ograve;l, l'elevaci&oacute; i la dist&agrave;ncia a la carretera.
            </li>
            <li>Extreure la temperatura del s&ograve;l a diferents profunditats per a un conjunt de punts determinat.
            </li>
            <li>A partir de 30 anys de dades mensuals de la temperatura de la superf&iacute;cie del mar, resumir a les ubicacions dels animals o dins de les &agrave;rees de distribuci&oacute; per a un moment determinat en el qual s'ha observat una esp&egrave;cie animal.
            </li>
        </ul>
        
    </p>
    <p>Si l'opci&oacute;  <b>Utilitza l'extensi&oacute; del mapa actual</b> est&agrave; seleccionada, s'analitzaran les variables o les bandes de la capa que siguin visibles a l'extensi&oacute; de mapa actual. Si l'opci&oacute; est&agrave; desactivada, s'analitzaran les variables o les bandes de tota la capa, encara que estiguin fora de l'extensi&oacute; de mapa actual.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inRasters">
        <div><h2>Trieu les capes d'imatges per mostrejar</h2></div>
        <hr/>
        <div>
            <p>Una sola imatge o una llista d'imatges els valors de les quals es mostrejaran en funci&oacute; de les dades d'ubicaci&oacute; d'entrada. 
            </p>
            <p>Per mostrejar tots els sectors d'una capa d'imatges multidimensionals, ha de ser l'&uacute;nic r&agrave;ster d'entrada.
            </p>
        </div>
    </div>
    <div id="inLocationData">
        <div><h2>Trieu la capa d'ubicacions</h2></div>
        <hr/>
        <div>
            <p>Posicions d'identificaci&oacute; de dades que voleu mostrejar.
            </p>
            <p>Les dades d'ubicaci&oacute; d'entrada poden ser un r&agrave;ster o una classe d'entitat de punt, polil&iacute;nia o pol&iacute;gon.
            </p>
        </div>
    </div>
    <div id="uniqueIdField">
        <div><h2>Especifiqueu el camp d'ID únic</h2></div>
        <hr/>
        <div>
            <p>Camp que cont&eacute; un valor diferent per a cada ubicaci&oacute; o entitat del r&agrave;ster d'ubicaci&oacute; d'entrada o de la classe d'entitat.
            </p>
        </div>
    </div>
    <div id="acquisitionDefinition">
        <div><h2>Especifiqueu la informació d'adquisició de les dades d'ubicació (opcional)</h2></div>
        <hr/>
        <div>
            <p>Especifiqueu el temps, la profunditat o altres dades d'adquisici&oacute; de les dades associades amb les entitats o les cel&middot;les d'ubicaci&oacute;.
            </p>
            <p>Per a cada dimensi&oacute;, hi ha tres opcions per especificar la informaci&oacute; d'adquisici&oacute; associada a les entitats o les cel&middot;les d'ubicaci&oacute;:
            </p>
            <ul>
                <li> <b>Camp o valor &uacute;nic</b>: si aquesta opci&oacute; est&agrave; seleccionada, s'ha d'especificar la informaci&oacute; seg&uuml;ent:
                    <ul>
                        <li> <b>Camp o valor de dimensi&oacute;</b>: seleccioneu un camp de valors de dimensi&oacute; de les dades d'ubicaci&oacute; o introdu&iuml;u un valor de dimensi&oacute; espec&iacute;fic.
                        </li>
                    </ul>
                    
                    

                </li>
                <li> <b>Camp o valor &uacute;nic amb valors relatius</b>: si aquesta opci&oacute; est&agrave; seleccionada, la informaci&oacute; seg&uuml;ent s'ha d'especificar conjuntament per definir l'interval en qu&egrave; es calcularan les estad&iacute;stiques de les variables:
                    <ul>
                        <li> <b>Camp o valor de dimensi&oacute;</b>: seleccioneu un camp de valors de dimensi&oacute; de les dades d'ubicaci&oacute;.
                        </li>
                        <li> <b>Valor relatiu anterior</b>: especifiqueu un nombre no negatiu que es restar&agrave; de <b>Camp o valor de dimensi&oacute;</b> per definir l'inici d'un interval de valors de dimensi&oacute;. Aquest valor representa el nombre de dies si la dimensi&oacute; &eacute;s temps.
                        </li>
                        <li> <b>Valor relatiu posterior</b>: especifiqueu un nombre no negatiu que se sumar&agrave; a <b>Camp o valor de dimensi&oacute;</b> per definir el final d'un interval de valors de dimensi&oacute;. Aquest valor representa el nombre de dies si la dimensi&oacute; &eacute;s temps.
                        </li>
                    </ul>
                    
                </li>
                <li> <b>Camps o valors d'inici i de finalitzaci&oacute;</b>: si aquesta opci&oacute; est&agrave; seleccionada, la informaci&oacute; seg&uuml;ent s'ha d'especificar conjuntament per definir l'interval en qu&egrave; es calcularan les estad&iacute;stiques de les variables:
                    <ul>
                        <li> <b>Camp o valors d'inici</b>: seleccioneu un camp de valors de dimensi&oacute; de les dades d'ubicaci&oacute; o introdu&iuml;u un valor de dimensi&oacute; espec&iacute;fic per definir l'inici d'un interval de valors de dimensi&oacute;.
                        </li>
                        <li> <b>Camp o valors de finalitzaci&oacute;</b>: seleccioneu un camp de valors de dimensi&oacute; de les dades d'ubicaci&oacute; o introdu&iuml;u un valor de dimensi&oacute; espec&iacute;fic per definir la finalitzaci&oacute; d'un interval de valors de dimensi&oacute;.
                        </li>
                    </ul>
                    
                    

                </li>
            </ul>
            
            <p>Aquest par&agrave;metre nom&eacute;s est&agrave; disponible si el par&agrave;metre  <b>Trieu les capes d'imatges per mostrejar</b> &eacute;s un r&agrave;ster multidimensional.
            </p>
        </div>
    </div>
    <div id="bufferDistance">
        <div><h2>Especifiqueu el camp o el valor de distància d'àrea d'influència</h2></div>
        <hr/>
        <div>
            <p>Dist&agrave;ncia especificada al voltant de les entitats de dades d'ubicaci&oacute;. La dist&agrave;ncia d'&agrave;rea d'influ&egrave;ncia s'especifica en les unitats lineals de la refer&egrave;ncia espacial de l'entitat d'ubicaci&oacute;. Si l'entitat utilitza una refer&egrave;ncia geogr&agrave;fica, la unitat ser&agrave; de graus.
            </p>
            <p>Les estad&iacute;stiques es calcularan en aquesta &agrave;rea d'influ&egrave;ncia.
            </p>
            <p>Aquest par&agrave;metre nom&eacute;s est&agrave; disponible si  <b>Trieu les capes d'imatges per mostrejar</b> &eacute;s un r&agrave;ster multidimensional.
            </p>
        </div>
    </div>
    <div id="statisticsType">
        <div><h2>Trieu el tipus d'estadístiques</h2></div>
        <hr/>
        <div>
            <p>El tipus d'estad&iacute;stica que es calcular&agrave;.
            </p>
            <ul>
                <li> <b>M&iacute;nim</b>: cerca el valor m&iacute;nim dins de l'interval especificat.
                </li>
                <li> <b>M&agrave;xim</b>: cerca el valor m&agrave;xim dins de l'interval especificat.
                </li>
                <li> <b>Mediana</b>: cerca el valor medi&agrave; dins de l'interval especificat.
                </li>
                <li> <b>Mitjana</b>: calcula la mitjana de l'interval especificat.
                </li>
                <li> <b>Suma</b>: calcula la suma de les variables dins de l'interval especificat.
                </li>
                <li> <b>Majoria</b>: cerca el valor que s'ha donat amb m&eacute;s freq&uuml;&egrave;ncia.
                </li>
                <li> <b>Minoria</b>: cerca el valor que s'ha donat amb menys freq&uuml;&egrave;ncia.
                </li>
                <li> <b>Desviaci&oacute; est&agrave;ndard</b>: calcula la desviaci&oacute; est&agrave;ndard.
                </li>
                <li> <b>Percentil</b>: calcula un percentil definit dins d'un interval especificat.
                </li>
            </ul>
            
            <p>Aquest par&agrave;metre nom&eacute;s est&agrave; disponible si el par&agrave;metre  <b>Trieu les capes d'imatges per mostrejar</b> &eacute;s un r&agrave;ster multidimensional, i els par&agrave;metres <b>Trieu la capa d'ubicacions</b> s&oacute;n polil&iacute;nies o pol&iacute;gons , o si s'especifica <b>Especifiqueu el camp o el valor de dist&agrave;ncia d'&agrave;rea d'influ&egrave;ncia (opcional)</b>.
            </p>
        </div>
    </div>
    <div id="percentileValue">
        <div><h2>Valor de percentil</h2></div>
        <hr/>
        <div>
            <p>Aquest valor pot anar de 0 a 100. El valor per defecte &eacute;s 90.
            </p>
            <p>Aquest par&agrave;metre nom&eacute;s est&agrave; disponible si el valor del par&agrave;metre  <b>Trieu el tipus d'estad&iacute;stiques</b> &eacute;s <b>Percentil</b>.
            </p>
        </div>
    </div>
    <div id="resamplingType">
        <div><h2>Especifiqueu la tècnica de remostreig</h2></div>
        <hr/>
        <div>
            <p>Algoritme de remostreig que s'utilitza en mostrejar un r&agrave;ster.
            </p>
            <ul>
                <li> <b>M&eacute;s proper</b>: ve&iacute; m&eacute;s proper, que utilitza el valor de la cel&middot;la m&eacute;s propera per assignar un valor a la cel&middot;la de sortida durant el remostreig. Esta es la opci&oacute;n predeterminada.
                </li>
                <li> <b>Bilineal</b>: interpolaci&oacute; bilineal, que determina el nou valor d'una cel&middot;la en funci&oacute; de la mitjana de la dist&agrave;ncia ponderada dels quatre centres de cel&middot;la m&eacute;s propers.
                </li>
                <li> <b>C&uacute;bic</b>: convoluci&oacute; c&uacute;bica, que determina el nou valor d'una cel&middot;la en funci&oacute; de l'ajust d'una corba suau a trav&eacute;s dels 16 centres de cel&middot;les d'entrada m&eacute;s propers.
                </li>
            </ul>
            
        </div>
    </div>
    <div id="layout">
        <div><h2>Especifiqueu el disseny de sortida</h2></div>
        <hr/>
        <div>
            <p>Especifica si els valors mostrejats apareixen en files o columnes a la taula de sortida.
            </p>
            <ul>
                <li> <b>Els valors mostrejats apareixen en files</b>: els valors mostrejats apareixen en files separades a la taula de sortida. Esta es la opci&oacute;n predeterminada.
                </li>
                <li> <b>Els valors mostrejats apareixen en columnes</b>: els valors mostrejats apareixen en columnes separades a la taula de sortida.
                </li>
            </ul>
            
            <p>Aquest par&agrave;metre nom&eacute;s est&agrave; disponible si el par&agrave;metre  <b>Trieu les capes d'imatges per mostrejar</b> &eacute;s un r&agrave;ster multidimensional d'entrada i cont&eacute; una variable i una dimensi&oacute;, i cada sector &eacute;s un r&agrave;ster d'una banda.
            </p>
        </div>
    </div>
    <div id="outputType">
        <div><h2>Especifiqueu el tipus de sortida</h2></div>
        <hr/>
        <div>
            <p>Especifica si s'ha de generar una classe d'entitat de punt amb valors mostrejats a la taula o b&eacute; nom&eacute;s una taula amb valors mostrejats.
            </p>
            <ul>
                <li> <b>Taula</b>: es genera una taula amb valors mostrejats. Esta es la opci&oacute;n predeterminada.
                </li>
                <li> <b>Entitats</b>: es genera una classe d'entitat de punt amb valors mostrejats a la taula. Si els par&agrave;metres <b>Trieu la capa d'ubicacions</b> s&oacute;n polil&iacute;nies o pol&iacute;gons, cada punt de la sortida &eacute;s un centroide de cada geometria de les entitats d'ubicaci&oacute; d'entrada. 
                </li>
            </ul>
            
        </div>
    </div>
    <div id="outputName">
        <div><h2>Nom de la capa de resultats</h2></div>
        <hr/>
        <div>
            
            <p>Nom de la capa que es crear&agrave; a  <b>El meu contingut</b> i s'afegir&agrave; al mapa. El nombre predeterminado se basa en el nombre de la herramienta y en el nombre de la capa de entrada. Si la capa ja existeix, se us demanar&agrave; que proporcioneu un altre nom.
            </p>
            <p>Podeu especificar el nom d'una carpeta de  <b>El meu contingut</b> on es desar&agrave; el resultat mitjan&ccedil;ant el quadre desplegable <b>Desa el resultat a</b>.
            </p>
        </div>
    </div>
</div>
</html>
