<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Agregar Raster Multidimensional</h2><p/>
        <h2><img src="../images/GUID-2C2320A3-EC6E-4FFC-B59B-9551BB02C545-web.png" alt="Agregar Raster Multidimensional"></h2>
        <hr/>
    <p>Gera um conjunto de dados raster multidimensional ao combinar vari&aacute;veis de raster multidimensional j&aacute; existentes a uma dimens&atilde;o.
    </p>
    <p>Se dispuser de 30 anos de dados sobre a temperatura da superf&iacute;cie do mar, recolhidos mensalmente e a cada 5 metros de profundidade at&eacute; 100 metros, pode aplic&aacute;-los de alguma destas formas:
        <ul>
            <li>Agregar os dados de temperatura mensais em dados anuais.
            </li>
            <li>Agregar os dados de temperatura mensais em intervalos de 4 meses.
            </li>
            <li>Agregar os dados de temperatura de 0 a 25 metros, e depois de 25 a 50 metros, e de 50 a 100 metros.
            </li>
        </ul>
        
    </p>
    <p>Se a op&ccedil;&atilde;o  <b>Utilizar a extens&atilde;o do mapa atual</b> estiver assinalada, ser&atilde;o analisadas as vari&aacute;veis da camada que se encontrem vis&iacute;veis na extens&atilde;o do mapa atual. Se estiver desmarcada, ser&atilde;o analisadas as vari&aacute;veis de toda a camada, mesmo que estejam fora da extens&atilde;o do mapa atual.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputMultidimensionalRaster">
        <div><h2>Escolher uma camada de imagem a agregar</h2></div>
        <hr/>
        <div>
            <p>A camada de imagem de entrada de um raster multidimensional ser&aacute; agregada.
            </p>
        </div>
    </div>
    <div id="dimension">
        <div><h2>Escolher a dimensão na qual se pretende agregar</h2></div>
        <hr/>
        <div>
            <p>Dimens&atilde;o de agrega&ccedil;&atilde;o. Esta &eacute; a dimens&atilde;o ao longo da qual as vari&aacute;veis ser&atilde;o agregadas.
            </p>
        </div>
    </div>
    <div id="variables">
        <div><h2>Escolher variável(is) a agregar</h2></div>
        <hr/>
        <div>
            <p>A(s) vari&aacute;vel(is) que ser&aacute;(&atilde;o) agregada(s) ao longo de uma determinada dimens&atilde;o. Se n&atilde;o for especificada uma vari&aacute;vel, todas as vari&aacute;veis com a dimens&atilde;o selecionada ser&atilde;o agregadas.
            </p>
            <p>Por exemplo, para agregar os seus dados de temperatura di&aacute;rios em valores m&eacute;dios mensais, especifique a temperatura como a vari&aacute;vel a ser agregada. Se n&atilde;o especificar quaisquer vari&aacute;veis e dispuser de vari&aacute;veis de temperaturas di&aacute;rias e de precipita&ccedil;&atilde;o di&aacute;ria, ambas as vari&aacute;veis ser&atilde;o agregadas em m&eacute;dias mensais e o raster multidimensional de sa&iacute;da incluir&aacute; ambas as vari&aacute;veis.
            </p>
        </div>
    </div>
    <div id="aggregationMethod">
        <div><h2>Escolher método de agregação</h2></div>
        <hr/>
        <div>
            <p>Especifica o m&eacute;todo matem&aacute;tico que ser&aacute; utilizado para combinar as sec&ccedil;&otilde;es agregadas num intervalo.
                <ul>
                    <li> <b>M&eacute;dia</b> &mdash; Calcula a m&eacute;dia dos valores de um p&iacute;xel em todas as sec&ccedil;&otilde;es no intervalo. Isto &eacute; por omiss&atilde;o.
                    </li>
                    <li> <b>M&aacute;ximo</b> &mdash; Calcula o valor m&aacute;ximo de um p&iacute;xel em todas as sec&ccedil;&otilde;es no intervalo.
                    </li>
                    <li> <b>Maioria</b> &mdash; Calcula o valor que ocorreu com mais frequ&ecirc;ncia para um p&iacute;xel em todas as sec&ccedil;&otilde;es no intervalo.
                    </li>
                    <li> <b>M&iacute;nimo</b> &mdash; Calcula o valor m&iacute;nimo de um p&iacute;xel em todas as sec&ccedil;&otilde;es no intervalo.
                    </li>
                    <li> <b>Minoria</b> &mdash; Calcula o valor que ocorreu com menos frequ&ecirc;ncia para um p&iacute;xel em todas as sec&ccedil;&otilde;es no intervalo.
                    </li>
                    <li> <b>Mediana</b> &mdash; Calcula o valor mediano de um p&iacute;xel em todas as sec&ccedil;&otilde;es no intervalo.
                    </li>
                    <li> <b>Percentil</b> &mdash; O percentil de valores de um p&iacute;xel ser&aacute; calculado em todas as sec&ccedil;&otilde;es no intervalo. O 90.&ordm; percentil &eacute; calculado por predefini&ccedil;&atilde;o. Pode especificar outros valores (de 0 a 100) usando o par&acirc;metro <b>Valor de Percentil</b>.
                    </li>
                    <li> <b>Intervalo</b> &mdash; Calcula o intervalo de valores para um p&iacute;xel em todas as sec&ccedil;&otilde;es no intervalo.
                    </li>
                    <li> <b>Desvio Padr&atilde;o</b> &mdash; Calcula o desvio padr&atilde;o dos valores de um p&iacute;xel em todas as sec&ccedil;&otilde;es no intervalo.
                    </li>
                    <li> <b>Soma</b> &mdash; Calcula a soma dos valores de um p&iacute;xel em todas as sec&ccedil;&otilde;es no intervalo.
                    </li>
                    <li> <b>Variedade</b> &mdash; Calcula o n&uacute;mero de valores &uacute;nicos de um p&iacute;xel em todas as sec&ccedil;&otilde;es no intervalo.
                    </li>
                    <li> <b>Personalizada</b> &mdash; Calcula o valor de um p&iacute;xel com base numa fun&ccedil;&atilde;o raster personalizada.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="aggregationFunction">
        <div><h2>Escolher modelo de função raster</h2></div>
        <hr/>
        <div>
            <p>Uma fun&ccedil;&atilde;o raster personalizada que ser&aacute; utilizada para calcular os valores de p&iacute;xel dos rasters agregados. A entrada &eacute; um item do modelo de fun&ccedil;&atilde;o raster no portal. Esta entrada &eacute; necess&aacute;ria quando  <b>M&eacute;todo de Agrega&ccedil;&atilde;o</b> est&aacute; definido em <b>Personalizar</b>.
            </p>
        </div>
    </div>
    <div id="aggregationDefinition">
        <div><h2>Escolher definição de agregação</h2></div>
        <hr/>
        <div>
            <p>Especifica o intervalo de dimens&atilde;o para o qual os dados ser&atilde;o agregados.
                <ul>
                    <li> <b>Todos</b> &mdash; Os valores dos dados ser&atilde;o agregados em todas as sec&ccedil;&otilde;es. Isto &eacute; por omiss&atilde;o.
                    </li>
                    <li> <b>Palavra-chave de Intervalo</b> &mdash; Os dados das vari&aacute;veis ser&atilde;o agregados utilizando um intervalo normalmente conhecido.
                    </li>
                    <li> <b>Valores de Intervalo</b> &mdash; Os dados das vari&aacute;veis ser&atilde;o agregados utilizando um intervalo e unidade especificados pelo utilizador.
                    </li>
                    <li> <b>Intervalos</b> &mdash; Os dados das vari&aacute;veis ser&atilde;o agregados entre pares especificados de valores ou datas.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="intervalKeyword">
        <div><h2>Escolher um intervalo de palavras-chave</h2></div>
        <hr/>
        <div>
            <p>Especifica o intervalo de palavras-chave que ser&aacute; utilizado durante a agrega&ccedil;&atilde;o ao longo da dimens&atilde;o. Esta entrada &eacute; necess&aacute;ria quando  <b>Defini&ccedil;&atilde;o de Agrega&ccedil;&atilde;o</b> est&aacute; definido em <b>Palavra-chave de Intervalo</b> e a agrega&ccedil;&atilde;o deve ser efetuada ao longo do tempo.
                <ul>
                    <li> <b>De hora a hora</b> &mdash; Os valores dos dados ser&atilde;o agregados em etapas temporais hor&aacute;rias e o resultado incluir&aacute; todas as horas na s&eacute;rie de tempo.
                    </li>
                    <li> <b>Diariamente</b> &mdash; Os valores dos dados ser&atilde;o agregados em etapas temporais di&aacute;rias e o resultado incluir&aacute; todos os dias na s&eacute;rie de tempo.
                    </li>
                    <li> <b>Semanalmente</b> &mdash; Os valores dos dados ser&atilde;o agregados em etapas temporais semanais e o resultado incluir&aacute; todas as semanas na s&eacute;rie de tempo.
                    </li>
                    <li> <b>Mensalmente</b> &mdash; Os valores dos dados ser&atilde;o agregados em etapas temporais mensais e o resultado incluir&aacute; todos meses na s&eacute;rie de tempo.
                    </li>
                    <li> <b>Trimestralmente</b> &mdash; Os valores dos dados ser&atilde;o agregados em etapas temporais trimestrais e o resultado incluir&aacute; todos os trimestres na s&eacute;rie de tempo.
                    </li>
                    <li> <b>Anualmente</b> &mdash; Os valores dos dados ser&atilde;o agregados em etapas temporais anuais e o resultado incluir&aacute; todos os anos na s&eacute;rie de tempo.
                    </li>
                    <li> <b>Diariamente Recorrente</b> &mdash; Os valores dos dados ser&atilde;o agregados em etapas temporais di&aacute;rias e o resultado incluir&aacute; um valor agregado por dia juliano. O resultado incluir&aacute;, no m&aacute;ximo, 366 sec&ccedil;&otilde;es de tempo di&aacute;rias.
                    </li>
                    <li> <b>Semanalmente Recorrente</b> &mdash; Os valores dos dados ser&atilde;o agregados em etapas temporais semanais e o resultado incluir&aacute; um valor agregado por semana. O resultado incluir&aacute;, no m&aacute;ximo, 53 sec&ccedil;&otilde;es de tempo semanais.
                    </li>
                    <li> <b>Mensalmente Recorrente</b> &mdash; Os valores dos dados ser&atilde;o agregados em etapas temporais semanais e o resultado incluir&aacute; um valor agregado por m&ecirc;s. O resultado incluir&aacute;, no m&aacute;ximo, 12 sec&ccedil;&otilde;es de tempo mensais.
                    </li>
                    <li> <b>Trimestralmente Recorrente</b> &mdash; Os valores dos dados ser&atilde;o agregados em etapas temporais semanais e o resultado incluir&aacute; um valor agregado por trimestre. O resultado incluir&aacute;, no m&aacute;ximo, 4 sec&ccedil;&otilde;es de tempo trimestrais.
                    </li>
                    <li> <b>A cada 10 dias</b> &mdash; Os valores dos dados ser&atilde;o agregados em 3 per&iacute;odos de 10 dias cada. O &uacute;ltimo per&iacute;odo pode conter mais ou menos que 10 dias. O resultado incluir&aacute; 3 sec&ccedil;&otilde;es para cada m&ecirc;s.
                    </li>
                    <li> <b>A cada 5 dias</b> &mdash; Os valores dos dados ser&atilde;o agregados em 6 per&iacute;odos de 5 dias cada. O &uacute;ltimo per&iacute;odo pode conter mais ou menos que 5 dias. O resultado incluir&aacute; 6 sec&ccedil;&otilde;es para cada m&ecirc;s.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="intervalValue">
        <div><h2>Intervalo de valor</h2></div>
        <hr/>
        <div>
            <p>O tamanho do intervalo que ser&aacute; utilizado para a agrega&ccedil;&atilde;o. Este par&acirc;metro &eacute; necess&aacute;rio quando o par&acirc;metro  <b>Defini&ccedil;&atilde;o de Agrega&ccedil;&atilde;o</b> est&aacute; definido em <b>Valor de intervalo</b>.
            </p>
            <p>Por exemplo, para agregar 30 anos de dados de temperatura mensais em incrementos de 5 anos, introduza 5 como  <b>Intervalo de Valor</b> e especifique <b>Unidade</b> como <b>Anos</b>.
            </p>
        </div>
    </div>
    <div id="intervalUnit">
        <div><h2>Unidade</h2></div>
        <hr/>
        <div>
            <p>A unidade que ser&aacute; utilizado para o valor de intervalo. Esta entrada &eacute; necess&aacute;ria quando  <b>Dimens&atilde;o</b> &eacute; um campo de tempo e <b>Defini&ccedil;&atilde;o de Agrega&ccedil;&atilde;o</b> est&aacute; definido em <b>Valor de Intervalo</b>.
            </p>
            <p>Se estiver a agregar algo que n&atilde;o tempo, esta op&ccedil;&atilde;o n&atilde;o estar&aacute; dispon&iacute;vel e a unidade para o valor de intervalo ir&aacute; corresponder &agrave; unidade da vari&aacute;vel dos dados raster multidimensional introduzidos.
                <ul>
                    <li> <b>Horas</b> &mdash; Os valores de dados ser&atilde;o agregados em sec&ccedil;&otilde;es de tempo hor&aacute;rias no intervalo fornecido.
                    </li>
                    <li> <b>Dias</b> &mdash; Os valores de dados ser&atilde;o agregados em sec&ccedil;&otilde;es de tempo di&aacute;rias no intervalo fornecido.
                    </li>
                    <li> <b>Semanas</b> &mdash; Os valores de dados ser&atilde;o agregados em sec&ccedil;&otilde;es de tempo semanais no intervalo fornecido.
                    </li>
                    <li> <b>Meses</b> &mdash; Os valores de dados ser&atilde;o agregados em sec&ccedil;&otilde;es de tempo mensais no intervalo fornecido.
                    </li>
                    <li> <b>Anos</b> &mdash; Os valores de dados ser&atilde;o agregados em sec&ccedil;&otilde;es de tempo anuais no intervalo fornecido.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="intervalRanges">
        <div><h2>Definir intervalos</h2></div>
        <hr/>
        <div>
            <p>Os intervalos ser&atilde;o utilizados para agregar grupos de valores. Consistem em pares de valores de intervalo m&iacute;nimos e m&aacute;ximos, com tipos de dados Duplo ou Data. Esta entrada &eacute; necess&aacute;ria quando a  <b>Defini&ccedil;&atilde;o de Agrega&ccedil;&atilde;o</b> est&aacute; definido em <b>Intervalos</b>.
            </p>
        </div>
    </div>
    <div id="ignoreNodata">
        <div><h2>Ignorar valores em falta no cálculo</h2></div>
        <hr/>
        <div>
            <p>Especifica se os valores em falta s&atilde;o ou n&atilde;o ignorados na an&aacute;lise.
                <ul>
                    <li>Assinalado &mdash; A an&aacute;lise ir&aacute; incluir todos os p&iacute;xeis v&aacute;lidos ao longo de uma determinada dimens&atilde;o e ignorar quaisquer p&iacute;xeis NoData. Isto &eacute; por omiss&atilde;o.
                    </li>
                    <li>Desmarcado &mdash; A an&aacute;lise resultar&aacute; em NoData se existirem valores NoData para os p&iacute;xeis ao longo de uma determinada dimens&atilde;o.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Nome da camada resultante</h2></div>
        <hr/>
        <div>
            
            <p>O nome da camada que ser&aacute; criada em  <b>O Meu Conte&uacute;do</b> e adicionada ao mapa. O nome padr&atilde;o &eacute; baseado no nome da ferramenta e do nome da camada de entrada. Se a camada j&aacute; existir, ser-lhe-&aacute; pedido que introduza outro nome.
            </p>
            <p>&Eacute; poss&iacute;vel especificar o nome de uma pasta em  <b>O Meu Conte&uacute;do</b>, onde o resultado ser&aacute; guardado utilizando a op&ccedil;&atilde;o <b>Guardar Resultado em</b> da caixa suspensa. Se tiver os privilégios para criar camadas de imagens em mosaico e dinâmicas, pode especificar o tipo de camada que será gerado na saída utilizando a caixa pendente Guardar resultado como. </p>
        </div>
    </div>
    <div id="percentileValue">
        <div><h2>Valor de percentil</h2></div>
        <hr/>
        <div>
            <p>O percentil a calcular. A predefini&ccedil;&atilde;o &eacute; 90, indicando o 90.&ordm; percentil.
            </p>
            <p>O intervalo dos valores &eacute; de 0 a 100. O 0.&ordm; percentil &eacute; essencialmente equivalente &agrave; estat&iacute;stica m&iacute;nimo e o 100.&ordm; percentil &eacute; equivalente a m&aacute;ximo. Um valor de 50 ir&aacute; essencialmente produzir o mesmo resultado que a estat&iacute;stica mediana.
            </p>
        </div>
    </div>
    <div id="percentileInterpolationType">
        <div><h2>Tipo de interpolação de percentil</h2></div>
        <hr/>
        <div>
            <p>Especifica o m&eacute;todo de interpola&ccedil;&atilde;o de percentil que ser&aacute; usado quando existir um n&uacute;mero par de valores do raster de entrada a ser calculado.
            </p>
        </div>
    </div>
</div>
</html>
