<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Calcular Densidade</h2><p/>
        <h2><img src="../images/GUID-38AD3C19-0400-4E5A-9282-BDE42F2BBFC1-web.png" alt="Calculate Density"></h2>
        <hr/>
    <p>The Calculate Density tool creates a density map from point features by spreading known quantities of some phenomenon (represented as attributes of the points) across the map. The result is a layer of areas classified from least dense to most dense.   

    </p>
    <p>For point input, each point should represent the location of some event or incident, and the result layer represents a count of the incident per unit area.  A higher density value in a new location means that there are more points near that location.  In many cases, the result layer can be interpreted as a risk surface for future events. For example, if the input points represent locations of lightning strikes, the result layer can be interpreted as a risk surface for future lightning strikes.
    </p>
    <p>Other use cases of this tool include the following:
        <ul>
            <li>Creating crime-density maps to help police departments properly allocate resources to high crime areas.
            </li>
            <li>Calculating densities of hospitals within a county.  The result layer will show areas with high and low accessibility to hospitals, and this information can be used to decide where new hospitals should be built.
            </li>
            <li>Identifying areas that are at high risk of forest fires based on historical locations of forest fires.
            </li>
            <li>Locating communities that are far from major highways in order to plan where new roads should be constructed.
            </li>
        </ul>
        
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputLayer">
        <div><h2>Selecionar uma camada de pontos a partir da qual calcular densidade</h2></div>
        <hr/>
        <div>
            <p>The point layer on which the density will be calculated.
            </p>
            <p>Para al&eacute;m de selecionar uma camada do seu mapa, pode selecionar  <b>Explorar Camadas</b> na parte inferior da lista pendente para navegar at&eacute; aos seus conte&uacute;dos de um conjunto de dados de partilha de big data ou camada de elementos.
            </p>
        </div>
    </div>
    <div id="fields">
        <div><h2>Selecionar um ou mais campos nos quais calcular densidade (opcional)</h2></div>
        <hr/>
        <div>
            <p>Provide  one or more fields specifying the number of incidents at each location.  For example, if you have points that represent cities, you can use a field representing the population of the city as the count field, and the resulting population density layer will calculate larger population densities near cities with larger populations.
            </p>
            <p>The density for the count of points will always be calculated.   If no fields are selected, each location will be assumed to represent a single count.
            </p>
        </div>
    </div>
    <div id="binType">
        <div><h2>Selecionar uma forma de caixa</h2></div>
        <hr/>
        <div>
            <p>The shape of bins that points are aggregated into and used for the density calculation.
            </p>
            <p>An&aacute;lise utilizando caixas  <b>Quadrado</b> ou <b>Hex&aacute;gono</b> requerem um ambiente de coordenadas projetadas. Pode definir o <b>Sistema de coordenadas de processamento</b> nos <b>Ambientes de An&aacute;lise</b>. Se o seu sistema de coordenadas projetado n&atilde;o se encontra definido para um sistema de coordenadas projetado, ser&aacute; instado a defini-lo quando <b>Correr a An&aacute;lise</b>.
            </p>
        </div>
    </div>
    <div id="binSizing">
        <div><h2>Selecionar o tamanho da caixa para agregação</h2></div>
        <hr/>
        <div>
            <p>The size of the bins generated. For a square bin, the size represents the height of the square. For hexagon, the size represents the height of the hexagon (from parallel sides).
            </p>
        </div>
    </div>
    <div id="weight">
        <div><h2>Selecionar a ponderaçao de densidade a aplicar</h2></div>
        <hr/>
        <div>
            <p>The type of weighting applied to the density calculation. There are two options:
                <ul>
                    <li> <b>Uniform</b>&mdash;This calculates a magnitude per area.
                    </li>
                    <li> <b>Kernel</b>&mdash;Applies a kernel function to fit a smooth tapered surface to each point.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="neighborhood">
        <div><h2>Selecionar o tamanho do bairro</h2></div>
        <hr/>
        <div>
            <p>The size of the area used to calculate the density. The neighborhood size must be larger than the bin size.
            </p>
        </div>
    </div>
    <div id="areaUnits">
        <div><h2>Escolher as unidades de saída para densidade</h2></div>
        <hr/>
        <div>
            <p>The desired output units of the density values. By default, this is set to square kilometers or square miles based on the default units specified in your profile. If density values are very small, you can increase the size of the area units (for example, square meters to square kilometers) to return larger values. The values only scale the result.  

            </p>
        </div>
    </div>
    <div id="timeSlicing">
        <div><h2>Calcular densidade utilizando etapas temporais (opcional)</h2></div>
        <hr/>
        <div>
            <p>Caso a componente temporal se encontre ativa na camada de pontos de entrada, pode analisar recorrendo a etapas temporais.  Existem tr&ecirc;s par&acirc;metros que pode definir quando utiliza componente temporal:
                <ul>
                    <li> <b>Intervalo entre etapas temporais</b>
                    </li>
                    <li> <b>Frequ&ecirc;ncia de repeti&ccedil;&atilde;o da etapa temporal</b>
                    </li>
                    <li> <b>Hora &agrave; qual alinhar as etapas temporais</b>
                    </li>
                </ul>
                
            </p>
            <p>Imagine que tem dados que representam um ano em tempo e que pretende analis&aacute;-los recorrendo a etapas semanais. Para isso, teria de definir o  <b>Intervalo de etapa temporal</b> para <code>1 semana</code>.
            </p>
            <p>Imagine que tem dados que representam um ano em tempo e que pretende analis&aacute;-los utilizando a primeira semana do m&ecirc;s. Para isso, teria de definir o  <b>Intervalo de etapa temporal</b> para <code>1 semana</code>, <b>Frequ&ecirc;ncia de repeti&ccedil;&atilde;o da etapa temporal</b> para <code>1 m&ecirc;s</code>, e <b>Hora &agrave; qual alinhar as etapas temporais</b> para <code>1 de janeiro, &agrave;s 12:00</code>.
            </p>
        </div>
    </div>
    <div id="timeInterval">
        <div><h2>Intervalo entre etapas temporais</h2></div>
        <hr/>
        <div>
            <p>Intervalo temporal utilizado para gerar etapas temporais. O intervalo de etapas temporais pode ser utilizado isoladamente ou com os par&acirc;metros  <b>Frequ&ecirc;ncia de repeti&ccedil;&atilde;o da etapa temporal</b> ou <b>Hora &agrave; qual alinhar as etapas temporais</b> .
            </p>
            <p>Caso pretendesse criar parcelas temporais que tivessem lugar todas as segundas-feiras entre as 9:00 e as 10:00 da manh&atilde;,  <b>Intervalo de etapa temporal</b> seria <code>1 hora</code>, <b>Frequ&ecirc;ncia de repeti&ccedil;&atilde;o da etapa temporal</b> seria <code>1 semana</code>, e <b>Hora &agrave; qual alinhar as etapas temporais</b> seria <code>9:00:00 de uma segunda-feira</code>.
            </p>
        </div>
    </div>
    <div id="timeStep">
        <div><h2>Frequência de repetição da etapa temporal</h2></div>
        <hr/>
        <div>
            <p> A etapa utilizada para calcular uma parcela temporal. <b>Frequ&ecirc;ncia de repeti&ccedil;&atilde;o da etapa temporal</b> pode ser utilizado isoladamente ou com <b>Intervalo de etapa temporal</b>, com <b>Hora de refer&ecirc;ncia</b>, ou, simultaneamente, com os par&acirc;metros <b>Intervalo de etapa temporal</b> e <b>Hora &agrave; qual alinhar as etapas temporais</b>.
            </p>
            <p> Caso pretendesse criar parcelas temporais que tivessem lugar todas as segundas-feiras entre as 9:00 e as 10:00 da manh&atilde;, <b>Intervalo de etapa temporal</b> seria <code>1 hora</code>, <b>Frequ&ecirc;ncia de repeti&ccedil;&atilde;o da etapa temporal</b> seria <code>1 semana</code>, e <b>Hora &agrave; qual alinhar as etapas temporais</b> seria <code>9:00:00 de uma segunda-feira</code>.
            </p>
        </div>
    </div>
    <div id="timeReference">
        <div><h2>Hora à qual alinhar as etapas temporais</h2></div>
        <hr/>
        <div>
            <p>A data e hora utilizadas para alinhar a divis&atilde;o temporal. A utiliza&ccedil;&atilde;o de etapas temporais ter&aacute; in&iacute;cio a partir desta hora, e continuar&aacute; de forma regressiva at&eacute; &agrave; mesma. Caso n&atilde;o seja selecionada qualquer hora de refer&ecirc;ncia, a etapa temporal ser&aacute; alinhada a 1 de janeiro de 1970. 
            </p>
            <p> Caso pretendesse criar parcelas temporais que tivessem lugar todas as segundas-feiras entre as 9:00 e as 10:00 da manh&atilde;, <b>Intervalo de etapa temporal</b> seria <code>1 hora</code>, <b>Frequ&ecirc;ncia de repeti&ccedil;&atilde;o da etapa temporal</b> seria <code>1 semana</code>, e <b>Hora &agrave; qual alinhar as etapas temporais</b> seria <code>9:00:00 de uma segunda-feira</code>.
            </p>
        </div>
    </div>
    <div id="spatialReference">
        <div><h2>SpatialReference (wkid)</h2></div>
        <hr/>
        <div>
            <p>Este &eacute; um par&acirc;metro tempor&aacute;rio de pr&eacute;-lan&ccedil;amento para definir a refer&ecirc;ncia espacial. Muitas ferramentas de big data requerem que o sistema de coordenadas projetado seja utilizado como refer&ecirc;ncia espacial para processamento. Por predefini&ccedil;&atilde;o, a ferramenta utilizar&aacute; o sistema de coordenadas de entrada, mas ir&aacute; falhar no caso de o mesmo se tratar de um sistema de coordenadas geogr&aacute;ficas. Para definir um sistema de coordenadas projetado, introduza o WKID. Por exemplo,  <b>Web Mercator</b> seria introduzido como <code>3857</code>.
            </p>
        </div>
    </div>
    <div id="dataStore">
        <div><h2>Selecionar armazenamento de dados</h2></div>
        <hr/>
        <div>
            <p>Os resultados de GeoAnalytics s&atilde;o armazenados num ArcGIS Data Store e exibidos como uma camada de elementos no  Portal for ArcGIS. Na maioria dos casos, os resultados dever&atilde;o ser armazenados num armazenamento de dados espaciotemporal, sendo este o comportamento predefinido. Em alguns casos, ser&aacute; uma boa op&ccedil;&atilde;o guardar os resultados no armazenamento de dados relacional. As seguintes s&atilde;o raz&otilde;es que justificam o armazenamento de resultados no armazenamento de dados espaciotemporal. 
                <ul>
                    <li>Utilizar resultados em colabora&ccedil;&atilde;o portal to portal.
                    </li>
                    <li>Ativar funcionalidades de sincroniza&ccedil;&atilde;o com os resultados.
                    </li>
                </ul>
                
            </p>
            <p>N&atilde;o dever&aacute; utilizar o armazenamento de dados relacional caso antecipe um aumento dos seus resultados de GeoAnalytics, e caso necessite de tirar partido das funcionalidades de armazenamento de big data para gerir grandes quantidades de dados. 
            </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Nome da camada resultante</h2></div>
        <hr/>
        <div>
            <p> Este &eacute; o nome da camada que ser&aacute; criada em <b>O Meu Conte&uacute;do</b> e adicionada ao mapa. O nome padr&atilde;o &eacute; baseado no nome da ferramenta e do nome da camada de entrada. Caso a camada j&aacute; existe, a ferramenta ir&aacute; falhar.
            </p>
            <p>Ao utilizar a caixa suspensa  <b>Guardar resultado em</b> pode definir o nome da pasta em <b>O Meu Conte&uacute;do</b> onde o resultado ser&aacute; guardado.
            </p>
        </div>
    </div>
</div>
</html>
