<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Calcular Densidade</h2><p/>
        <h2><img src="../images/GUID-38AD3C19-0400-4E5A-9282-BDE42F2BBFC1-web.png" alt="Calcular Densidade"></h2>
        <hr/>
    <p>A ferramenta Calcular Densidade cria um mapa de densidade a partir de elementos de ponto espalhando quantidades conhecidas de determinado fen&oacute;meno (representados como atributos dos pontos) pelo mapa. O resultado &eacute; uma camada de &aacute;reas classificadas da menos densa para a mais densa.   

    </p>
    <p>Para a entrada de ponto, cada ponto deve representar a localiza&ccedil;&atilde;o de algum evento ou incidente, e a camada resultado representa uma contagem do incidente por unidade de &aacute;rea. Um valor de densidade mais elevado numa nova localiza&ccedil;&atilde;o significa que existem mais pontos perto desse local. Em muitos casos, a camada de resultado pode ser interpretada como uma superf&iacute;cie de risco para futuros eventos. Por exemplo, se os pontos de entrada representam locais de queda de rel&acirc;mpagos, a camada resultado pode ser interpretada como uma superf&iacute;cie de risco para quedas de raios futuras.
    </p>
    <p>Outros casos de uso desta ferramenta incluem o seguinte:
        <ul>
            <li>Cria&ccedil;&atilde;o de mapas de densidade de crime para ajudar os departamentos de pol&iacute;cia a alocar adequadamente os recursos a &aacute;reas de alta criminalidade.
            </li>
            <li>Calculando densidades de hospitais dentro de um munic&iacute;pio. A camada resultado mostrar&aacute; as &aacute;reas com acessibilidades alta e baixa para os hospitais, e esta informa&ccedil;&atilde;o pode ser usada para decidir onde o novo deve ser constru&iacute;do.
            </li>
            <li>Identificar &aacute;reas que est&atilde;o em risco elevado de inc&ecirc;ndios florestais com base em locais hist&oacute;ricos de inc&ecirc;ndios florestais.
            </li>
            <li>Localizar as comunidades que est&atilde;o longe de auto-estradas, a fim de planejar onde as novas estradas devem ser constru&iacute;das.
            </li>
        </ul>
        
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputLayer">
        <div><h2>Selecionar uma camada de pontos a partir da qual calcular densidade</h2></div>
        <hr/>
        <div>
            <p>A camada de pontos a partir da qual a densidade ser&aacute; calculada.
            </p>
            <p>In addition to choosing a layer from your map, you can choose  <b>Browse Layers</b> at the bottom of the drop-down list to browse to your contents for a big data file share dataset or feature layer.
            </p>
        </div>
    </div>
    <div id="fields">
        <div><h2>Selecionar um ou mais campos nos quais calcular densidade (opcional)</h2></div>
        <hr/>
        <div>
            <p>Forne&ccedil;a um ou mais campos especificando o n&uacute;mero de incidentes em cada local. Por exemplo, se tem pontos que representam as cidades, pode usar um campo que representa a popula&ccedil;&atilde;o da cidade, como o campo de contagem, e a camada de densidade populacional resultante ir&aacute; calcular as densidades populacionais maiores perto de cidades com popula&ccedil;&otilde;es maiores.
            </p>
            <p>A densidade para a contagem de pontos ser&aacute; sempre calculada.   Caso n&atilde;o sejam selecionados quaisquer campos, assumir-se-&aacute; que cada local representa uma &uacute;nica contagem.
            </p>
        </div>
    </div>
    <div id="binType">
        <div><h2>Selecionar uma forma de caixa</h2></div>
        <hr/>
        <div>
            <p>O formato de caixas &agrave;s quais os pontos est&atilde;o agregados e utilizado para o c&aacute;lculo da densidade.
            </p>
            <p>Analysis using  <b>Square</b> or <b>Hexagon</b> bins requires a projected coordinate system. You can set the <b>Processing coordinate system</b> in <b>Analysis Environments</b>. If your processing coordinate system is not set to a projected coordinate system, you will be prompted to set it when you <b>Run Analysis</b> .
            </p>
        </div>
    </div>
    <div id="binSizing">
        <div><h2>Selecionar o tamanho da caixa para agregação</h2></div>
        <hr/>
        <div>
            <p>O tamanho das caixas geradas. Para uma caixa quadrada, o tamanho representa a altura do quadrado. Para hex&aacute;gono, o tamanho representa a altura do hex&aacute;gono (a partir de lados paralelos).
            </p>
        </div>
    </div>
    <div id="weight">
        <div><h2>Selecionar a ponderaçao de densidade a aplicar</h2></div>
        <hr/>
        <div>
            <p>O tipo de pondera&ccedil;&atilde;o aplicado ao c&aacute;lculo da densidade. Existem duas op&ccedil;&otilde;es:
                <ul>
                    <li> <b>Uniforme</b>&mdash;Calcula uma magnitude por &aacute;rea.
                    </li>
                    <li> <b>Kernel</b>&mdash;Aplica uma fun&ccedil;&atilde;o kernel para fazer corresponder uma superf&iacute;cie homog&eacute;nea c&oacute;nica  a cada ponto.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="neighborhood">
        <div><h2>Selecionar o tamanho do bairro</h2></div>
        <hr/>
        <div>
            <p>O tamanho da &aacute;rea utilizada para calcular densidade. O tamanho da tem de ser superior ao tamanho da caixa.
            </p>
        </div>
    </div>
    <div id="areaUnits">
        <div><h2>Escolher as unidades de saída para densidade</h2></div>
        <hr/>
        <div>
            <p>As unidades de sa&iacute;da pretendidas para os valores de densidade. Por defeito, &eacute; definido para quil&oacute;metros quadrados ou milhas quadradas, com base nas unidades predefinidas especificadas no seu perfil. Caso os valores de densidade sejam muito reduzidos, pode aumentar o tamanho das unidades de &aacute;rea (por exemplo, de metros quadrados para quil&oacute;metros quadrados) para devolver valores mais elevados. Os valores apenas representam o resultado em escala.  

            </p>
        </div>
    </div>
    <div id="timeSlicing">
        <div><h2>Calcular densidade utilizando etapas temporais (opcional)</h2></div>
        <hr/>
        <div>
            <p>If time is enabled on the input point layer and it is of type instant, you can  analyze using time stepping.  There are three parameters you can set when you use time:
                <ul>
                    <li> <b>Time step interval</b>
                    </li>
                    <li> <b>How often to repeat the time step</b>
                    </li>
                    <li> <b>Time to align the time steps to</b>
                    </li>
                </ul>
                
            </p>
            <p>For example, if you have data that represents a year in time and you want to analyze it using weekly steps, set  <b>Time step interval</b> to <code>1 week</code>. 
            </p>
            <p>For example, if you have data that represents a year in time and you want to analyze it using the first week of the month, set  <b>Time step interval</b> to <code>1 week</code>, <b>How often to repeat the time step</b> to <code>1 month</code>, and <b>Time to align the time steps to</b> to <code>January 1, at 12:00 am</code>.
            </p>
        </div>
    </div>
    <div id="timeInterval">
        <div><h2>Intervalo entre etapas temporais</h2></div>
        <hr/>
        <div>
            <p>The interval of time used for generating time steps.  <b>Time step interval</b> can be used alone or with the <b>How often to repeat the time step</b> or <b>Time to align the time steps to</b> parameter.
            </p>
            <p>For example, if you want to create time steps that take place every Monday from 9:00 a.m. until 10:00 a.m., set  <b>Time step interval</b> to <code>1 hour</code>, <b>How often to repeat the time step</b> to <code>1 week</code>, and <b>Time to align the time steps to</b> to <code>9:00:00 a.m. on a Monday</code>.
            </p>
        </div>
    </div>
    <div id="timeStep">
        <div><h2>Frequência de repetição da etapa temporal</h2></div>
        <hr/>
        <div>
            <p> The step used for calculating a time step. <b>How often to repeat the time step</b> can be used alone, with <b>Time step interval</b>, with <b>Reference Time</b>, or with both <b>Time step interval</b> and <b>Time to align the time steps to</b>.
            </p>
            <p> For example, if you want to create time steps that take place every Monday from 9:00 a.m. until 10:00 a.m., set <b>Time step interval</b> to <code>1 hour</code>, <b>How often to repeat the time step</b> to <code>1 week</code>, and <b>Time to align the time steps to</b> to <code>9:00:00 a.m. on a Monday</code>.
            </p>
        </div>
    </div>
    <div id="timeReference">
        <div><h2>Hora à qual alinhar as etapas temporais</h2></div>
        <hr/>
        <div>
            <p>The date and time used to align time slicing. Time stepping will start at and continue backward from this time. If no reference time is selected, time stepping will align to January 1st, 1970. 
            </p>
            <p> For example, if you want to create time steps that take place every Monday from 9:00 a.m. until 10:00 a.m., set <b>Time step interval</b> to <code>1 hour</code>, <b>How often to repeat the time step</b> to <code>1 week</code>, and <b>Time to align the time steps to</b> to <code>9:00:00 a.m. on a Monday</code>.
            </p>
        </div>
    </div>
    <div id="spatialReference">
        <div><h2>SpatialReference (wkid)</h2></div>
        <hr/>
        <div>
            <p>This is a temporary parameter for prerelease  to set the processing spatial reference. Many big data tools require that a projected coordinate system is used as the spatial reference for processing. By default, the tool will use the input coordinate system but will fail if it's a geographic coordinate system. To set a projected coordinate system, enter the WKID. For example,  <b>Web Mercator</b> would be entered as <code>3857</code>.
            </p>
        </div>
    </div>
    <div id="dataStore">
        <div><h2>Selecionar armazenamento de dados</h2></div>
        <hr/>
        <div>
            <p>GeoAnalytics results are stored to an ArcGIS Data Store and exposed as a feature layer in   Portal for ArcGIS. In most cases, results should be stored to the spatiotemporal data store and this is the default. In some cases, saving results to the  relational data store is a good option. The following are reasons why you may want to store results to the relational data store: 
                <ul>
                    <li>You can use results in portal-to-portal collaboration.
                    </li>
                    <li>You can enable sync capabilities with your results.
                    </li>
                </ul>
                
            </p>
            <p>You should not use the relational data store if you expect your GeoAnalytics results to increase and need to take advantage of the spatiotemporal big data store's capabilities to handle large amounts of data.
            </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Nome da camada resultante</h2></div>
        <hr/>
        <div>
            <p> The name of the layer that will be created in <b>My
Content</b> and added to the map. The default name is based on the
tool name and the input layer name. If the layer already exists, the tool will fail.
            </p>
            <p>Using the  <b>Save result in</b> drop-down box, you can specify
the name of a folder in <b>My Content</b> where the result will be
saved.
            </p>
        </div>
    </div>
</div>
</html>
