<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Gerar Anomalia Multidimensional</h2><p/>
        <h2><img src="../images/GUID-8D54C66F-5C16-4EE5-93E9-80722D10AF12-web.png" alt="Gerar Anomalia Multidimensional"></h2>
        <hr/>
    <p>Calcula a anomalia para cada sec&ccedil;&atilde;o num raster multidimensional existente para gerar um novo raster multidimensional.
    </p>
    <p>Uma anomalia &eacute; um desvio de uma observa&ccedil;&atilde;o do seu valor padr&atilde;o, m&eacute;dio ou mediano.
    </p>
    <p>Esta ferramenta calcula anomalias ao longo do tempo para uma ou mais vari&aacute;veis num raster multidimensional. Se tiver uma dimens&atilde;o sem componente temporal para alem de uma dimens&atilde;o de tempo, a anomalia ser&aacute; calculada em cada passo na dimens&atilde;o adicional.
    </p>
    <p>Por exemplo, disp&otilde;e de dados da temperatura oce&acirc;nica mensais, recolhidos a cada metro de profundidade at&eacute; aos 100 metros e pretende calcular as anomalias de temperatura como desvios a partir da m&eacute;dia anual. Esta ferramenta determinar&aacute; as anomalias de temperatura com base na m&eacute;dia anual se definir  <b>Anual</b> como o <b>intervalo temporal para calcular a m&eacute;dia</b>, e devolver&aacute; os valores das anomalias para cada 100 profundidades.
    </p>
    <p>Esta ferramenta s&oacute; suporta conjuntos de dados raster multidimensional que tenham uma dimens&atilde;o de tempo.
    </p>
    <p>Se a op&ccedil;&atilde;o  <b>Utilizar a extens&atilde;o do mapa atual</b> estiver assinalada, ser&atilde;o analisadas as vari&aacute;veis da camada que se encontrem vis&iacute;veis na extens&atilde;o do mapa atual. Se estiver desmarcada, ser&atilde;o analisadas as vari&aacute;veis de toda a camada, mesmo que estejam fora da extens&atilde;o do mapa atual.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputMultidimensionalRaster">
        <div><h2>Escolher uma camada de imagem multidimensional para gerar uma anomalia</h2></div>
        <hr/>
        <div>
            <p>A camada de imagem de entrada de um conjunto de dados raster multidimensional.
            </p>
        </div>
    </div>
    <div id="variables">
        <div><h2>Escolher variáveis para as quais as anomalias serão geradas</h2></div>
        <hr/>
        <div>
            <p>A vari&aacute;vel ou vari&aacute;veis para as quais as anomalias ser&atilde;o calculadas. Se n&atilde;o for especificada uma vari&aacute;vel, todas as vari&aacute;veis com uma dimens&atilde;o de tempo ser&atilde;o analisadas.
            </p>
        </div>
    </div>
    <div id="method">
        <div><h2>Escolher método para gerar anomalia</h2></div>
        <hr/>
        <div>
            <p>Especifica o m&eacute;todo que ser&aacute; utilizado para calcular a anomalia.
                <ul>
                    <li> <b>Diferen&ccedil;a da M&eacute;dia</b> &mdash; Ser&aacute; calculada a diferen&ccedil;a entre o valor de um p&iacute;xel e a m&eacute;dia do valor desse p&iacute;xel em v&aacute;rias sec&ccedil;&otilde;es definidas pelo intervalo. Isto &eacute; por omiss&atilde;o.
                    </li>
                    <li> <b>Diferen&ccedil;a de Percentagem da M&eacute;dia</b> &mdash; Ser&aacute; calculada a diferen&ccedil;a de percentagem entre o valor de um p&iacute;xel e a m&eacute;dia do valor desse p&iacute;xel em v&aacute;rias sec&ccedil;&otilde;es definidas pelo intervalo.
                    </li>
                    <li> <b>Percentagem da M&eacute;dia</b> &mdash; Ser&aacute; calculada a percentagem da m&eacute;dia.
                    </li>
                    <li> <b>Pontua&ccedil;&atilde;o Z</b> &mdash; Ser&aacute; calculada a pontua&ccedil;&atilde;o Z para cada p&iacute;xel. Uma pontua&ccedil;&atilde;o Z de 0 indica que o valor do p&iacute;xel &eacute; id&ecirc;ntico &agrave; m&eacute;dia. Uma pontua&ccedil;&atilde;o Z de 1 indica que o valor do p&iacute;xel &eacute; 1 desvio padr&atilde;o da m&eacute;dia. Se uma pontua&ccedil;&atilde;o Z for 2, o valor do p&iacute;xel &eacute; 2 desvios padr&atilde;o da m&eacute;dia e assim por diante.
                    </li>
                    <li> <b>Diferen&ccedil;a da Mediana</b> &mdash; Ser&aacute; calculada a diferen&ccedil;a entre o valor de um p&iacute;xel e a mediana matem&aacute;tica do valor desse p&iacute;xel em v&aacute;rias sec&ccedil;&otilde;es definidas pelo intervalo.
                    </li>
                    <li> <b>Diferen&ccedil;a de Percentagem da Mediana</b> &mdash; Ser&aacute; calculada a diferen&ccedil;a de percentagem entre o valor de um p&iacute;xel e a mediana matem&aacute;tica do valor desse p&iacute;xel em v&aacute;rias sec&ccedil;&otilde;es definidas pelo intervalo.
                    </li>
                    <li> <b>Percentagem da Mediana</b> &mdash; Ser&aacute; calculada a percentagem da mediana matem&aacute;tica.
                    </li>
                </ul>
                
            </p>
            <p>Os m&eacute;todos matem&aacute;ticos para o c&aacute;lculo de valores de anomalias s&atilde;o apresentados em baixo. As anomalias podem ser calculadas utilizando os valor m&eacute;dios ou medianos como a defini&ccedil;&atilde;o da m&eacute;dia. Se a distribui&ccedil;&atilde;o de dados n&atilde;o for linear, a m&eacute;dia pode ser altamente influenciada por valores at&iacute;picos, pelo que &eacute; poss&iacute;vel que o valor mediano ou o m&eacute;todo de pontua&ccedil;&atilde;o z seja mais adequado para este tipo de dados.
            </p>
            <p>
                <ul>
                    <li>Diferen&ccedil;a da m&eacute;dia = x - &micro;
                        <ul>
                            <li>x = valor do p&iacute;xel numa sec&ccedil;&atilde;o
                                

                            </li>
                            <li>&szlig; = m&eacute;dia do valor desse p&iacute;xel sobre o intervalo de tempo determinado
                                

                            </li>
                        </ul>
                        
                        

                    </li>
                    <li>Diferen&ccedil;a de percentagem da m&eacute;dia = |x - &micro;| / [(x + &micro;)/2]
                        <ul>
                            <li>x = valor do p&iacute;xel numa sec&ccedil;&atilde;o
                                

                            </li>
                            <li>&szlig; = m&eacute;dia do valor desse p&iacute;xel sobre o intervalo de tempo determinado
                                

                            </li>
                            <li>|x - &micro;| = valor absoluto da diferen&ccedil;a entre o valor e a m&eacute;dia
                                

                            </li>
                        </ul>
                        
                        

                    </li>
                    <li>Diferen&ccedil;a da m&eacute;dia = x / &micro;
                        <ul>
                            <li>x = valor do p&iacute;xel numa sec&ccedil;&atilde;o
                                

                            </li>
                            <li>&szlig; = m&eacute;dia do valor desse p&iacute;xel sobre o intervalo de tempo determinado
                                

                            </li>
                        </ul>
                        
                    </li>
                    <li>Diferen&ccedil;a da mediana = x - &szlig;
                        <ul>
                            <li>x = valor do p&iacute;xel numa sec&ccedil;&atilde;o
                            </li>
                            <li>&szlig; = mediana do valor desse p&iacute;xel sobre o intervalo de tempo determinado
                            </li>
                        </ul>
                        
                    </li>
                    <li>Diferen&ccedil;a de percentagem da mediana = |x - &szlig;| / [(x + &szlig;)/2]
                        <ul>
                            <li>x = valor do p&iacute;xel numa sec&ccedil;&atilde;o
                            </li>
                            <li>&szlig; = mediana do valor desse p&iacute;xel sobre o intervalo de tempo determinado
                            </li>
                            <li>|x - &szlig;| = valor absoluto da diferen&ccedil;a entre o valor e a mediana
                            </li>
                        </ul>
                        
                    </li>
                    <li>Percentagem da mediana = x / &szlig;
                        <ul>
                            <li>x = valor do p&iacute;xel numa sec&ccedil;&atilde;o
                            </li>
                            <li>&szlig; = mediana do valor desse p&iacute;xel sobre o intervalo de tempo determinado
                            </li>
                        </ul>
                        
                    </li>
                    <li>Pontua&ccedil;&atilde;o Z = (x - &micro;) / S
                        <ul>
                            <li>x = valor do p&iacute;xel numa sec&ccedil;&atilde;o
                            </li>
                            <li>&szlig; = m&eacute;dia do valor desse p&iacute;xel sobre o intervalo de tempo determinado
                            </li>
                            <li>S = desvio padr&atilde;o do valor do p&iacute;xel sobre o intervalo de tempo determinado
                            </li>
                        </ul>
                        
                        

                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="calculationInterval">
        <div><h2>Escolher o intervalo temporal para calcular a média</h2></div>
        <hr/>
        <div>
            <p>Especifica o intervalo temporal que ser&aacute; utilizado para calcular a m&eacute;dia.
                <ul>
                    <li> <b>Todos</b> &mdash; Calcula a m&eacute;dia em todas as sec&ccedil;&otilde;es para cada p&iacute;xel.
                    </li>
                    <li> <b>Anualmente</b> &mdash; Calcula a m&eacute;dia anual para cada p&iacute;xel.
                    </li>
                    <li> <b>Mensalmente Recorrente</b> &mdash; Calcula a m&eacute;dia mensal para cada p&iacute;xel.
                    </li>
                    <li> <b>Semanalmente Recorrente</b> &mdash; Calcula a m&eacute;dia semanal para cada p&iacute;xel.
                    </li>
                    <li> <b>Diariamente Recorrente</b> &mdash; Calcula a m&eacute;dia di&aacute;ria para cada p&iacute;xel.
                    </li>
                    <li> <b>De hora a hora</b> &mdash; Calcula a m&eacute;dia hor&aacute;ria para cada p&iacute;xel.
                    </li>
                    <li> <b>Raster Externo</b> &mdash; Um conjunto de dados raster existente que cont&eacute;m o valor m&eacute;dio ou mediano de cada p&iacute;xel &eacute; referenciado.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="referenceMeanRaster">
        <div><h2>Escolher a camada de imagens da média como referência</h2></div>
        <hr/>
        <div>
            <p>Especifica o conjunto de dados raster de refer&ecirc;ncia que cont&eacute;m uma m&eacute;dia previamente calculada para cada p&iacute;xel. As anomalias ser&atilde;o calculadas em compara&ccedil;&atilde;o com esta m&eacute;dia.
            </p>
        </div>
    </div>
    <div id="ignoreNodata">
        <div><h2>Ignorar valores em falta no cálculo</h2></div>
        <hr/>
        <div>
            <p>Especifica se os valores em falta s&atilde;o ou n&atilde;o ignorados na an&aacute;lise.
                <ul>
                    <li>Assinalado &mdash; A an&aacute;lise ir&aacute; incluir todos os p&iacute;xeis v&aacute;lidos ao longo de uma determinada dimens&atilde;o e ignorar quaisquer p&iacute;xeis NoData. Isto &eacute; por omiss&atilde;o.
                    </li>
                    <li>Desmarcado &mdash; A an&aacute;lise resultar&aacute; em NoData se existirem valores NoData para os p&iacute;xeis ao longo de uma determinada dimens&atilde;o.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Nome da camada resultante</h2></div>
        <hr/>
        <div>
            
            <p>O nome da camada que ser&aacute; criada em  <b>O Meu Conte&uacute;do</b> e adicionada ao mapa. O nome padr&atilde;o &eacute; baseado no nome da ferramenta e do nome da camada de entrada. Se a camada j&aacute; existir, ser-lhe-&aacute; pedido que introduza outro nome.
            </p>
            <p>&Eacute; poss&iacute;vel especificar o nome de uma pasta em  <b>O Meu Conte&uacute;do</b>, onde o resultado ser&aacute; guardado utilizando a op&ccedil;&atilde;o <b>Guardar Resultado em</b> da caixa suspensa. Se tiver os privilégios para criar camadas de imagens em mosaico e dinâmicas, pode especificar o tipo de camada que será gerado na saída utilizando a caixa pendente Guardar resultado como. </p>
        </div>
    </div>
</div>
</html>
