<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Amostra</h2><p/>
        <h2><img src="../images/GUID-3950CCA3-C1D0-493F-A33D-93673443ADD2-web.png" alt="Amostra"></h2>
        <hr/>
    <p>Esta ferramenta cria uma tabela ou uma classe de elementos de pontos que mostra os valores das c&eacute;lulas a partir de um raster, ou conjunto de rasters, para localiza&ccedil;&otilde;es definidas. As localiza&ccedil;&otilde;es s&atilde;o definidas por c&eacute;lulas raster, elementos de pol&iacute;gono, elementos polilinha, ou por um conjunto de pontos.
    </p>
    <p>Alguns exemplos de aplica&ccedil;&otilde;es desta ferramenta incluem:
        <ul>
            <li> Extraia atributos para localiza&ccedil;&atilde;o de torre de transmiss&atilde;o a partir de v&aacute;rios rasters, como uso do solo, tipo de solo, eleva&ccedil;&atilde;o e dist&acirc;ncia at&eacute; &agrave; estrada.
            </li>
            <li>Extraia a temperatura do solo a diferentes profundidades para um determinado conjunto de pontos.
            </li>
            <li>A partir de 30 anos de dados mensais de temperatura da superf&iacute;cie do mar, resuma em localiza&ccedil;&otilde;es de animais ou dentro de territ&oacute;rios para um determinado momento quando uma esp&eacute;cie animal foi observada.
            </li>
        </ul>
        
    </p>
    <p>Se a op&ccedil;&atilde;o  <b>Utilizar a extens&atilde;o do mapa atual</b> estiver marcada, ser&atilde;o analisadas as vari&aacute;veis ou bandas da camada que se encontrem vis&iacute;veis na extens&atilde;o do mapa atual. Se estiver desmarcada, ser&atilde;o analisadas as vari&aacute;veis ou bandas de toda a camada, mesmo que estejam fora da extens&atilde;o do mapa atual.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inRasters">
        <div><h2>Escolher as camadas</h2></div>
        <hr/>
        <div>
            <p>Uma imagem &uacute;nica ou uma lista de imagens, cujos valores ser&atilde;o amostrados com base nos dados de localiza&ccedil;&atilde;o de entrada. 
            </p>
            <p>Para amostrar todas as sec&ccedil;&otilde;es de uma camada de imagens multidimensionais, esta deve ser o &uacute;nico raster de entrada.
            </p>
        </div>
    </div>
    <div id="inLocationData">
        <div><h2>Escolher camada de localização</h2></div>
        <hr/>
        <div>
            <p>Dados de identifica&ccedil;&atilde;o das posi&ccedil;&otilde;es que pretende amostrar
            </p>
            <p>Os dados da localiza&ccedil;&atilde;o de entrada podem ser um raster ou um ponto, uma polilinha ou uma classe de elementos de pol&iacute;gono.
            </p>
        </div>
    </div>
    <div id="uniqueIdField">
        <div><h2>Especificar campo de ID nico</h2></div>
        <hr/>
        <div>
            <p>Um campo que cont&eacute;m um valor diferente para cada localiza&ccedil;&atilde;o ou no raster de localiza&ccedil;&atilde;o de entrada ou classe de elementos.
            </p>
        </div>
    </div>
    <div id="acquisitionDefinition">
        <div><h2>Especificar as informações de aquisição de dados de localização (Opcional)</h2></div>
        <hr/>
        <div>
            <p>Especificar o tempo, profundidade, ou outros dados de aquisi&ccedil;&atilde;o associados com as c&eacute;lulas de localiza&ccedil;&atilde;o ou elementos.
            </p>
            <p>Para cada dimens&atilde;o, existem tr&ecirc;s op&ccedil;&otilde;es para especificar as informa&ccedil;&otilde;es de aquisi&ccedil;&atilde;o associado com c&eacute;lulas de localiza&ccedil;&atilde;o ou elementos:
            </p>
            <ul>
                <li> <b>Campo &uacute;nico ou valor</b> &mdash; Quando esta op&ccedil;&atilde;o for selecionada, as seguintes informa&ccedil;&otilde;es t&ecirc;m de ser especificadas:
                    <ul>
                        <li> <b>Campo ou valor de dimens&atilde;o</b> &mdash; Selecione um campo de valores de dimens&atilde;o a partir dos dados de localiza&ccedil;&atilde;o ou introduza um valor de dimens&atilde;o espec&iacute;fico.
                        </li>
                    </ul>
                    
                    

                </li>
                <li> <b>Campo ou valor &uacute;nico com valores relativos</b> &mdash; Se esta op&ccedil;&atilde;o for selecionada, as informa&ccedil;&otilde;es abaixo t&ecirc;m de ser especificadas em conjunto para definir o intervalo dentro do qual ser&atilde;o calculadas as estat&iacute;sticas para as vari&aacute;veis:
                    <ul>
                        <li> <b>Campo ou valor de dimens&atilde;o</b> &mdash; Selecione um campo de valores de dimens&atilde;o a partir dos dados de localiza&ccedil;&atilde;o.
                        </li>
                        <li> <b>Valor relativo antes</b> &mdash; Especifique um n&uacute;mero n&atilde;o negativo utilizado para subtrair do <b>Campo ou valor de dimens&atilde;o</b> para definir o in&iacute;cio de um intervalo de valores de dimens&atilde;o. Este valor representa o n&uacute;mero de dias se a dimens&atilde;o for tempo.
                        </li>
                        <li> <b>Valor relativo depois</b> &mdash; Especifique um n&uacute;mero n&atilde;o negativo utilizado para subtrair do <b>Campo ou valor de dimens&atilde;o</b> para definir o fim de um intervalo de valores de dimens&atilde;o. Este valor representa o n&uacute;mero de dias se a dimens&atilde;o for tempo.
                        </li>
                    </ul>
                    
                </li>
                <li> <b>Campos ou valores de in&iacute;cio e fim</b> &mdash; Se esta op&ccedil;&atilde;o for selecionada, as informa&ccedil;&otilde;es abaixo t&ecirc;m de ser especificadas em conjunto para definir o intervalo dentro do qual ser&atilde;o calculadas as estat&iacute;sticas para as vari&aacute;veis:
                    <ul>
                        <li> <b>Campo ou valores de in&iacute;cio</b> &mdash; Selecione um campo de valores de dimens&atilde;o a partir dos dados de localiza&ccedil;&atilde;o ou introduza um valor de dimens&atilde;o espec&iacute;fico para definir o in&iacute;cio de um intervalo de valores de dimens&atilde;o.
                        </li>
                        <li> <b>Campo ou valores de fim</b> &mdash; Selecione um campo de valores de dimens&atilde;o a partir dos dados de localiza&ccedil;&atilde;o ou introduza um valor de dimens&atilde;o espec&iacute;fico para definir o fim de um intervalo de valores de dimens&atilde;o.
                        </li>
                    </ul>
                    
                    

                </li>
            </ul>
            
            <p>Este par&acirc;metro s&oacute; estar&aacute; dispon&iacute;vel quando o par&acirc;metro  <b>Escolher camada(s) de imagem a amostrar</b> for um raster multidimensional.
            </p>
        </div>
    </div>
    <div id="bufferDistance">
        <div><h2>Especificar distância de campo ou valor do buffer</h2></div>
        <hr/>
        <div>
            <p>A dist&acirc;ncia especificada em torno dos elementos dos dados de localiza&ccedil;&atilde;o. A dist&acirc;ncia do buffer &eacute; especificada em unidades lineares de refer&ecirc;ncia espacial dos elementos de localiza&ccedil;&atilde;o. Se o elemento usar uma refer&ecirc;ncia geogr&aacute;fica, a unidade ser&aacute; graus.
            </p>
            <p>As estat&iacute;sticas ser&atilde;o calculadas dentro desta &aacute;rea de buffer.
            </p>
            <p>Este par&acirc;metro s&oacute; estar&aacute; dispon&iacute;vel quando  <b>Escolher camada(s) de imagem a amostrar</b> for um raster multidimensional.
            </p>
        </div>
    </div>
    <div id="statisticsType">
        <div><h2>Escolher tipo de estatística</h2></div>
        <hr/>
        <div>
            <p>O tipo de estat&iacute;stica a calcular.
            </p>
            <ul>
                <li> <b>M&iacute;nimo</b> &mdash; Encontra o valor m&iacute;nimo dentro do intervalo especificado.
                </li>
                <li> <b>M&aacute;ximo</b> &mdash; Encontra o valor m&aacute;ximo dentro do intervalo especificado.
                </li>
                <li> <b>Mediana</b> &mdash; Encontra o valor mediano dentro do intervalo especificado.
                </li>
                <li> <b>M&eacute;dia</b> &mdash; Calcula a m&eacute;dia para o intervalo especificado.
                </li>
                <li> <b>Soma</b> &mdash; Calcula a soma das vari&aacute;veis dentro do intervalo especificado.
                </li>
                <li> <b>Maioria</b> &mdash; Encontra o valor que ocorre com mais frequ&ecirc;ncia.
                </li>
                <li> <b>Minoria</b> &mdash; Encontra o valor que ocorre com menos frequ&ecirc;ncia.
                </li>
                <li> <b>Desvio Padr&atilde;o</b> &mdash; Calcula o desvio padr&atilde;o.
                </li>
                <li> <b>Percentil</b> &mdash; Calcula o percentil definido dentro do intervalo especificado.
                </li>
            </ul>
            
            <p>Este par&acirc;metro s&oacute; estar&aacute; dispon&iacute;vel quando o par&acirc;metro  <b>Escolher camada(s) de imagem a amostrar</b> for um raster multidimensional e os par&acirc;metros <b>Escolher camada de localiza&ccedil;&atilde;o</b> forem polilinhas ou pol&iacute;gonos ou <b>Especificar campo ou valor de dist&acirc;ncia do buffer (Opcional)</b> for especificado.
            </p>
        </div>
    </div>
    <div id="percentileValue">
        <div><h2>Valor de percentil</h2></div>
        <hr/>
        <div>
            <p>Este valor pode variar entre 0 e 100. O padr&atilde;o &eacute; 90.
            </p>
            <p>Este par&acirc;metro s&oacute; estar&aacute; dispon&iacute;vel quando o par&acirc;metro  <b>Escolher tipo de estat&iacute;stica</b> estiver definido como <b>Percentil</b>.
            </p>
        </div>
    </div>
    <div id="resamplingType">
        <div><h2>Especificar a técnica de reamostragem</h2></div>
        <hr/>
        <div>
            <p>O algoritmo de reamostragem usado na amostragem de um raster.
            </p>
            <ul>
                <li> <b>Mais pr&oacute;ximo</b> &mdash; Vizinho mais pr&oacute;ximo que utiliza o valor da c&eacute;lula mais pr&oacute;xima para atribuir um valor &agrave; c&eacute;lula de sa&iacute;da durante a reamostragem. Isto &eacute; por omiss&atilde;o.
                </li>
                <li> <b>Bilinear</b> &mdash; Interpola&ccedil;&atilde;o bilinear que determina o novo valor de uma c&eacute;lula com base numa m&eacute;dia de dist&acirc;ncia ponderada dos quatro centros de c&eacute;lulas de entrada mais pr&oacute;ximos.
                </li>
                <li> <b>C&uacute;bica</b> &mdash; Convolu&ccedil;&atilde;o c&uacute;bica que determina o novo valor de uma c&eacute;lula com base na instala&ccedil;&atilde;o de uma curva suave atrav&eacute;s dos 16 centros de c&eacute;lulas de entrada mais pr&oacute;ximos.
                </li>
            </ul>
            
        </div>
    </div>
    <div id="layout">
        <div><h2>Especificar o layout de saída</h2></div>
        <hr/>
        <div>
            <p>Especifica se os valores amostrados aparecem em linhas ou colunas na tabela de sa&iacute;da.
            </p>
            <ul>
                <li> <b>Os valores amostrados aparecem em linha</b> &mdash; Os valores amostrados aparecem em linhas separadas na tabela de sa&iacute;da. Isto &eacute; por omiss&atilde;o.
                </li>
                <li> <b>Os valores amostrados aparecem em coluna</b> &mdash; Os valores amostrados aparecem em colunas na tabela de sa&iacute;da.
                </li>
            </ul>
            
            <p>Este par&acirc;metro s&oacute; estar&aacute; dispon&iacute;vel quando o par&acirc;metro  <b>Escolher camada(s) de imagem a amostrar</b> for um raster multidimensional e tiver uma vari&aacute;vel e uma dimens&atilde;o e cada sec&ccedil;&atilde;o for um raster de banda &uacute;nica.
            </p>
        </div>
    </div>
    <div id="outputType">
        <div><h2>Especificar tipo de saída</h2></div>
        <hr/>
        <div>
            <p>Especifica se deve gerar uma classe de elementos de pontos com valores amostrados na sua tabela, ou apenas uma tabela com valores amostrados.
            </p>
            <ul>
                <li> <b>Tabela</b> &mdash; Gerar uma tabela com valores amostrados. Isto &eacute; por omiss&atilde;o.
                </li>
                <li> <b>Elementos</b> &mdash; Gerar uma classe de elementos de pontos com valores amostrados na sua tabela. Se os par&acirc;metros <b>Escolher camada de localiza&ccedil;&atilde;o</b> forem polilinhas ou pol&iacute;gonos, cada ponto na sa&iacute;da &eacute; o centr&oacute;ide de cada geometria dos elementos de localiza&ccedil;&atilde;o de entrada. 
                </li>
            </ul>
            
        </div>
    </div>
    <div id="outputName">
        <div><h2>Nome da camada resultante</h2></div>
        <hr/>
        <div>
            
            <p>O nome da camada que ser&aacute; criada em  <b>O Meu Conte&uacute;do</b> e adicionada ao mapa. O nome padr&atilde;o &eacute; baseado no nome da ferramenta e do nome da camada de entrada. Se a camada j&aacute; existir, ser-lhe-&aacute; pedido que introduza outro nome.
            </p>
            <p>&Eacute; poss&iacute;vel especificar o nome de uma pasta em  <b>O Meu Conte&uacute;do</b>, onde o resultado ser&aacute; guardado utilizando a op&ccedil;&atilde;o <b>Guardar Resultado em</b> da caixa suspensa.
            </p>
        </div>
    </div>
</div>
</html>
