<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="raToolbox">
        <p>Rastrov&aacute; anal&yacute;za v&aacute;m umožňuje prov&aacute;dět anal&yacute;zu velk&yacute;ch rastrov&yacute;ch datov&yacute;ch sad pomoc&iacute;  ArcGIS Image Server. Můžete tak d&iacute;ky využit&iacute; v&yacute;konu serveru analyzovat v&iacute;ce dat rychleji.Sady n&aacute;strojů aktu&aacute;lně dostupn&eacute; přes webovou uživatelskou službu Portal for ArcGIS jsou  <b>Shrnout data</b>, <b>Anal&yacute;za prostorov&eacute;ho uspoř&aacute;d&aacute;n&iacute;</b>, <b>Použ&iacute;t bl&iacute;zkost</b>, <b>Analyzovat sn&iacute;mek</b>, <b>Analyzovat ter&eacute;n</b>, <b>Spravovat data</b>, <b>Deep Learning</b> a <b>V&iacute;cerozměrn&aacute; anal&yacute;za</b>.
        </p>
    </div>
    <div id="SummarizeDataCategory" class="regularsize">
        <h2>Shrnout data</h2>
        <hr/>
        <p>Tyto n&aacute;stroje se použ&iacute;vaj&iacute; pro v&yacute;počet statistik pro rastrovou vrstvu uvnitř v&aacute;mi definovan&yacute;ch hranic oblast&iacute; (z&oacute;n).
            <ul>
                <li>N&aacute;stroj  <b>Sumarizace hodnot uvnitř rastru (Summarize Raster Within)</b> vypoč&iacute;t&aacute; statistiku pro rastrov&eacute; buňky, kter&eacute; lež&iacute; uvnitř definovan&yacute;ch hranic oblasti.
                </li>
                <li>N&aacute;stroj  <b>Z&oacute;n&aacute;ln&iacute; statistika jako tabulka (Zonal Statistics as Table)</b> shrne hodnoty rastru v&nbsp;z&oacute;n&aacute;ch jin&eacute; datov&eacute; sady a&nbsp;v&yacute;sledky ulož&iacute; do tabulky.
                </li>
            </ul>
            
        </p>
    </div>
        <div id="SummarizeRasterWithinTool" class="regularsize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Sumarizace hodnot uvnitř rastru (Summarize Raster Within)</h2></td>
                    <td>
                    <img src="../images/GUID-D61C156C-2B2C-488C-BF28-B6CB9277BF4B-web.png" class="titleImage" alt="N&aacute;stroj Sumarizace hodnot uvnitř rastru">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>Tento n&aacute;stroj shrne hodnoty rastru uvnitř z&oacute;n jin&eacute; datov&eacute; sady.
            </p>
            <br/>
        </div>
        <div id="ZonalStatisticsAsTableTool" class="regularsize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Zónální statistika jako tabulka (Zonal Statistics as Table)</h2></td>
                    <td>
                    <img src="../images/GUID-2847466F-BF22-4545-BDCE-7EB7B1D15F2D-web.png" class="titleImage" alt="Z&oacute;n&aacute;ln&iacute; statistika jako tabulkov&yacute; diagram">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>Tento n&aacute;stroj shrne hodnoty rastru v&nbsp;z&oacute;n&aacute;ch jin&eacute; datov&eacute; sady a&nbsp;v&yacute;sledky převede do tabulky.
            </p>
            <br/>
        </div>
    <div id="AnalyzePatternsCategory" class="regularsize">
        <h2>Analyzovat vzorce</h2>
        <hr/>
        <p>Tyto n&aacute;stroje v&aacute;m pom&aacute;haj&iacute; odhalit, kvantifikovat a vizualizovat prostorov&eacute; souvislosti v&nbsp;datech. 

            <ul>
                <li>N&aacute;stroj  <b>Vypoč&iacute;tat hustotu</b> vytv&aacute;ř&iacute; mapu hustoty ze zn&aacute;m&yacute;ch množstv&iacute; určit&eacute;ho jevu rozprostřen&iacute;m těchto množstv&iacute; po mapě.
                    

                </li>
                <li>N&aacute;stroj  <b>Interpolovat body</b> předpov&iacute;d&aacute; hodnoty v&nbsp;nov&yacute;ch um&iacute;stěn&iacute;ch na z&aacute;kladě hodnot sady vstupn&iacute;ch bodů.
                    

                </li>
            </ul>
            
        </p>
    </div>
        <div id="CalculateDensityRasterTool" class="regularsize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Vypočítat hustotu (Calculate Density)</h2></td>
                    <td>
                    <img src="../images/GUID-4EE4838C-E210-43CE-99C7-1A648A18C10B-web.png" class="titleImage" alt="N&aacute;stroj Vypoč&iacute;tat hustotu">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>Anal&yacute;za hustoty vytv&aacute;ř&iacute; mapu hustoty ze zn&aacute;m&yacute;ch množstv&iacute; určit&eacute;ho jevu rozprostřen&iacute;m těchto množstv&iacute; po mapě. Pomoc&iacute; tohoto n&aacute;stroje můžete např&iacute;klad zobrazit koncentrace &uacute;derů blesků nebo torn&aacute;d, dostupnost l&eacute;kařsk&yacute;ch zař&iacute;zen&iacute; a hustotu populace.
            </p>
            <br/>
        </div>
        <div id="InterpolatePointsEBKTool" class="largesize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Interpolovat body (Interpolate Points)</h2></td>
                    <td>
                    <img src="../images/GUID-06D80BB3-7154-4FAA-9C9B-D665450EF3BC-web.png" class="titleImage" alt="N&aacute;stroj Interpolovat body">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>Tento n&aacute;stroj v&aacute;m umožňuje odhadovat hodnoty v&nbsp;nov&yacute;ch um&iacute;stěn&iacute;ch na z&aacute;kladě hodnot existuj&iacute;c&iacute;ch bodů. N&aacute;stroj poč&iacute;t&aacute; s&nbsp;hodnotami v&scaron;ech zn&aacute;m&yacute;ch bodů a vytv&aacute;ř&iacute; nov&eacute; plochy klasifikovan&eacute; podle předpov&iacute;dan&yacute;ch hodnot. Pomoc&iacute; tohoto n&aacute;stroje můžete např&iacute;klad předpov&iacute;dat &uacute;roveň sr&aacute;žek v&nbsp;r&aacute;mci cel&eacute;ho povod&iacute; na z&aacute;kladě v&yacute;sledků měřen&iacute; z&iacute;skan&yacute;ch z&nbsp;jednotliv&yacute;ch př&iacute;strojů pro měřen&iacute; sr&aacute;žek.
            </p>
            <br/>
        </div>
    <div id="UseProximityCategory" class="largesize">
        <h2>Obalové zóny, vzdálenost</h2>
        <hr/>
        <p>Tyto n&aacute;stroje v&aacute;m pomohou odpovědět na někter&eacute; z nejčastěj&scaron;&iacute;ch ot&aacute;zek prostorov&eacute; anal&yacute;zy: &bdquo;Co je v&nbsp;bl&iacute;zkosti čeho?&ldquo; a&nbsp;&bdquo;Jak&aacute; je optim&aacute;ln&iacute; cesta?&ldquo;
            <ul>
                <li>N&aacute;stroj  <b>Vypoč&iacute;tat vzd&aacute;lenost (Calculate Distance)</b> vypoč&iacute;t&aacute; euklidovskou vzd&aacute;lenost, směr a&nbsp;přiřazen&iacute; z&nbsp;jedin&eacute;ho zdroje nebo sady zdrojů.
                    

                </li>
                <li> <b>Stanovit s&iacute;ť optim&aacute;ln&iacute;ch cestovn&iacute;ch n&aacute;kladů (Determine Optimum Travel Cost Network)</b> vypoč&iacute;t&aacute; s&iacute;ť optim&aacute;ln&iacute;ch n&aacute;kladů ze sady vstupn&iacute;ch regionů.
                    

                </li>
                <li>N&aacute;stroj  <b>Stanovit nejm&eacute;ně n&aacute;kladnou trasu jako linii (Determine Travel Cost Path As Polyline)</b> vypoč&iacute;t&aacute; polyliniovou trasu s&nbsp;nejmen&scaron;&iacute;mi n&aacute;klady mezi c&iacute;lov&yacute;mi a&nbsp;zdrojov&yacute;mi body.
                    

                </li>
                <li>N&aacute;stroj  <b>Akumulace vzd&aacute;lenosti (Distance Accumulation)</b> vypoč&iacute;t&aacute; akumulovanou vzd&aacute;lenost od jednotliv&yacute;ch buněk ke zdrojům. Poč&iacute;t&aacute; s&nbsp;př&iacute;mou vzd&aacute;lenost&iacute; vzdu&scaron;nou čarou, vzd&aacute;lenost&iacute; n&aacute;kladů a&nbsp;skutečnou vzd&aacute;lenost&iacute; povrchu i&nbsp;se svisl&yacute;mi a&nbsp;vodorovn&yacute;mi faktory.
                    

                </li>
                <li>N&aacute;stroj  <b>Přidělen&iacute; vzd&aacute;lenosti (Distance Allocation)</b> vypoč&iacute;t&aacute; vzd&aacute;lenost od jednotliv&yacute;ch buněk ke přiřazen&yacute;m zdrojům na z&aacute;kladě př&iacute;m&eacute; vzd&aacute;lenosti, vzd&aacute;lenosti n&aacute;kladů, skutečn&eacute; vzd&aacute;lenosti povrchu i&nbsp;na z&aacute;kladě vertik&aacute;ln&iacute;ch a&nbsp;horizont&aacute;ln&iacute;ch faktorů.
                    

                </li>
                <li>N&aacute;stroj  <b>Optim&aacute;ln&iacute; trasa jako linie (Optimal Path As Line)</b> vypoč&iacute;t&aacute; optim&aacute;ln&iacute; trasu jako linii z&nbsp;c&iacute;lov&yacute;ch ke zdrojov&yacute;m bodům.
                    

                </li>
                <li>N&aacute;stroj  <b>Optim&aacute;ln&iacute; trasa jako rastr (Optimal Path As Raster)</b> vypoč&iacute;t&aacute; optim&aacute;ln&iacute; trasu jako rastr z c&iacute;lov&yacute;ch ke zdrojov&yacute;m bodům.
                    

                </li>
                <li>N&aacute;stroj  <b>Optim&aacute;ln&iacute; propojen&iacute; regionů (Optimal Region Connections)</b> vypoč&iacute;t&aacute; optim&aacute;ln&iacute; s&iacute;ť propojen&iacute; mezi dvěma nebo v&iacute;ce vstupn&iacute;mi regiony.
                </li>
            </ul>
            
        </p>
    </div>
        <div id="CalculateDistanceTool" class="regularsize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Vypočítat vzdálenost (Calculate Distance)</h2></td>
                    <td>
                    <img src="../images/GUID-34E2E6F3-2F60-43F5-B499-D5735DE08602-web.png" class="titleImage" alt="Vypoč&iacute;tat vzd&aacute;lenost">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>Tento n&aacute;stroj vypoč&iacute;t&aacute; euklidovskou vzd&aacute;lenost, směr a přiřazen&iacute; z jedin&eacute;ho zdroje nebo sady zdrojů.
            </p>
            <br/>
        </div>
        <div id="DetermineOptimumTravelCostNetworkTool" class="regularsize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Stanovit síť optimálních cestovních nákladů (Determine Optimum Travel Cost Network)</h2></td>
                    <td>
                    <img src="../images/GUID-097BDD6E-0AD8-44F2-BB70-C5395F4B1AF4-web.png" class="titleImage" alt="Obr&aacute;zek n&aacute;stroje Stanovit s&iacute;ť optim&aacute;ln&iacute;ch cestovn&iacute;ch n&aacute;kladů">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>Tento n&aacute;stroj vypoč&iacute;t&aacute; optim&aacute;ln&iacute; s&iacute;ť n&aacute;kladů ze souboru vstupn&iacute;ch regionů.
            </p>
            <br/>
        </div>
        <div id="DetermineTravelCostPathAsPolylineTool" class="regularsize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Stanovit nejméně nákladnou trasu jako linii (Determine Travel Cost Path As Polyline)</h2></td>
                    <td>
                    <img src="../images/GUID-9A27DEB7-0276-483C-A12F-3E70D636550D-web.png" class="titleImage" alt="Obr&aacute;zek n&aacute;stroje Stanovit nejm&eacute;ně n&aacute;kladnou trasu jako linii">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>Tento n&aacute;stroj vypoč&iacute;t&aacute; polyliniovou trasu s&nbsp;nejniž&scaron;&iacute;mi n&aacute;klady mezi destinacemi a&nbsp;zdroji.
            </p>
            <br/>
        </div>
        <div id="DistanceAccumulationTool" class="regularsize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Akumulace vzdálenosti</h2></td>
                    <td>
                    <img src="../images/GUID-758B6DFA-6820-45B8-8089-5A2B7AB20A0D-web.png" class="titleImage" alt="Ilustrace n&aacute;stroje Akumulace vzd&aacute;lenosti">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>Tento n&aacute;stroj vypoč&iacute;t&aacute; akumulovanou vzd&aacute;lenost od jednotliv&yacute;ch buněk ke zdrojům. Poč&iacute;t&aacute; s&nbsp;př&iacute;mou vzd&aacute;lenost&iacute; vzdu&scaron;nou čarou, vzd&aacute;lenost&iacute; n&aacute;kladů a&nbsp;vzd&aacute;lenost&iacute; skutečn&eacute;ho povrchu i&nbsp;se svisl&yacute;mi a&nbsp;vodorovn&yacute;mi faktory.
            </p>
            <br/>
        </div>
        <div id="DistanceAllocationTool" class="regularsize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Přiřazení vzdálenosti</h2></td>
                    <td>
                    <img src="../images/GUID-2843B88C-B69A-43FB-A93B-B8D7ABCF95EA-web.png" class="titleImage" alt="Ilustrace n&aacute;stroje Přiřazen&iacute; vzd&aacute;lenosti">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>Tento n&aacute;stroj vypoč&iacute;t&aacute; vzd&aacute;lenost od jednotliv&yacute;ch buněk k&nbsp;přiřazen&yacute;m zdrojům na z&aacute;kladě př&iacute;m&eacute; vzd&aacute;lenosti, vzd&aacute;lenosti n&aacute;kladů, skutečn&eacute; vzd&aacute;lenosti povrchu i&nbsp;na z&aacute;kladě vertik&aacute;ln&iacute;ch a&nbsp;horizont&aacute;ln&iacute;ch faktorů.
            </p>
            <br/>
        </div>
        <div id="OptimalPathAsLineTool" class="regularsize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Optimální trasa jako linie (Optimal Path As Line)</h2></td>
                    <td>
                    <img src="../images/GUID-754B49AB-28D7-4758-A24C-5C67339666BA-web.png" class="titleImage" alt="Ilustrace n&aacute;stroje Optim&aacute;ln&iacute; trasa jako linie">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>Tento n&aacute;stroj vypoč&iacute;t&aacute; optim&aacute;ln&iacute; cestu z&nbsp;c&iacute;le ke zdrojům jako linii.
            </p>
            <br/>
        </div>
        <div id="OptimalPathAsRasterTool" class="regularsize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Optimální trasa jako rastr (Optimal Path As Raster)</h2></td>
                    <td>
                    <img src="../images/GUID-75C94369-AAAA-4556-8F89-9B6AA39012C9-web.png" class="titleImage" alt="Ilustrace n&aacute;stroje Optim&aacute;ln&iacute; trasa jako rastr">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>Tento n&aacute;stroj vypoč&iacute;t&aacute; optim&aacute;ln&iacute; cestu z&nbsp;c&iacute;le ke zdrojům jako rastr.
            </p>
            <br/>
        </div>
        <div id="OptimalRegionConnectionsTool" class="regularsize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Optimální propojení regionů (Optimal Region Connections)</h2></td>
                    <td>
                    <img src="../images/GUID-85027C62-D35A-428B-B050-4F52D2B4ADE4-web.png" class="titleImage" alt="Ilustrace n&aacute;stroje Optim&aacute;ln&iacute; propojen&iacute; regionů">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>Tento n&aacute;stroj vypoč&iacute;t&aacute; optim&aacute;ln&iacute; s&iacute;ť propojen&iacute; mezi dvěma nebo v&iacute;ce vstupn&iacute;mi regiony.
            </p>
            <br/>
        </div>
    <div id="AnalyzeImageCategory" class="regularsize">
        <h2>Analyzovat snímek</h2>
        <hr/>
        <p>N&aacute;sleduj&iacute;c&iacute; n&aacute;stroj v kategorii n&aacute;strojů  <b>Analyzovat obr&aacute;zek</b> v&aacute;m pomůže analyzovat sn&iacute;mky:
            <ul>
                <li> <b>N&aacute;stroj Monitorovat vegetaci</b> nalezne v obr&aacute;zku relativn&iacute; pokryt&iacute; vegetac&iacute; na z&aacute;kladě aritmetick&yacute;ch operac&iacute; p&aacute;sem. Pro anal&yacute;zu sn&iacute;mku je k dispozici několik vegetačn&iacute;ch indexů.
                    

                </li>
            </ul>
            
        </p>
    </div>
        <div id="MonitorVegetationTool" class="regularsize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Monitorovat vegetaci (Monitor Vegetation)</h2></td>
                    <td>
                    <img src="../images/GUID-7763FCC0-2EA1-463B-98D0-4EBDF6150907-web.png" class="titleImage" alt="N&aacute;stroj Monitorovat vegetaci pro port&aacute;l">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>N&aacute;stroj provede aritmetickou operaci s&nbsp;p&aacute;smy v&iacute;cep&aacute;smov&eacute; rastrov&eacute; vrstvy, aby zjistil informace o pokryt&iacute; vegetac&iacute;.
            </p>
            <br/>
        </div>
    <div id="AnalyzeTerrainCategory" class="regularsize">
        <h2>Analyzovat terén</h2>
        <hr/>
        <p>Tyto n&aacute;stroje v&aacute;m pom&aacute;haj&iacute; analyzovat rastrov&eacute; povrchy. 
            <ul>
                <li> <b>Vypoč&iacute;tat svažitost</b> vypoč&iacute;t&aacute; svažitost ter&eacute;nu.
                    

                </li>
                <li> <b>Odvodit orientaci</b> vypoč&iacute;t&aacute; směrovou orientaci nejstrměj&scaron;&iacute;ho svahu pro každ&eacute; um&iacute;stěn&iacute;.
                    

                </li>
                <li> <b>Vytvořit viditeln&yacute; povrch</b> urč&iacute;, co je možn&eacute; vidět z&nbsp;libovoln&eacute;ho bodu v&nbsp;krajině.
                    

                </li>
                <li> <b>Povod&iacute;</b> vypoč&iacute;t&aacute; př&iacute;tokovou oblast nad identifikovan&yacute;mi lokacemi na povrchu.
                    

                </li>
            </ul>
            
        </p>
    </div>
        <div id="CalculateSlopeTool" class="regularsize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Vypočítat svažitost (Calculate Slope)</h2></td>
                    <td>
                    <img src="../images/GUID-D33862C6-01BB-445E-B0C3-BC8B8C1858DA-web.png" class="titleImage" alt="N&aacute;stroj Vypoč&iacute;tat svažitost pro port&aacute;l">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>Urč&iacute; povrch, kter&yacute; ukazuje svažitost vstupn&iacute;ch dat nadmořsk&eacute; v&yacute;&scaron;ky. Svažitost představuje m&iacute;ru změny nadmořsk&eacute; v&yacute;&scaron;ky pro každou buňku digit&aacute;ln&iacute;ho v&yacute;&scaron;kov&eacute;ho modelu (DEM).
            </p>
            <br/>
        </div>
        <div id="DeriveAspectTool" class="regularsize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Odvodit orientaci (Derive Aspect)</h2></td>
                    <td>
                    <img src="../images/GUID-D03FF025-0530-4D0D-87A3-B25D6716F8F0-web.png" class="titleImage" alt="N&aacute;stroj Odvodit orientaci pro port&aacute;l">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>Identifikuje směr svažitosti, tzn. maxim&aacute;ln&iacute; m&iacute;ru změny hodnot mezi buňkami a jejich okol&iacute;m. Orientaci si lze představit jako směr svahu.
            </p>
            <br/>
        </div>
        <div id="CreateViewshedRasterTool" class="regularsize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Vytvořit viditelný povrch (Create Viewshed)</h2></td>
                    <td>
                    <img src="../images/GUID-BB8B8CAF-330E-4C41-9D94-AF4728D0D0F3-web.png" class="titleImage" alt="N&aacute;stroj Vytvořit viditeln&yacute; povrch">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>Urč&iacute; um&iacute;stěn&iacute; na rastrov&eacute;m povrchu, kter&aacute; jsou viditeln&aacute; pro sadu pozorovatelů.
            </p>
            <br/>
        </div>
        <div id="WatershedTool" class="smallsize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Povodí</h2></td>
                    <td>
                    <img src="../images/GUID-AF749369-8C2D-46FF-9D74-2CF7CAB7C7B0-web.png" class="titleImage" alt="&Uacute;loha Povod&iacute;">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>Stanov&iacute; př&iacute;tokovou oblast nad sadou buněk v rastru.
            </p>
            <br/>
        </div>
    <div id="ManageDataCategory" class="largesize">
        <h2>Spravovat data</h2>
        <hr/>
        <p>Tyto n&aacute;stroje lze použ&iacute;t pro každodenn&iacute; spr&aacute;vu geografick&yacute;ch dat a pro kombinov&aacute;n&iacute; dat před anal&yacute;zou. 
            <ul>
                <li>N&aacute;stroj  <b>Extrahovat rastr</b> vyřez&aacute;v&aacute; č&aacute;sti z&nbsp;rastrov&eacute; datov&eacute; sady pro dal&scaron;&iacute; anal&yacute;zu.
                    

                </li>
                <li>N&aacute;stroj  <b>Přemapovat hodnoty</b> přiděluje různ&eacute; hodnoty rastrov&yacute;m buňk&aacute;m.
                    

                </li>
                <li>N&aacute;stroj  <b>Přev&eacute;st prvek na rastr</b> měn&iacute; vektorov&aacute; data na rastry.
                    

                </li>
                <li>N&aacute;stroj  <b>Přev&eacute;st rastr na prvek</b> měn&iacute; rastrov&aacute; data na vektory.
                    

                </li>
                <li> <b>Vzorek</b> extrahuje data v definovan&yacute;ch um&iacute;stěn&iacute;ch z rastru nebo sady rastrů.
                </li>
            </ul>
            
        </p>
    </div>
        <div id="ExtractRasterTool" class="smallsize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Extrahovat rastr</h2></td>
                    <td>
                    <img src="../images/GUID-DC9CBCB9-A07C-42D3-A0CB-2FB1483CBF4C-web.png" class="titleImage" alt="N&aacute;stroj Extrahovat rastr pro port&aacute;l">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>Extrahovat buňky z&nbsp;rastru na z&aacute;kladě hodnoty, tvaru nebo rozsahu jin&eacute; datov&eacute; sady.
            </p>
            <br/>
        </div>
        <div id="RemapValuesTool" class="smallsize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Přemapovat hodnoty</h2></td>
                    <td>
                    <img src="../images/GUID-4006E442-A60B-469A-891D-5ED442F64CB8-web.png" class="titleImage" alt="N&aacute;stroj Přemapovat hodnoty pro port&aacute;l">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>Změnit jednotliv&eacute; hodnoty buněk nebo jejich rozsahy na nov&eacute; hodnoty.
            </p>
            <br/>
        </div>
        <div id="ConvertFeatureToRasterTool" class="regularsize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Převést prvek na rastr (Convert Feature to Raster)</h2></td>
                    <td>
                    <img src="../images/GUID-FC535A9C-A946-419A-9A85-95EB31E4D3A0-web.png" class="titleImage" alt="N&aacute;stroj Přev&eacute;st prvek na rastr">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>Vytvořit novou rastrovou datovou sadu z&nbsp;existuj&iacute;c&iacute; datov&eacute; sady prvků.
            </p>
            <br/>
        </div>
        <div id="ConvertRasterToFeatureTool" class="regularsize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Převést rastr na prvek (Convert Raster To Feature)</h2></td>
                    <td>
                    <img src="../images/GUID-7BBBCE28-2FDA-46B8-99D7-65F560AB2F2B-web.png" class="titleImage" alt="N&aacute;stroj Přev&eacute;st rastr na prvek">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>Vytvořit novou datovou sadu prvků z&nbsp;existuj&iacute;c&iacute; rastrov&eacute; datov&eacute; sady.
            </p>
            <br/>
        </div>
        <div id="SampleTool" class="regularsize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Vzorek (Sample)</h2></td>
                    <td>
                    <img src="../images/GUID-3950CCA3-C1D0-493F-A33D-93673443ADD2-web.png" class="titleImage" alt="Vzorek (Sample)">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>Vytv&aacute;ř&iacute; tabulku nebo tř&iacute;du bodov&yacute;ch prvků s datov&yacute;mi hodnotami extrahovan&yacute;mi z rastru nebo sady rastrů v definovan&yacute;ch um&iacute;stěn&iacute;ch.
            </p>
            <br/>
        </div>
    <div id="DeepLearningCategory" class="largesize">
        <h2>Deep Learning</h2>
        <hr/>
        <p>Tyto n&aacute;stroje se použ&iacute;vaj&iacute; pro detekci nebo klasifikaci specifick&yacute;ch prvků na sn&iacute;mku nebo klasifikaci pixelů v rastrov&eacute; datov&eacute; sadě. Deep learning je typem metody strojov&eacute;ho učen&iacute; uměl&eacute; inteligence, kter&aacute; detekuje prvky na sn&iacute;mc&iacute;ch pomoc&iacute; v&iacute;ce vrstev v neur&aacute;ln&iacute;ch s&iacute;t&iacute;ch, kde každ&aacute; vrstva je schopna extrahovat jeden nebo v&iacute;ce jedinečn&yacute;ch prvků na sn&iacute;mku. Tento n&aacute;stroj využ&iacute;v&aacute; modely, kter&eacute; byly učeny pro detekov&aacute;n&iacute; prvků v programech deep learningu třet&iacute; strany&mdash;jako např&iacute;klad TensorFlow, CNTK a Keras&mdash;a v&yacute;stupn&iacute; prvky nebo mapy tř&iacute;dy.
            <ul>
                <li> <b>Klasifikovat pixely pomoc&iacute; deep learningu (Classify Pixels Using Deep Learning)</b> vytv&aacute;ř&iacute; rastr pomoc&iacute; učen&eacute;ho modelu deep learningu.
                </li>
                <li> <b>Detekovat objekty pomoc&iacute; deep learningu (Detect Objects Using Deep Learning)</b> vytv&aacute;ř&iacute; tř&iacute;du prvků obsahuj&iacute;c&iacute; objekty, kter&eacute; nalezne ve vstupn&iacute;m rastru pomoc&iacute; učen&eacute;ho modelu deep learningu.
                </li>
                <li> <b>Klasifikovat pixely pomoc&iacute; deep learningu (Classify Pixels Using Deep Learning)</b> vytv&aacute;ř&iacute; tř&iacute;du prvků nebo tabulku, ve kter&eacute; je každ&eacute;mu vstupn&iacute;mu objektu ve vstupn&iacute;m rastru přiřazeno pojmenov&aacute;n&iacute; tř&iacute;dy pomoc&iacute; učen&eacute;ho modelu deep learningu.
                </li>
            </ul>
            
        </p>
    </div>
        <div id="ClassifyPixelsUsingDeepLearningTool" class="regularsize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Klasifikovat pixely pomocí deep learningu (Classify Pixels Using Deep Learning)</h2></td>
                    <td>
                    <img src="../images/GUID-88BE63A6-B06C-4C61-9AB1-8DA5A08C6783-web.png" class="titleImage" alt="Klasifikovat pixely pomoc&iacute; deep learningu (Classify Pixels Using Deep Learning)">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>Tento n&aacute;stroj spust&iacute; model učen&iacute; deep learningu na vstupn&iacute;m rastru pro vytvořen&iacute; klasifikovan&eacute;ho rastru se tř&iacute;dou popisků přiřazenou ke každ&eacute;mu platn&eacute;mu pixelu.
            </p>
            <br/>
        </div>
        <div id="DetectObjectsUsingDeepLearningTool" class="regularsize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Detekovat objekty pomocí deep learningu (Detect Objects Using Deep Learning)</h2></td>
                    <td>
                    <img src="../images/GUID-EE76A33E-0B8F-48EE-94F8-782FAD241D72-web.png" class="titleImage" alt="Detekovat objekty pomoc&iacute; deep learningu (Detect Objects Using Deep Learning)">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>Tento n&aacute;stroj spust&iacute; model učen&iacute; deep learningu na vstupn&iacute;m rastru pro vytvořen&iacute; tř&iacute;dy prvků obsahuj&iacute;c&iacute; objekty, kter&eacute; nalezne. Prvky mohou b&yacute;t ohraničuj&iacute;c&iacute; v&yacute;řezy nebo polygony kolem nalezen&yacute;ch objektů, nebo body ve středech objektů.
            </p>
            <br/>
        </div>
        <div id="ClassifyObjectsUsingDeepLearningTool" class="regularsize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Klasifikovat objekty pomocí deep learningu (Classify Objects Using Deep Learning)</h2></td>
                    <td>
                    <img src="../images/GUID-F31B4A21-3E5C-4667-B66B-155CC35CD62B-web.png" class="titleImage" alt="Klasifikovat objekty pomoc&iacute; deep learningu (Classify Objects Using Deep Learning)">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>Tento n&aacute;stroj spust&iacute; naučen&yacute; model deep learningu na vstupn&iacute;m rastru a voliteln&eacute; tř&iacute;dě prvků za &uacute;čelem vytvořen&iacute; tř&iacute;dy prvků nebo tabulky, v n&iacute;ž m&aacute; každ&yacute; vstupn&iacute; objekt přiřazenou tř&iacute;du popisků.
            </p>
            <br/>
        </div>
    <div id="MultidimensionalAnalysisCategory" class="largesize">
        <h2>Vícerozměrná analýza</h2>
        <hr/>
        <p>N&aacute;stroje v sadě n&aacute;strojů V&iacute;cerozměrn&eacute; anal&yacute;zy v&aacute;m umožňuj&iacute; prov&aacute;dět anal&yacute;zu vědeck&yacute;ch dat za použit&iacute; mnoha proměnn&yacute;ch a rozměrů.
        </p>
        <p>V&iacute;cerozměrn&aacute; data představuj&iacute; data poř&iacute;zen&aacute; ve v&iacute;ce (různ&yacute;ch) časech, hloubk&aacute;ch nebo v&yacute;&scaron;k&aacute;ch. Tento typ dat se běžně použ&iacute;v&aacute; v meteorologii, oce&aacute;nografii a dal&scaron;&iacute;ch věd&aacute;ch o Zemi. Pomoc&iacute; t&eacute;to sady n&aacute;strojů můžete spravovat, vizualizovat a analyzovat v&iacute;cerozměrn&aacute; rastrov&aacute; data v mnoha form&aacute;tech včetně netCDF, HDF, GRIB, v&iacute;cerozměrn&eacute; mozaikov&eacute; datov&eacute; sady a form&aacute;tu CRF (Cloud Raster Format) od společnosti Esri.
        </p>
        <p>V n&aacute;sleduj&iacute;c&iacute; tabulce jsou uvedeny n&aacute;stroje v&iacute;cerozměrn&eacute; anal&yacute;zy a jejich stručn&yacute; popis.
            <ul>
                <li>N&aacute;stroj  <b>Agregovat v&iacute;cerozměrn&yacute; rastr</b> vytvoř&iacute; datovou sadu v&iacute;cerozměrn&eacute;ho rastru agregac&iacute; existuj&iacute;c&iacute;ch proměnn&yacute;ch v&iacute;cerozměrn&eacute;ho rastru v rozměru.
                </li>
                <li>N&aacute;stroj  <b>Generovat v&iacute;cerozměrnou anom&aacute;lii</b> vypoč&iacute;t&aacute; anom&aacute;lii pro každ&yacute; v&yacute;řez ve v&iacute;cerozměrn&eacute;m rastru a vygeneruje v&iacute;cerozměrn&yacute; rastr.
                </li>
                <li>N&aacute;stroj  <b>Vygenerovat rastr trendu</b> odhaduje trend pro každ&yacute; pixel pod&eacute;l rozměru pro jednu nebo v&iacute;ce proměnn&yacute;ch ve v&iacute;cerozměrn&eacute;m rastru.
                </li>
                <li>N&aacute;stroj  <b>Předpov&iacute;dat pomoc&iacute; rastru trendu</b> vypoč&iacute;t&aacute; předpokl&aacute;dan&yacute; v&iacute;cerozměrn&yacute; rastr pomoc&iacute; v&yacute;stupn&iacute;ho rastru trendu z n&aacute;stroje <b>Vygenerovat rastr trendu</b>.
                </li>
                <li> <b>Naj&iacute;t statistiku argumentu</b> extrahuje hodnotu rozměru nebo indexu p&aacute;sma, ve kter&eacute; je vytvořena dan&aacute; statistika pro každ&yacute; pixel ve v&iacute;cerozměrn&eacute;m nebo v&iacute;cep&aacute;smov&eacute;m rastru.
                </li>
            </ul>
            
        </p>
    </div>
        <div id="AggregateMultidimensionalRasterTool" class="regularsize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Agregovat vícerozměrný rastr (Aggregate Multidimensional Raster)</h2></td>
                    <td>
                    <img src="../images/GUID-2C2320A3-EC6E-4FFC-B59B-9551BB02C545-web.png" class="titleImage" alt="Agregovat v&iacute;cerozměrn&yacute; rastr (Aggregate Multidimensional Raster)">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>Tento n&aacute;stroj vytvoř&iacute; datovou sadu v&iacute;cerozměrn&eacute;ho rastru agregac&iacute; existuj&iacute;c&iacute;ch proměnn&yacute;ch v&iacute;cerozměrn&eacute;ho rastru v rozměru.
            </p>
            <br/>
        </div>
        <div id="FindArgumentStatisticsTool" class="regularsize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Statistika hledání argumentu</h2></td>
                    <td>
                    <img src="../images/GUID-6DE9D49F-C9CA-48B8-B14F-C8EF05FBFA42-web.png" class="titleImage" alt="Statistika hled&aacute;n&iacute; argumentu">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>Tento n&aacute;stroj extrahuje hodnotu rozměru nebo indexu p&aacute;sma, ve kter&eacute; je vytvořena dan&aacute; statistika pro každ&yacute; pixel ve v&iacute;cerozměrn&eacute;m nebo v&iacute;cep&aacute;smov&eacute;m rastru.
            </p>
            <br/>
        </div>
        <div id="GenerateMultidimensionalAnomalyTool" class="regularsize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Generovat vícerozměrnou anomálii (Generate Multidimensional Anomaly)</h2></td>
                    <td>
                    <img src="../images/GUID-8D54C66F-5C16-4EE5-93E9-80722D10AF12-web.png" class="titleImage" alt="Generovat v&iacute;cerozměrnou anom&aacute;lii (Generate Multidimensional Anomaly)">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>Tento n&aacute;stroj vypoč&iacute;t&aacute; anom&aacute;lii pro každ&yacute; v&yacute;řez ve v&iacute;cerozměrn&eacute;m rastru a vygeneruje v&iacute;cerozměrn&yacute; rastr.
            </p>
            <br/>
        </div>
        <div id="GenerateTrendRasterTool" class="regularsize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Generovat rastr trendu (Generate Trend Raster)</h2></td>
                    <td>
                    <img src="../images/GUID-A95F821A-8CAF-45F3-93E5-14BDF5DA0BCD-web.png" class="titleImage" alt="Generovat rastr trendu (Generate Trend Raster)">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>Tento n&aacute;stroj odhaduje trend pro každ&yacute; pixel pod&eacute;l rozměru pro jedno nebo v&iacute;ce proměnn&yacute;ch ve v&iacute;cerozměrn&eacute;m rastru.
            </p>
            <br/>
        </div>
        <div id="PredictUsingTrendRasterTool" class="regularsize">
            <table class="toolSummaryTable">
                <thead></thead>
                <tbody><tr>
                    <td><h2>Předpověď pomocí rastru trendu (Predict Using Trend Raster)</h2></td>
                    <td>
                    <img src="../images/GUID-E3758820-51A9-46DE-AAF6-E27B68DE4012-web.png" class="titleImage" alt="Předpověď pomoc&iacute; rastru trendu (Predict Using Trend Raster)">
                    </td>
                </tr></tbody>
            </table>
<hr/>
            <p>Tento n&aacute;stroj vypoč&iacute;t&aacute; předpokl&aacute;dan&yacute; v&iacute;cerozměrn&yacute; rastr pomoc&iacute; v&yacute;stupn&iacute;ho rastru trendu z n&aacute;stroje  <b>Vygenerovat rastr trendu</b>.
            </p>
            <br/>
        </div>
</div>
</html>
