<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Vzorek (Sample)</h2><p/>
        <h2><img src="../images/GUID-3950CCA3-C1D0-493F-A33D-93673443ADD2-web.png" alt="Vzorek (Sample)"></h2>
        <hr/>
    <p>Tento n&aacute;stroj vytvoř&iacute; tabulku nebo tř&iacute;du bodov&yacute;ch prvků, kter&aacute; uvede hodnoty buněk z rastru nebo sady rastrů pro definovan&eacute; um&iacute;stěn&iacute;. Um&iacute;stěn&iacute; jsou definov&aacute;na buňkami rastru, polygonov&yacute;mi prvky, polyliniov&yacute;mi prvky nebo sadou bodů.
    </p>
    <p>Mezi př&iacute;klady použit&iacute; tohoto n&aacute;stroje patř&iacute;:
        <ul>
            <li> Extrahovat atributy z&nbsp;v&iacute;ce rastrů pro nalezen&iacute; vhodn&yacute;ch um&iacute;stěn&iacute; mobiln&iacute;ch vys&iacute;lačů, jako např&iacute;klad využit&iacute; &uacute;zem&iacute;, typ půdy, nadmořsk&aacute; v&yacute;&scaron;ka a&nbsp;vzd&aacute;lenost od cesty.
            </li>
            <li>Extrahovat teploty půdy v&nbsp;rozd&iacute;ln&yacute;ch hloubk&aacute;ch pro danou sadu bodů.
            </li>
            <li>Z&nbsp;30 let měs&iacute;čně shromažďovan&yacute;ch dat teploty mořsk&eacute; hladiny sumarizujte v m&iacute;stech v&yacute;skytu živočichů nebo v&nbsp;jejich domovsk&yacute;ch are&aacute;lech za dan&eacute; obdob&iacute;, kdy byl dan&yacute; živoči&scaron;n&yacute; druh pozorov&aacute;n.
            </li>
        </ul>
        
    </p>
    <p>Pokud je za&scaron;krtnuto pole  <b>Použ&iacute;t rozsah aktu&aacute;ln&iacute; mapy</b>, budou do anal&yacute;zy zahrnuty proměnn&eacute; nebo p&aacute;sma vrstvy viditeln&eacute; v&nbsp;aktu&aacute;ln&iacute;m rozsahu mapy. Pokud nen&iacute; pole za&scaron;krtnuto, budou analyzov&aacute;ny proměnn&eacute; nebo p&aacute;sma v cel&eacute; vrstvě včetně těch, kter&eacute; se nach&aacute;zej&iacute; mimo aktu&aacute;ln&iacute; rozsah mapy.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inRasters">
        <div><h2>Zvolte vrstvu(y) obrazových dat ke vzorkování</h2></div>
        <hr/>
        <div>
            <p>Jeden sn&iacute;mek nebo seznam sn&iacute;mků, jejichž hodnoty budou vzorkov&aacute;ny podle dat vstupn&iacute;ho um&iacute;stěn&iacute;. 
            </p>
            <p>Pokud chcete vzorkovat v&scaron;echny řezy z v&iacute;cerozměrn&eacute; vrstvy obrazov&yacute;ch dat, mus&iacute; to b&yacute;t pouze vstupn&iacute; rastr.
            </p>
        </div>
    </div>
    <div id="inLocationData">
        <div><h2>Zvolte vrstvu umístění</h2></div>
        <hr/>
        <div>
            <p>Data identifikace pozic, kter&eacute; chcete vzorkovat.
            </p>
            <p>Data vstupn&iacute;ho um&iacute;stěn&iacute; mohou b&yacute;t rastr nebo tř&iacute;da bodov&yacute;ch, liniov&yacute;ch nebo polygonov&yacute;ch prvků.
            </p>
        </div>
    </div>
    <div id="uniqueIdField">
        <div><h2>Určete pole jedinečného identifikátoru</h2></div>
        <hr/>
        <div>
            <p>Pole obsahuj&iacute;c&iacute; různ&eacute; hodnoty pro každ&eacute; um&iacute;stěn&iacute; nebo prvek ve vstupn&iacute;m um&iacute;stěn&iacute; rastru nebo tř&iacute;dě prvků.
            </p>
        </div>
    </div>
    <div id="acquisitionDefinition">
        <div><h2>Určete informace o pořízení polohových dat (volitelné)</h2></div>
        <hr/>
        <div>
            <p>Určete čas, hloubku nebo jin&aacute; data o poř&iacute;zen&iacute; spojen&aacute; s buňkami nebo prvky um&iacute;stěn&iacute;.
            </p>
            <p>Pro každ&yacute; rozměr jsou tři možnosti zad&aacute;n&iacute; informac&iacute; o poř&iacute;zen&iacute; spojen&yacute;ch s buňkami nebo prvky um&iacute;stěn&iacute;:
            </p>
            <ul>
                <li> <b>Jedin&eacute; pole nebo hodnota</b>&mdash;Když je vybr&aacute;na tato možnost, mus&iacute; b&yacute;t zad&aacute;ny n&aacute;sleduj&iacute;c&iacute; informace:
                    <ul>
                        <li> <b>Pole rozměru nebo hodnota</b>&mdash;Vyberte pole hodnot rozměru z&nbsp;dat o&nbsp;um&iacute;stěn&iacute; nebo zadejte přesnou hodnotu rozměru.
                        </li>
                    </ul>
                    
                    

                </li>
                <li> <b>Jedin&eacute; pole nebo hodnota s&nbsp;relativn&iacute;mi hodnotami</b>&mdash;Pokud je vybr&aacute;na tato možnost, informace n&iacute;že mus&iacute; b&yacute;t zad&aacute;ny společně, aby definovaly rozsah, v&nbsp;němž bude vypoč&iacute;t&aacute;na statistika pro proměnn&eacute;:
                    <ul>
                        <li> <b>Pole rozměru nebo hodnota</b>&mdash;Vyberte pole hodnot rozměru z&nbsp;dat o&nbsp;um&iacute;stěn&iacute;.
                        </li>
                        <li> <b>Relativn&iacute; hodnota před</b>&mdash;Zadejte nez&aacute;porn&eacute; č&iacute;slo použit&eacute; k&nbsp;odečten&iacute; od <b>Pole rozměru nebo hodnoty</b> pro definov&aacute;n&iacute; zač&aacute;tku rozsahu hodnot rozměru. Tato hodnota představuje počet dnů, pokud je rozměr čas.
                        </li>
                        <li> <b>Relativn&iacute; hodnota po</b>&mdash;Zadejte nez&aacute;porn&eacute; č&iacute;slo použit&eacute; k&nbsp;přičten&iacute; k <b>Poli rozměru nebo hodnotě</b> pro definov&aacute;n&iacute; konce rozsahu hodnot rozměru. Tato hodnota představuje počet dnů, pokud je rozměr čas.
                        </li>
                    </ul>
                    
                </li>
                <li> <b>Poč&aacute;tečn&iacute; a&nbsp;koncov&aacute; pole nebo hodnoty</b>&mdash;Pokud je vybr&aacute;na tato možnost, informace n&iacute;že mus&iacute; b&yacute;t zad&aacute;ny společně, aby definovaly rozsah, v&nbsp;němž bude vypoč&iacute;t&aacute;na statistika pro proměnn&eacute;:
                    <ul>
                        <li> <b>Poč&aacute;tečn&iacute; pole nebo hodnoty</b>&mdash;Vyberte pole hodnot rozměru z&nbsp;dat o&nbsp;um&iacute;stěn&iacute; nebo zadejte přesnou hodnotu rozměru pro definov&aacute;n&iacute; poč&aacute;tku rozsahu hodnot rozměru.
                        </li>
                        <li> <b>Koncov&eacute; pole nebo hodnoty</b>&mdash;Vyberte pole hodnot rozměru z&nbsp;dat o&nbsp;um&iacute;stěn&iacute; nebo zadejte přesnou hodnotu rozměru pro definov&aacute;n&iacute; konce rozsahu hodnot rozměru.
                        </li>
                    </ul>
                    
                    

                </li>
            </ul>
            
            <p>Tento parametr je k&nbsp;dispozici pouze tehdy, pokud je parametr  <b>Vybrat vrstvu obrazov&yacute;ch dat ke vzorkov&aacute;n&iacute;</b> v&iacute;cerozměrn&yacute; rastr.
            </p>
        </div>
    </div>
    <div id="bufferDistance">
        <div><h2>Zadejte pole nebo hodnotu šířky obalové zóny</h2></div>
        <hr/>
        <div>
            <p>Zadan&aacute; vzd&aacute;lenost kolem dat o um&iacute;stěn&iacute; prvků. &Scaron;&iacute;řka obalov&eacute; z&oacute;ny je zad&aacute;na v line&aacute;rn&iacute;ch jednotk&aacute;ch prvku um&iacute;stěn&iacute; souřadnicov&eacute;ho syst&eacute;mu. Pokud prvek použ&iacute;v&aacute; zeměpisn&yacute; souřadnicov&yacute; syst&eacute;m, jednotky budou stupně.
            </p>
            <p>Statistika bude vypoč&iacute;t&aacute;na v t&eacute;to oblasti obalov&eacute; z&oacute;ny.
            </p>
            <p>Tento parametr je k&nbsp;dispozici pouze tehdy, pokud je parametr  <b>Vybrat vrstvu obrazov&yacute;ch dat ke vzorkov&aacute;n&iacute;</b> v&iacute;cerozměrn&yacute; rastr.
            </p>
        </div>
    </div>
    <div id="statisticsType">
        <div><h2>Zvolte typ statistiky</h2></div>
        <hr/>
        <div>
            <p>Typ statistiky, kter&aacute; bude vypoč&iacute;t&aacute;na.
            </p>
            <ul>
                <li> <b>Minimum</b>&mdash;Najde minim&aacute;ln&iacute; hodnotu v zadan&eacute;m rozsahu.
                </li>
                <li> <b>Maximum</b>&mdash;Najde maxim&aacute;ln&iacute; hodnotu v zadan&eacute;m rozsahu.
                </li>
                <li> <b>Medi&aacute;n</b>&mdash;Najde hodnotu medi&aacute;nu v zadan&eacute;m rozsahu.
                </li>
                <li> <b>Průměr</b>&mdash;Vypoč&iacute;t&aacute; průměrnou hodnotu pro zadan&yacute; rozsah.
                </li>
                <li> <b>Součet</b>&mdash;Vypoč&iacute;t&aacute; součet proměnn&yacute;ch v zadan&eacute;m rozsahu.
                </li>
                <li> <b>Vět&scaron;ina</b>&mdash;Najde hodnotu, kter&aacute; se vyskytuje nejčastěji.
                </li>
                <li> <b>Men&scaron;ina</b>&mdash;Najde hodnotu, kter&aacute; se vyskytuje nejm&eacute;ně často.
                </li>
                <li> <b>Standardn&iacute; odchylka</b>&mdash;Vypoč&iacute;t&aacute; standardn&iacute; odchylku.
                </li>
                <li> <b>Percentil</b>&mdash;Vypoč&iacute;t&aacute; definovan&yacute; percentil v zadan&eacute;m rozsahu.
                </li>
            </ul>
            
            <p>Tento parametr je k&nbsp;dispozici pouze tehdy, pokud je parametr  <b>Vybrat vrstvu obrazov&yacute;ch dat ke vzorkov&aacute;n&iacute;</b> v&iacute;cerozměrn&yacute; rastr a&nbsp;parametry <b>Vybrat vrstvu um&iacute;stěn&iacute;</b> jsou linie nebo polygony, nebo je zad&aacute;no <b>Zadat pole nebo hodnotu &scaron;&iacute;řky obalov&eacute; z&oacute;ny (voliteln&eacute;)</b>.
            </p>
        </div>
    </div>
    <div id="percentileValue">
        <div><h2>Hodnota v percentilu</h2></div>
        <hr/>
        <div>
            <p>Tato hodnota může b&yacute;t v rozsahu od 0 do 100. V&yacute;choz&iacute; hodnota je 90.
            </p>
            <p>Tento parametr je k&nbsp;dispozici pouze tehdy, pokud je parametr  <b>Vybrat typ statistiky</b> nastaven na <b>Percentil</b>.
            </p>
        </div>
    </div>
    <div id="resamplingType">
        <div><h2>Určete techniku převzorkování</h2></div>
        <hr/>
        <div>
            <p>Algoritmus převzorkov&aacute;n&iacute; použit&yacute; při vzorkov&aacute;n&iacute; rastru.
            </p>
            <ul>
                <li> <b>Nejbliž&scaron;&iacute;</b>&mdash;Nejbliž&scaron;&iacute; soused, kter&yacute; použ&iacute;v&aacute; k&nbsp;přiřazen&iacute; hodnoty v&yacute;stupn&iacute; buňce při převzorkov&aacute;n&iacute; hodnotu nejbliž&scaron;&iacute; buňky. Jedn&aacute; se o v&yacute;choz&iacute; nastaven&iacute;.
                </li>
                <li> <b>Biline&aacute;rn&iacute; interpolace</b>&mdash;Biline&aacute;rn&iacute; interpolace, kter&aacute; určuje novou hodnotu buňky na z&aacute;kladě v&aacute;žen&eacute;ho průměru vzd&aacute;lenosti čtyř nejbliž&scaron;&iacute;ch středů vstupn&iacute;ch buněk.
                </li>
                <li> <b>Kubick&aacute; interpolace</b>&mdash;Kubick&aacute; interpolace, kter&aacute; určuje novou hodnotu buňky na z&aacute;kladě tvorby hladk&eacute; křivky proch&aacute;zej&iacute;c&iacute; středy 16 nejbliž&scaron;&iacute;ch vstupn&iacute;ch buněk.
                </li>
            </ul>
            
        </div>
    </div>
    <div id="layout">
        <div><h2>Určete výstupní rozvržení</h2></div>
        <hr/>
        <div>
            <p>Určuje, zda se vzorkovan&eacute; hodnoty zobraz&iacute; ve v&yacute;stupn&iacute; tabulce v ř&aacute;dc&iacute;ch nebo sloupc&iacute;ch.
            </p>
            <ul>
                <li> <b>Vzorkovan&eacute; hodnoty se zobraz&iacute; v ř&aacute;dku</b>&mdash;Vzorkovan&eacute; hodnoty se ve v&yacute;stupn&iacute; tabulce zobraz&iacute; v samostatn&yacute;ch ř&aacute;dc&iacute;ch. Jedn&aacute; se o v&yacute;choz&iacute; nastaven&iacute;.
                </li>
                <li> <b>Vzorkovan&eacute; hodnoty se zobraz&iacute; ve sloupci</b>&mdash;Vzorkovan&eacute; hodnoty se ve v&yacute;stupn&iacute; tabulce zobraz&iacute; v samostatn&yacute;ch sloupc&iacute;ch.
                </li>
            </ul>
            
            <p>Tento parametr je dostupn&yacute; pouze tehdy, když je parametr  <b>Vybrat vrstvu obrazov&yacute;ch dat ke vzorkov&aacute;n&iacute;</b> v&iacute;cerozměrn&yacute; rastr a&nbsp;obsahuje jednu proměnnou a&nbsp;jeden rozměr a&nbsp;každ&yacute; řez je jednop&aacute;smov&yacute; rastr.
            </p>
        </div>
    </div>
    <div id="outputType">
        <div><h2>Určete typ výstupu</h2></div>
        <hr/>
        <div>
            <p>Určuje, zda generovat tř&iacute;du bodov&yacute;ch prvků se vzorkovan&yacute;mi hodnotami ve vlastn&iacute; tabulce nebo pouze tabulku se vzorkovan&yacute;mi hodnotami.
            </p>
            <ul>
                <li> <b>Tabulka</b>&mdash;Generovat tabulku se vzorkovan&yacute;mi hodnotami. Jedn&aacute; se o v&yacute;choz&iacute; nastaven&iacute;.
                </li>
                <li> <b>Prvky</b>&mdash;Generovat tř&iacute;du bodov&yacute;ch prvků se vzorkovan&yacute;mi hodnotami ve vlastn&iacute; tabulce. Pokud jsou parametry <b>Vybrat vrstvu um&iacute;stěn&iacute;</b> linie nebo polygony, každ&yacute; bod ve v&yacute;stupu je centroid každ&eacute; geometrie prvků vstupn&iacute;ho um&iacute;stěn&iacute;. 
                </li>
            </ul>
            
        </div>
    </div>
    <div id="outputName">
        <div><h2>Název výsledné vrstvy</h2></div>
        <hr/>
        <div>
            
            <p>N&aacute;zev vrstvy, kter&aacute; se vytvoř&iacute; ve složce  <b>Můj obsah</b> a přid&aacute; se do mapy. V&yacute;choz&iacute; n&aacute;zev se ř&iacute;d&iacute; n&aacute;zvem n&aacute;stroje a n&aacute;zvem vstupn&iacute; vrstvy. Pokud vrstva již existuje, budete pož&aacute;d&aacute;ni o zad&aacute;n&iacute; jin&eacute;ho n&aacute;zvu.
            </p>
            <p>Můžete zadat n&aacute;zev složky v  <b>Můj obsah</b>, kde bude v&yacute;sledek uložen pomoc&iacute; rozbalovac&iacute;ho seznamu <b>Uložit v&yacute;sledek do</b> .
            </p>
        </div>
    </div>
</div>
</html>
