<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Zónální statistika jako tabulka (Zonal Statistics as Table)</h2><p/>
        <h2><img src="../images/GUID-2847466F-BF22-4545-BDCE-7EB7B1D15F2D-web.png" alt="Z&oacute;n&aacute;ln&iacute; statistika jako tabulkov&yacute; diagram"></h2>
        <hr/>
    <p>Tento n&aacute;stroj shrne hodnoty rastru v&nbsp;z&oacute;n&aacute;ch jin&eacute; datov&eacute; sady a&nbsp;v&yacute;sledky převede do tabulky.
    </p>
    <p>Mezi př&iacute;klady použit&iacute; tohoto n&aacute;stroje patř&iacute;:
        <ul>
            <li>Pomoc&iacute; vrstvy ploch povod&iacute; a vrstvy oblast&iacute; využit&iacute; půdy podle typu využit&iacute; půdy spoč&iacute;tej celkovou rozlohu využ&iacute;van&eacute;ho typu půdy v&nbsp;každ&eacute;m povod&iacute;.
                

            </li>
            <li>Pomoc&iacute; vrstvy parcel v&nbsp;kraji a vrstvy hranic měst spoč&iacute;tej průměrnou cenu voln&yacute;ch parcel v&nbsp;rozsahu hranic každ&eacute;ho města.
                

            </li>
        </ul>
        
    </p>
    <p>Pokud je za&scaron;krtnuto pole  <b>Použ&iacute;t rozsah aktu&aacute;ln&iacute; mapy</b>, budou analyzov&aacute;ny pouze prvky ve vstupn&iacute; vrstvě a v sumarizovan&eacute; vrstvě, kter&eacute; jsou viditeln&eacute; v rozsahu aktu&aacute;ln&iacute; mapy. Pokud toto pole za&scaron;krtnuto nen&iacute;, budou analyzov&aacute;ny v&scaron;echny prvky ve vstupn&iacute; a sumarizovan&eacute; vrstvě, včetně těch, kter&eacute; se nach&aacute;z&iacute; mimo aktu&aacute;ln&iacute; rozsah mapy.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputZoneRasterOrFeatures">
        <div><h2>Zvolte rastr nebo prvky zóny</h2></div>
        <hr/>
        <div>
            <p>Vstup definuj&iacute;c&iacute; hranice oblast&iacute;, nebo z&oacute;n, kter&eacute; budou sumarizov&aacute;ny.
            </p>
            <p>Vstup může b&yacute;t celoč&iacute;seln&yacute; rastr nebo data prvků. U&nbsp;rastrů jsou z&oacute;ny definov&aacute;ny v&scaron;emi um&iacute;stěn&iacute;mi ve vstupu, kter&aacute; maj&iacute; stejnou hodnotu buňky. U&nbsp;prvků se mohou z&oacute;ny překr&yacute;vat. Oblasti k&nbsp;sobě nemus&iacute; přil&eacute;hat.
            </p>
        </div>
    </div>
    <div id="zoneField">
        <div><h2>Pole zóny</h2></div>
        <hr/>
        <div>
            <p>Pole obsahuj&iacute;c&iacute; hodnoty, kter&eacute; definuj&iacute; každou z&oacute;nu.
            </p>
            <p>Může se jednat o celoč&iacute;seln&eacute; nebo řetězcov&eacute; pole datov&eacute; sady z&oacute;ny.
            </p>
        </div>
    </div>
    <div id="inputValueRaster">
        <div><h2>Zvolte rastr hodnot</h2></div>
        <hr/>
        <div>
            <p>Rastr, kter&yacute; obsahuje hodnoty, na jejichž z&aacute;kladě se vypoč&iacute;t&aacute; statistika.
            </p>
            <p>Může m&iacute;t hodnoty jak v&nbsp;cel&yacute;ch č&iacute;slech, tak v&nbsp;desetinn&yacute;ch č&iacute;slech. Pokud je v&scaron;ak dan&yacute; rastr v&nbsp;desetinn&yacute;ch č&iacute;slech, možnosti pro v&yacute;počet vět&scaron;iny, men&scaron;iny a&nbsp;různorodosti nebudou k&nbsp;dispozici.
            </p>
        </div>
    </div>
    <div id="ignoreNodata">
        <div><h2>Ignorovat ve výpočtech hodnoty NoData (volitelné)</h2></div>
        <hr/>
        <div>
            <p> Určuje, jestli budou hodnoty NoData při anal&yacute;ze ignorov&aacute;ny.
            </p>
            <ul>
                <li>Za&scaron;krtnuto &mdash; Anal&yacute;za bude zahrnovat buňky, kter&eacute; maj&iacute; hodnotu ve vstupn&iacute;m rastru hodnot v&nbsp;jak&eacute;koli konkr&eacute;tn&iacute; z&oacute;ně, a&nbsp;urč&iacute; v&yacute;stupn&iacute; hodnotu pro tuto z&oacute;nu. Buňky s&nbsp;hodnotou NoData v&nbsp;rastru hodnot budou při statistick&eacute;m v&yacute;počtu ignorov&aacute;ny. Jedn&aacute; se o v&yacute;choz&iacute; nastaven&iacute;.
                </li>
                <li>Neza&scaron;krtnuto &mdash; V&yacute;sledkem anal&yacute;zy bude hodnota NoData, pokud jak&eacute;koli buňky rastru hodnot v&nbsp;konkr&eacute;tn&iacute; z&oacute;ně maj&iacute; hodnotu NoData.
                </li>
            </ul>
            
        </div>
    </div>
    <div id="statisticType">
        <div><h2>Typ statistiky (volitelné)</h2></div>
        <hr/>
        <div>
            <p>Určuje typ statistiky, kter&yacute; m&aacute; b&yacute;t vypoč&iacute;t&aacute;n.
            </p>
            <p> Vstup může m&iacute;t podobu jednoho z n&aacute;sleduj&iacute;c&iacute;ch: <b>V&scaron;e</b>, <b>Průměr</b>, <b>Vět&scaron;ina</b>, <b>Maximum</b>, <b>Medi&aacute;n</b>, <b>Minimum</b>, <b>Men&scaron;ina</b>, <b>Percentil</b>, <b>Rozsah</b>, <b>Směrodatn&aacute; odchylka</b>, <b>Součet</b>, <b>Varieta</b>, <b>Minimum a&nbsp;maximum</b>, <b>Průměr a&nbsp;směrodatn&aacute; odchylka</b>, nebo <b>Minimum, maximum a&nbsp;průměr</b>. V&yacute;choz&iacute;m nastaven&iacute;m je možnost <b>V&scaron;e</b>.
            </p>
        </div>
    </div>
    <div id="percentileValues">
        <div><h2>Hodnoty percentilu (volitelné)</h2></div>
        <hr/>
        <div>
            <p>Percentil, kter&yacute; m&aacute; b&yacute;t vypoč&iacute;t&aacute;n. V&yacute;choz&iacute; hodnota je 90, označuj&iacute;c&iacute; 90.&nbsp;percentil.
            </p>
            <p>Hodnota může b&yacute;t v&nbsp;rozsahu od 0 do 100. Zad&aacute;te-li 0.&nbsp;percentil, je v&yacute;sledek v&nbsp;podstatě shodn&yacute; s&nbsp;minim&aacute;ln&iacute; statistikou a&nbsp;zad&aacute;te-li 100.&nbsp;percentil, je v&yacute;sledek shodn&yacute; s&nbsp;maxim&aacute;ln&iacute; statistikou. V&yacute;sledkem hodnoty percentilu 50 budou v&nbsp;podstatě stejn&eacute; v&yacute;sledky jako medi&aacute;nov&eacute; statistiky.
            </p>
            <p> Tento parametr je podporov&aacute;n pouze v&nbsp;př&iacute;padě, pokud je parametr <b>Typ statistiky</b> nastaven na <b>Percentil</b> nebo <b>V&scaron;e</b>.
            </p>
        </div>
    </div>
    <div id="percentileInterpolationType">
        <div><h2>Typ interpolace percentilu (volitelné)</h2></div>
        <hr/>
        <div>
            <p>Určuje metodu interpolace percentilu, kter&aacute; se m&aacute; použ&iacute;t, když je počet hodnot ze vstupn&iacute;ho rastru, kter&eacute; se maj&iacute; poč&iacute;tat, sud&yacute;.
            </p>
            <ul>
                <li>  <b>Automatick&aacute; detekce</b>&mdash;Pokud je vstupn&iacute; hodnota rastru cel&eacute; č&iacute;slo, použije se metoda <b>Nejbliž&scaron;&iacute;</b>. Pokud je vstupn&iacute; hodnota rastru desetinn&eacute; č&iacute;slo, použije se metoda <b>Line&aacute;rn&iacute;</b>. Jedn&aacute; se o v&yacute;choz&iacute; nastaven&iacute;.
                </li>
                <li> <b>Nejbliž&scaron;&iacute;</b>&mdash;U&nbsp;metody Nejbliž&scaron;&iacute; se použije nejbliž&scaron;&iacute; dostupn&aacute; hodnota požadovan&eacute;ho percentilu.
                </li>
                <li> <b>Line&aacute;rn&iacute;</b>&mdash;Použije se v&aacute;žen&yacute; průměr dvou okoln&iacute;ch hodnot z&nbsp;požadovan&eacute;ho percentilu.
                </li>
            </ul>
            
            <p> Tento parametr je podporov&aacute;n pouze v&nbsp;př&iacute;padě, pokud je parametr <b>Typ statistiky</b> nastaven na <b>Percentil</b> nebo <b>V&scaron;e</b>.
            </p>
        </div>
    </div>
    <div id="processAsMultidimensional">
        <div><h2>Zpracovat jako vícerozměrné (volitelné)</h2></div>
        <hr/>
        <div>
            <p>Určuje, jak budou zpracov&aacute;ny vstupn&iacute; v&iacute;cerozměrn&eacute; image služby, pokud jsou v&iacute;cerozměrn&eacute;.
            </p>
            <ul>
                <li>Za&scaron;krtnuto &mdash; Statistiky budou poč&iacute;t&aacute;ny z&nbsp;aktu&aacute;ln&iacute;ho řezu vstupn&iacute; v&iacute;cerozměrn&eacute; datov&eacute; sady. Jedn&aacute; se o v&yacute;choz&iacute; nastaven&iacute;.
                    

                </li>
                <li>Neza&scaron;krtnuto &mdash; Statistiky budou poč&iacute;t&aacute;ny ze&nbsp;v&scaron;ech rozměrů vstupn&iacute; v&iacute;cerozměrn&eacute; datov&eacute; sady.
                </li>
            </ul>
            
        </div>
    </div>
    <div id="outputTableName">
        <div><h2>Název výsledné tabulky</h2></div>
        <hr/>
        <div>
            <p>N&aacute;zev vrstvy, kter&aacute; se vytvoř&iacute; ve složce  <b>Můj obsah</b> a přid&aacute; se do mapy. V&yacute;choz&iacute; n&aacute;zev se ř&iacute;d&iacute; n&aacute;zvem n&aacute;stroje a n&aacute;zvem vstupn&iacute; vrstvy. Pokud vrstva již existuje, budete pož&aacute;d&aacute;ni o zad&aacute;n&iacute; jin&eacute;ho n&aacute;zvu.
            </p>
            <p>Můžete zadat n&aacute;zev složky v  <b>Můj obsah</b>, kde bude v&yacute;sledek uložen pomoc&iacute; rozbalovac&iacute;ho seznamu <b>Uložit v&yacute;sledek do</b> .
            </p>
        </div>
    </div>
</div>
</html>
