<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Reconstruire trasee</h2><p/>
        <h2><img src="../images/GUID-80807DB7-0CA7-4FD8-9702-B4486285D4FC-web.png" alt="Reconstruire trasee"></h2>
        <hr/>
    <p>Acest instrument funcţionează cu un strat tematic legat de timp cu obiecte spaţiale punct sau poligon care reprezintă  <code>instantaneu</code> timpul.   Mai &icirc;nt&acirc;i determină ce obiecte spaţiale aparţin unei urme utiliz&acirc;nd un identificator. Utiliz&acirc;nd timpul &icirc;n fiecare locaţie, traseele sunt ordonate secvenţial şi sunt transformate &icirc;ntr-o linie sau un poligon reprezent&acirc;nd calea deplasării &icirc;n timp. Opţional, intrarea poate fi inclusă &icirc;n buffer printr-un c&acirc;mp, care va crea un poligon &icirc;n fiecare locaţie. Aceste puncte incluse &icirc;n buffer sau dacă intrările sunt poligoane, sunt apoi unite secvenţial pentru a crea un traseu ca poligon &icirc;n care lăţimea reprezintă atributul de interes. Traseele rezultate au oră de &icirc;ncepere şi &icirc;ncheiere, care reprezintă temporal primul şi ultimul obiect spaţial de pe un traseu dat. Atunci c&acirc;nd sunt create trasee, statisticile despre obiectele spaţiale de intrare sunt calculate şi atribuite traseului de ieşire. Cea mai simplă statistică este calculul numărului de puncte din suprafaţă, &icirc;nsă pot fi calculate şi alte statistici.
    </p>
    <p>Obiectele spaţiale din straturile tematice legate de timp pot fi reprezentate &icirc;ntr-unul dintre cele două moduri următoare:
        <ul>
            <li>Instant &ndash; Un singur moment &icirc;n timp
            </li>
            <li>Interval &ndash; Oră de &icirc;ncepere şi de terminare
            </li>
        </ul>
        
    </p>
    <p>De exemplu, să presupunem că aveţi măsurători GPS pentru uragane la fiecare 10 minute. Fiecare măsurătoare GPS &icirc;nregistrează numele, locaţia, ora &icirc;nregistrării şi viteza v&acirc;ntului pentru uragan. Cu aceste informaţii, aţi putea crea trasee pentru fiecare uragan utiliz&acirc;nd numele pentru identificarea traseului şi ar fi generate trasee pentru fiecare uragan. &Icirc;n plus, aţi putea calcula statistici precum viteza medie, maximă şi minimă a v&acirc;ntului pentru fiecare uragan, precum şi numărul de măsurători din fiecare traseu.
    </p>
    <p>Utiliz&acirc;nd acelaşi exemplu, aţi putea include &icirc;n buffer traseele dvs. după viteza v&acirc;ntului. Această acţiune ar include &icirc;n buffer fiecare măsurătoare a c&acirc;mpului de viteză a v&acirc;ntului din respectiva locaţie şi ar uni suprafeţele incluse &icirc;n buffer, cre&acirc;nd o reprezentare poligonală a căii traseului, precum şi modificări ale vitezei v&acirc;ntului pe măsură ce uraganele progresează.   
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputLayer">
        <div><h2>Selectaţi obiectele spaţiale pentru reconstruirea traseelor</h2></div>
        <hr/>
        <div>
            <p>Stratul tematic de puncte sau poligoane care va fi reconstruit &icirc;n trasee.
            </p>
            <p>&Icirc;n afară de a alege un strat tematic din harta dvs., puteţi selecta opţiunile  <b>Răsfoire straturi tematice</b> &icirc;n partea inferioară a listei verticale pentru a răsfoi conţinutul pentru stratul tematic sau setul de date pentru partajarea de fişiere big data.  
            </p>
        </div>
    </div>
    <div id="trackFields">
        <div><h2>Selectaţi câmpurile utilizate pentru identificarea traseelor</h2></div>
        <hr/>
        <div>
            <p> C&acirc;mpurile care reprezintă identificatorul traseului.
            </p>
            <p> De exemplu, dacă aţi reconstrui traseele uraganelor, aţi putea utiliza numele uraganului drept c&acirc;mp de trasee.
            </p>
        </div>
    </div>
    <div id="method">
        <div><h2>Selectaţi metoda utilizată pentru reconstruirea traseelor</h2></div>
        <hr/>
        <div>
            <p>Metoda de unire a traseelor şi de aplicare a bufferului (dacă este cazul). Metoda  <b>Planară</b> poate calcula rezultatele mai rapid, dar nu va &icirc;nfăşura traseele &icirc;n jurul liniei internaţionale de schimbare a datelor şi nu va lua &icirc;n considerare forma reală a păm&acirc;ntului atunci c&acirc;nd face buffering. Metoda <b>Geodezică</b> va &icirc;nfăşura traseele &icirc;n jurul liniei de schimbare a datelor dacă este necesar şi va aplica bufferul geodezic pentru a lua &icirc;n considerare forma reală a păm&acirc;ntului.
            </p>
        </div>
    </div>
    <div id="bufferField">
        <div><h2>Crearea unei expresii pentru plasarea în buffer a obiectelor spaţiale de intrare (opţional)</h2></div>
        <hr/>
        <div>
            <p>Ecuaţie utilizată pentru a calcula distanţa tampon din jurul obiectelor spaţiale de intrare. Această ecuaţie poate fi generată prin utilizarea calculatorului de buffer şi sunt acceptate operaţii de bază precum adunarea, scăderea, &icirc;nmulţirea şi &icirc;mpărţirea. Valorile sunt calculate utiliz&acirc;nd sistemul de coordonate de analiză.
            </p>
        </div>
    </div>
    <div id="timeSplit">
        <div><h2>Selectarea unei ore pentru segregarea traseelor (opţional)</h2></div>
        <hr/>
        <div>
            <p>Timp utilizat pentru a &icirc;mpărţi traseele. Dacă punctele sau poligoanele de intrare au o durată mai lungă &icirc;ntre ele dec&acirc;t segmentul de timp, vor fi &icirc;mpărţite &icirc;n trasee diferite.
            </p>
        </div>
    </div>
    <div id="summaryFields">
        <div><h2>Adăugare statistici (opţional)</h2></div>
        <hr/>
        <div>
            <p> Puteţi calcula statistici despre obiectele spaţiale rezumate. &Icirc;n c&acirc;mpurile numerice puteţi calcula următoarele:
                <ul>
                    <li>Cont
                    </li>
                    <li>Medie
                    </li>
                    <li>Min
                    </li>
                    <li>Max
                    </li>
                    <li>Distanţă
                    </li>
                    <li>Variaţie
                    </li>
                    <li>Deviaţie standard
                    </li>
                </ul>
                
            </p>
            <p>&Icirc;n c&acirc;mpurile de tip şir puteţi calcula următoarele:
                <ul>
                    <li>Cont
                    </li>
                    <li>Oricare - Această statistică este un exemplu aleatoriu al unei valori de tip şir &icirc;n c&acirc;mpul specificat.
                    </li>
                </ul>
                Toate statisticile sunt calculate pentru valori care nu sunt nule. Stratul tematic rezultat va conţine un c&acirc;mp nou pentru fiecare statistică calculată. Se pot adăuga oric&acirc;te statistici aleg&acirc;nd un atribut şi o statistică. 
            </p>
        </div>
    </div>
    <div id="dataStore">
        <div><h2>Selectare depozit de date</h2></div>
        <hr/>
        <div>
            <p>Acesta este un parametru temporar pentru pre-lansare, destinat setării depozitului de date &icirc;n care sunt salvate rezultatele. Ambele depozite de date fac parte din  ArcGIS Data Store. Dacă selectaţi depozitul de date spaţio-temporal dar nu aveţi unul instalat, instrumentul va eşua. </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Nume strat tematic rezultat</h2></div>
        <hr/>
        <div>
            <p> Acesta este numele stratului tematic care va fi creat &icirc;n <b>Resursele mele</b> şi adăugat &icirc;n hartă.  Numele implicit se bazează pe numele instrumentului şi numele stratului tematic de intrare. Dacă stratul tematic există deja, instrumentul va eşua.
            </p>
            <p>Utiliz&acirc;nd caseta derulantă  <b>Salvare rezultat &icirc;n</b>, puteţi specifica numele unui director din <b>Resursele mele</b> &icirc;n care va fi salvat rezultatul.
            </p>
        </div>
    </div>
</div>
</html>
