<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Générer une anomalie multidimensionnelle</h2><p/>
        <h2><img src="../images/GUID-8D54C66F-5C16-4EE5-93E9-80722D10AF12-web.png" alt="G&eacute;n&eacute;rer une anomalie multidimensionnelle"></h2>
        <hr/>
    <p>Calculer l&rsquo;anomalie de chaque tranche d&rsquo;un raster multidimensionnel existant afin de cr&eacute;er un nouveau raster multidimensionnel.
    </p>
    <p>Une anomalie correspond &agrave; l&rsquo;&eacute;cart d&rsquo;une observation par rapport &agrave; sa valeur type, moyenne ou m&eacute;diane.
    </p>
    <p>Cet outil calcule les anomalies dans le temps pour une ou plusieurs variables dans un raster multidimensionnel. Si vous poss&eacute;dez une dimension non temporelle en plus d&rsquo;une dimension temporelle, l&rsquo;anomalie sera calcul&eacute;e &agrave; chaque pas dans la dimension suppl&eacute;mentaire.
    </p>
    <p>Par exemple, vous disposez de donn&eacute;es de temp&eacute;rature des oc&eacute;ans mensuelles, collect&eacute;es tous les m&egrave;tres jusqu&rsquo;&agrave; 100&nbsp;m&egrave;tres de profondeur, et vous souhaitez calculer les anomalies de temp&eacute;rature en tant qu&rsquo;&eacute;carts par rapport &agrave; la moyenne annuelle. Cet outil d&eacute;termine les anomalies de temp&eacute;rature en fonction d&rsquo;une moyenne annuelle si vous indiquez  <b>Yearly (Annuel)</b> dans <b>temporal interval to calculate the mean (intervalle temporel pour le calcul de la moyenne)</b>, et il renvoie des valeurs d&rsquo;anomalie pour chacune des 100&nbsp;profondeurs.
    </p>
    <p>Cet outil ne prend en charge que les jeux de donn&eacute;es raster multidimensionnelles qui poss&egrave;dent une dimension temporelle.
    </p>
    <p>Si l&rsquo;option  <b>Use current map extent (Utiliser l&rsquo;&eacute;tendue courante de la carte)</b> est s&eacute;lectionn&eacute;e, les variables de la couche qui sont visibles au sein de l&rsquo;&eacute;tendue courante de la carte seront analys&eacute;es. Si cette option n&rsquo;est pas s&eacute;lectionn&eacute;e, les variables de toute la couche sont analys&eacute;es, m&ecirc;me si elles se trouvent en dehors de l&rsquo;&eacute;tendue courante de la carte.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputMultidimensionalRaster">
        <div><h2>Choisir la couche d’imagerie multidimensionnelle à utiliser pour générer une anomalie</h2></div>
        <hr/>
        <div>
            <p>Couche d&rsquo;imagerie en entr&eacute;e d&rsquo;un jeu de donn&eacute;es raster multidimensionnelles.
            </p>
        </div>
    </div>
    <div id="variables">
        <div><h2>Choisir la ou les variables pour lesquelles des anomalies seront générées</h2></div>
        <hr/>
        <div>
            <p>La variable ou les variables pour lesquelles des anomalies sont calcul&eacute;es. Si aucune variable n&rsquo;est sp&eacute;cifi&eacute;e, toutes les variables avec une dimension temporelle sont analys&eacute;es.
            </p>
        </div>
    </div>
    <div id="method">
        <div><h2>Choisir la méthode de génération des anomalies</h2></div>
        <hr/>
        <div>
            <p>Sp&eacute;cifie la m&eacute;thode &agrave; utiliser pour calculer l&rsquo;anomalie.
                <ul>
                    <li> <b>Difference From Mean (Diff&eacute;rence par rapport &agrave; la moyenne)</b>&nbsp;: la diff&eacute;rence entre une valeur de pixel et la moyenne des valeurs de ce pixel dans les tranches d&eacute;finies par l&rsquo;intervalle est calcul&eacute;e. Il s&rsquo;agit de l&rsquo;option par d&eacute;faut.
                    </li>
                    <li> <b>Percent Difference From Mean (Diff&eacute;rence en pourcentage par rapport &agrave; la moyenne)</b>&nbsp;: la diff&eacute;rence en pourcentage entre une valeur de pixel et la moyenne des valeurs de ce pixel dans les tranches d&eacute;finies par l&rsquo;intervalle est calcul&eacute;e.
                    </li>
                    <li> <b>Percent of Mean (Pourcentage de la moyenne)</b>&nbsp;: le pourcentage de la moyenne est calcul&eacute;.
                    </li>
                    <li> <b>Z Score (Score&nbsp;Z)</b>&nbsp;: le score&nbsp;z de chaque pixel est calcul&eacute;. Un score&nbsp;z de 0 indique que la valeur du pixel est identique &agrave; la moyenne. Un score&nbsp;z de 1 indique que la valeur du pixel pr&eacute;sente un &eacute;cart type de 1 par rapport &agrave; la moyenne. Si le score&nbsp;z est de 2, la valeur du pixel pr&eacute;sente un &eacute;cart type de 2 par rapport &agrave; la moyenne, et ainsi de suite.
                    </li>
                    <li> <b>Difference From Median (Diff&eacute;rence par rapport &agrave; la m&eacute;diane)</b>&nbsp;: la diff&eacute;rence entre une valeur de pixel et la m&eacute;diane math&eacute;matique de ce pixel dans les tranches d&eacute;finies par l&rsquo;intervalle est calcul&eacute;e.
                    </li>
                    <li> <b>Percent Difference From Median (Diff&eacute;rence en pourcentage par rapport &agrave; la m&eacute;diane)</b>&nbsp;: la diff&eacute;rence en pourcentage entre une valeur de pixel et la m&eacute;diane math&eacute;matique des valeurs de ce pixel dans les tranches d&eacute;finies par l&rsquo;intervalle est calcul&eacute;e.
                    </li>
                    <li> <b>Percent of Median (Pourcentage de la m&eacute;diane)</b>&nbsp;: le pourcentage de la m&eacute;diane math&eacute;matique est calcul&eacute;.
                    </li>
                </ul>
                
            </p>
            <p>Les m&eacute;thodes math&eacute;matiques de calcul des valeurs d&rsquo;anomalie sont r&eacute;pertori&eacute;es ci-dessous. Les anomalies peuvent &ecirc;tre calcul&eacute;es en utilisant soit la moyenne soit les valeurs m&eacute;dianes comme d&eacute;finition de la moyenne. Si la distribution de donn&eacute;es est inclin&eacute;e, la moyenne peut &ecirc;tre consid&eacute;rablement influenc&eacute;e par les points aberrants, il est donc conseill&eacute; d&rsquo;utiliser la m&eacute;thode de valeur m&eacute;diane ou de score&nbsp;z pour ce type de donn&eacute;es.
            </p>
            <p>
                <ul>
                    <li>Diff&eacute;rence par rapport &agrave; la moyenne = x - &micro;
                        <ul>
                            <li>x = valeur du pixel dans une tranche
                                

                            </li>
                            <li>&micro; = moyenne des valeurs de ce pixel pendant l&rsquo;intervalle temporel indiqu&eacute;
                                

                            </li>
                        </ul>
                        
                        

                    </li>
                    <li>Diff&eacute;rence en pourcentage par rapport &agrave; la moyenne = |x - &micro;| / [(x + &micro;)/2]
                        <ul>
                            <li>x = valeur du pixel dans une tranche
                                

                            </li>
                            <li>&micro; = moyenne des valeurs de ce pixel pendant l&rsquo;intervalle temporel indiqu&eacute;
                                

                            </li>
                            <li>|x - &micro;| = valeur absolue de la diff&eacute;rence entre la valeur et la moyenne
                                

                            </li>
                        </ul>
                        
                        

                    </li>
                    <li>Pourcentage de la moyenne = x / &micro;
                        <ul>
                            <li>x = valeur du pixel dans une tranche
                                

                            </li>
                            <li>&micro; = moyenne des valeurs de ce pixel pendant l&rsquo;intervalle temporel indiqu&eacute;
                                

                            </li>
                        </ul>
                        
                    </li>
                    <li>Diff&eacute;rence par rapport &agrave; la m&eacute;diane = x - &szlig;
                        <ul>
                            <li>x = valeur du pixel dans une tranche
                            </li>
                            <li>&szlig; = m&eacute;diane des valeurs de ce pixel pendant l&rsquo;intervalle temporel indiqu&eacute;
                            </li>
                        </ul>
                        
                    </li>
                    <li>Diff&eacute;rence en pourcentage par rapport &agrave; la m&eacute;diane = |x - &szlig;| / [(x + &szlig;)/2]
                        <ul>
                            <li>x = valeur du pixel dans une tranche
                            </li>
                            <li>&szlig; = m&eacute;diane des valeurs de ce pixel pendant l&rsquo;intervalle temporel indiqu&eacute;
                            </li>
                            <li>|x - &szlig;| = valeur absolue de la diff&eacute;rence entre la valeur et la m&eacute;diane
                            </li>
                        </ul>
                        
                    </li>
                    <li>Pourcentage de la m&eacute;diane = x / &szlig;
                        <ul>
                            <li>x = valeur du pixel dans une tranche
                            </li>
                            <li>&szlig; = m&eacute;diane des valeurs de ce pixel pendant l&rsquo;intervalle temporel indiqu&eacute;
                            </li>
                        </ul>
                        
                    </li>
                    <li>Score&nbsp;z = (x - &micro;) / S
                        <ul>
                            <li>x = valeur du pixel dans une tranche
                            </li>
                            <li>&micro; = moyenne des valeurs de ce pixel pendant l&rsquo;intervalle temporel indiqu&eacute;
                            </li>
                            <li>S = &eacute;cart type des valeurs du pixel pendant l&rsquo;intervalle temporel indiqu&eacute;
                            </li>
                        </ul>
                        
                        

                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="calculationInterval">
        <div><h2>Choisir un intervalle temporel pour calculer la moyenne</h2></div>
        <hr/>
        <div>
            <p>Sp&eacute;cifie l&rsquo;intervalle temporel &agrave; utiliser pour calculer la moyenne.
                <ul>
                    <li> <b>All (Tout)</b>&nbsp;: calcule la moyenne des valeurs d&rsquo;un pixel sur toutes les tranches pour chaque pixel.
                    </li>
                    <li> <b>Yearly (Annuel)</b>&nbsp;: calcule la moyenne annuelle pour chaque pixel.
                    </li>
                    <li> <b>Recurring Monthly (Tous les mois)</b>&nbsp;: calcule la moyenne mensuelle pour chaque pixel.
                    </li>
                    <li> <b>Recurring Weekly (Toutes les semaines)</b>&nbsp;: calcule la moyenne hebdomadaire pour chaque pixel.
                    </li>
                    <li> <b>Recurring Daily (Tous les jours)</b>&nbsp;: calcule la moyenne quotidienne pour chaque pixel.
                    </li>
                    <li> <b>Hourly (Toutes les heures)</b>&nbsp;: calcule la moyenne horaire pour chaque pixel.
                    </li>
                    <li> <b>External Raster (Raster externe)</b>&nbsp;: un jeu de donn&eacute;es raster existant qui contient la valeur moyenne ou m&eacute;diane pour chaque pixel est r&eacute;f&eacute;renc&eacute;.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="referenceMeanRaster">
        <div><h2>Choisir la couche d’imagerie de la moyenne comme référence</h2></div>
        <hr/>
        <div>
            <p>Sp&eacute;cifie le jeu de donn&eacute;es raster de r&eacute;f&eacute;rence contenant une moyenne pr&eacute;alablement calcul&eacute;e pour chaque pixel. Les anomalies sont calcul&eacute;es en comparaison avec cette moyenne.
            </p>
        </div>
    </div>
    <div id="ignoreNodata">
        <div><h2>Ignorer les valeurs manquantes dans le calcul</h2></div>
        <hr/>
        <div>
            <p>Sp&eacute;cifie si les valeurs manquantes sont ignor&eacute;es lors de l&rsquo;analyse.
                <ul>
                    <li>Activ&eacute;&nbsp;: l&rsquo;analyse inclut tous les pixels valides selon une dimension donn&eacute;e et ignore les pixels NoData. Il s&rsquo;agit de l&rsquo;option par d&eacute;faut.
                    </li>
                    <li>D&eacute;sactiv&eacute;&nbsp;: le r&eacute;sultat de l&rsquo;analyse est NoData s&rsquo;il existe des valeurs NoData pour le pixel le long de la dimension donn&eacute;e.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Nom de la couche de résultat</h2></div>
        <hr/>
        <div>
            
            <p>Le nom de la couche qui sera cr&eacute;&eacute;e dans la page  <b>My Content (Mon contenu)</b> et ajout&eacute;e &agrave; la carte. Le nom par d&eacute;faut repose sur le nom de l'outil et sur le nom de la couche en entr&eacute;e. Si la couche existe d&eacute;j&agrave;, vous &ecirc;tes invit&eacute; &agrave; fournir un autre nom.
            </p>
            <p>Vous pouvez sp&eacute;cifier le nom d&rsquo;un dossier dans  <b>My Content (Mon contenu)</b>, dans lequel le r&eacute;sultat sera enregistr&eacute; via la zone de liste d&eacute;roulante <b>Save result in (Enregistrer le r&eacute;sultat dans)</b>. Si vous avez les privilèges permettant de créer des couches tuilées et d’images dynamiques, vous pouvez spécifier le type de couche à générer en sortie à l’aide de la zone déroulante Save result as (Enregistrer le résultat sous). </p>
        </div>
    </div>
</div>
</html>
