<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Synthétiser - A l'intérieur</h2><p/>
        <h2><img src="../images/GUID-90E0CB1F-EB97-4752-B2EE-452B7B45475E-web.png" alt="Synth&eacute;tiser - A l'int&eacute;rieur"></h2>
        <hr/>
    <p>Cet outil recherche les entit&eacute;s (et parties d'entit&eacute;s) qui se trouvent au sein des limites des surfaces dans la premi&egrave;re couche en entr&eacute;e.  
        <ul>
            <li>En prenant une couche de limites de bassin versant et une couche de limites d'utilisation du sol, calculez la superficie totale du type d'utilisation du sol pour chaque bassin versant. 
            </li>
            <li>En prenant une couche de parcelles dans un comt&eacute; et une couche de limites de ville, synth&eacute;tisez la valeur moyenne des parcelles vacantes au sein de chaque limite de ville.
            </li>
        </ul>
        
    </p>
    <p>Si l'option  <b>Utiliser l'&eacute;tendue courante de la carte</b> est s&eacute;lectionn&eacute;e, seules les entit&eacute;s de la couche en entr&eacute;e et de la couche &agrave; synth&eacute;tiser qui sont visibles au sein de l'&eacute;tendue courante de la carte seront analys&eacute;es.  Si l'option n'est pas s&eacute;lectionn&eacute;e, toutes les entit&eacute;s qui se trouvent &agrave; la fois dans la couche en entr&eacute;e et dans la couche &agrave; synth&eacute;tiser seront analys&eacute;es, m&ecirc;me si elles se trouvent en dehors de l'&eacute;tendue courante de la carte.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="sumWithinLayer">
        <div><h2>Choisissez une couche surfacique pour synthétiser d'autres entités au sein de ses limites</h2></div>
        <hr/>
        <div>
            <p>La couche surfacique qui sera utilis&eacute;e pour synth&eacute;tiser des entit&eacute;s comprises au sein de ses limites. Vous pouvez proc&eacute;der &agrave; une synth&egrave;se dans une couche de polygones que vous sp&eacute;cifiez ou dans des groupes hexagonaux ou carr&eacute;s qui sont g&eacute;n&eacute;r&eacute;s pendant l'ex&eacute;cution de l'outil.  Lors de la g&eacute;n&eacute;ration des groupes, pour  <b>Carr&eacute;</b>, le nombre et les unit&eacute;s sp&eacute;cifi&eacute;s d&eacute;terminent la hauteur et la longueur du carr&eacute;. Pour <b>Hexagone</b>, le nombre et les unit&eacute;s sp&eacute;cifi&eacute;s d&eacute;terminent la distance entre les c&ocirc;t&eacute;s parall&egrave;les.
            </p>
            <p>L'analyse &agrave; l'aide de groupes  <b>carr&eacute;s</b> ou <b>hexagonaux</b> requiert un syst&egrave;me de coordonn&eacute;es projet&eacute;es. Vous pouvez d&eacute;finir le <b>syst&egrave;me de coordonn&eacute;es de traitement</b> dans <b>Environnements d'analyse</b>. Si votre syst&egrave;me de coordonn&eacute;es de traitement n'est pas d&eacute;fini sur un syst&egrave;me de coordonn&eacute;es projet&eacute;es, vous &ecirc;tes invit&eacute; &agrave; le configurer lorsque vous <b>ex&eacute;cutez l'analyse</b>.
            </p>
            <p>En plus de choisir une couche de votre carte, vous pouvez s&eacute;lectionner  <b>Parcourir les couches</b> au bas de la liste d&eacute;roulante pour parcourir votre contenu et rechercher une couche d'entit&eacute;s ou un jeu de donn&eacute;es de partage de fichiers Big Data.
            </p>
        </div>
    </div>
    <div id="summaryLayer">
        <div><h2>Choisir la couche à synthétiser</h2></div>
        <hr/>
        <div>
            <p>Les entit&eacute;s de cette couche qui se trouvent au sein des limites des entit&eacute;s de la couche en entr&eacute;e, ou les groupes sp&eacute;cifi&eacute;s ci-dessus, seront synth&eacute;tis&eacute;s. 
            </p>
            <p>En plus de choisir une couche de votre carte, vous pouvez s&eacute;lectionner  <b>Parcourir les couches</b> au bas de la liste d&eacute;roulante pour parcourir votre contenu et rechercher une couche d'entit&eacute;s ou un jeu de donn&eacute;es de partage de fichiers Big Data.
            </p>
        </div>
    </div>
    <div id="inputBins">
        <div><h2>Choisir une distance pour générer les groupes et dans laquelle effectuer l'agrégation</h2></div>
        <hr/>
        <div>
            <p>Distance utilis&eacute;e pour g&eacute;n&eacute;rer des groupes.  
            </p>
            <p>La  <b>taille du groupe</b> pour les groupes ou une <b>couche surfacique</b> doit &ecirc;tre d&eacute;finie.
            </p>
        </div>
    </div>
    <div id="timeSlicing">
        <div><h2>Agréger à l'aide des tranches horaires (facultatif)</h2></div>
        <hr/>
        <div>
            <p>Si le temps est activ&eacute; sur la couche ponctuelle en entr&eacute;e et qu'il est de type instantan&eacute;, vous pouvez effectuer l'analyse &agrave; l'aide des intervalles temporels. Vous pouvez d&eacute;finir trois param&egrave;tres lorsque vous utilisez le temps&nbsp;:
                <ul>
                    <li> <b>Intervalle temporel</b>
                    </li>
                    <li> <b>Fr&eacute;quence de r&eacute;p&eacute;tition de l'intervalle</b>
                    </li>
                    <li> <b>Heure sur laquelle aligner les intervalles temporels</b>
                    </li>
                </ul>
                
            </p>
            <p>Imaginez que vous poss&eacute;dez des donn&eacute;es repr&eacute;sentant une ann&eacute;e et que vous voulez effectuer une analyse &agrave; l'aide des intervalles temporels. Pour ce faire, vous d&eacute;finissez  <b>Intervalle temporel</b> sur <code>1&nbsp;semaine</code>.
            </p>
            <p>Imaginez que vous poss&eacute;dez des donn&eacute;es repr&eacute;sentant une ann&eacute;e et que vous voulez effectuer une analyse &agrave; l'aide de la premi&egrave;re semaine du mois. Pour ce faire, vous d&eacute;finissez  <b>Intervalle temporel</b> sur <code>1&nbsp;semaine</code>, <b>Fr&eacute;quence de r&eacute;p&eacute;tition de l'intervalle</b> sur <code>1&nbsp;mois</code> et <b>Heure sur laquelle aligner les intervalles temporels</b> sur <code>1er&nbsp;janvier &agrave; 12&nbsp;h&nbsp;00</code>.
            </p>
        </div>
    </div>
    <div id="timeInterval">
        <div><h2>Intervalle temporel dans lequel effectuer l'agrégation</h2></div>
        <hr/>
        <div>
            <p>Intervalle de temps utilis&eacute; pour g&eacute;n&eacute;rer des intervalles temporels. Un intervalle temporel peut &ecirc;tre utilis&eacute; seul ou avec les param&egrave;tres  <b>Fr&eacute;quence de r&eacute;p&eacute;tition de l'intervalle</b> ou <b>Heure sur laquelle aligner les intervalles temporels</b>.
            </p>
            <p>Pour cr&eacute;er des tranches horaires qui ont lieu tous les lundis de 9&nbsp;h&nbsp;00 &agrave; 10&nbsp;h&nbsp;00, d&eacute;finissez  <b>Intervalle temporel</b> sur <code>1&nbsp;heure</code>, <b>Fr&eacute;quence de r&eacute;p&eacute;tition de l'intervalle</b> sur <code>1&nbsp;semaine</code> et <b>Heure sur laquelle aligner les intervalles temporels</b> sur <code>9&nbsp;h&nbsp;00 un lundi</code>.
            </p>
        </div>
    </div>
    <div id="timeStep">
        <div><h2>Phase dans laquelle effectuer l'agrégation</h2></div>
        <hr/>
        <div>
            <p> Intervalle utilis&eacute; pour calculer une tranche horaire. Le param&egrave;tre <b>Fr&eacute;quence de r&eacute;p&eacute;tition de l'intervalle</b> peut &ecirc;tre utilis&eacute; seul ou avec <b>Intervalle temporel</b>, avec <b>Heure de r&eacute;f&eacute;rence</b>, ou avec &agrave; la fois <b>Intervalle temporel</b> et <b>Heure sur laquelle aligner les intervalles temporels</b>.
            </p>
            <p> Pour cr&eacute;er des tranches horaires qui ont lieu tous les lundis de 9&nbsp;h&nbsp;00 &agrave; 10&nbsp;h&nbsp;00, d&eacute;finissez <b>Intervalle temporel</b> sur <code>1&nbsp;heure</code>, <b>Fr&eacute;quence de r&eacute;p&eacute;tition de l'intervalle</b> sur <code>1&nbsp;semaine</code> et <b>Heure sur laquelle aligner les intervalles temporels</b> sur <code>9&nbsp;h&nbsp;00 un lundi</code>.
            </p>
        </div>
    </div>
    <div id="timeReference">
        <div><h2>Heure de référence permettant d'aligner les tranches horaires</h2></div>
        <hr/>
        <div>
            <p>La date et l'heure utilis&eacute;es pour aligner les tranches horaires. Les intervalles temporels commencent &agrave; partir de cette heure et progressent vers le pass&eacute;. Si aucune heure de r&eacute;f&eacute;rence n'est s&eacute;lectionn&eacute;e, les intervalles temporels s'alignent sur le 1er&nbsp;janvier&nbsp;1970. 
            </p>
            <p> Pour cr&eacute;er des tranches horaires qui ont lieu tous les lundis de 9&nbsp;h&nbsp;00 &agrave; 10&nbsp;h&nbsp;00, d&eacute;finissez <b>Intervalle temporel</b> sur <code>1&nbsp;heure</code>, <b>Fr&eacute;quence de r&eacute;p&eacute;tition de l'intervalle</b> sur <code>1&nbsp;semaine</code> et <b>Heure sur laquelle aligner les intervalles temporels</b> sur <code>9&nbsp;h&nbsp;00 un lundi</code>.
            </p>
        </div>
    </div>
    <div id="summaryFields">
        <div><h2>Ajouter des statistiques (facultatif)</h2></div>
        <hr/>
        <div>
            <p> Vous pouvez calculer des statistiques sur des entit&eacute;s synth&eacute;tis&eacute;es. Dans les champs num&eacute;riques, vous pouvez calculer ce qui suit&nbsp;:
                <ul>
                    <li>Total&nbsp;: calcule le nombre de valeurs non Null. Peut &ecirc;tre utilis&eacute; sur des champs num&eacute;riques ou des cha&icirc;nes. Le total de [Null, 0, 2] est &eacute;gal &agrave; 2.
                    </li>
                    <li>Somme&nbsp;: somme des valeurs num&eacute;riques dans un champ. La somme de [Null, 0, 3] est &eacute;gale &agrave; 3.
                    </li>
                    <li>Moyenne&nbsp;: moyenne des valeurs num&eacute;riques. La moyenne de [0, 2, Null] est &eacute;gale &agrave; 1.
                    </li>
                    <li>Min&nbsp;: valeur minimale d'un champ num&eacute;rique. La valeur minimale de [0, 2, Null] est &eacute;gale &agrave; 0. 
                    </li>
                    <li>Max&nbsp;: valeur maximale d'un champ num&eacute;rique. La valeur maximale de [0, 2, Null] est &eacute;gale &agrave; 2.
                    </li>
                    <li>Plage&nbsp;: plage d'un champ num&eacute;rique. Elle est calcul&eacute;e pour correspondre aux valeurs minimales soustraites de la valeur maximale. La plage de [0, Null, 1] est &eacute;gale &agrave; 1. La plage de [Null, 4] est &eacute;gale &agrave; 0.
                    </li>
                    <li>Variance&nbsp;: variance d'un champ num&eacute;rique dans une piste. La variance de [1] est la valeur Null. La variance de [Null, 1,1, 1] est &eacute;gale &agrave; 1.
                    </li>
                    <li>Ecart type&nbsp;: &eacute;cart type d'un champ num&eacute;rique. L'&eacute;cart type de [1] est la valeur Null. L'&eacute;cart type de [Null, 1,1, 1] est &eacute;gale &agrave; 1. 
                    </li>
                </ul>
                
            </p>
            <p>Dans les champs de cha&icirc;ne, vous pouvez calculer ce qui suit&nbsp;:
                <ul>
                    <li>Total&nbsp;: le nombre de cha&icirc;nes diff&eacute;rentes de la valeur Null.
                    </li>
                    <li>Tout&nbsp;: cette statistique est un &eacute;chantillon al&eacute;atoire d'une valeur de cha&icirc;ne dans le champ sp&eacute;cifi&eacute;.
                    </li>
                </ul>
                Toutes les statistiques sont calcul&eacute;es sur des valeurs non nulles. La couche obtenue contient un nouveau champ pour chaque statistique calcul&eacute;e. Vous pouvez ajouter des statistiques en choisissant un attribut et une statistique. 
            </p>
            <p>Outre ces statistiques, des statistiques proportionnelles seront calcul&eacute;es sur tous les champs num&eacute;riques&nbsp;:
                <ul>
                    <li>Total&nbsp;: total de chaque champ multipli&eacute; par la proportion de la couche de synth&egrave;se figurant dans les polygones. 
                    </li>
                    <li>Somme&nbsp;: somme des valeurs pond&eacute;r&eacute;es de chaque champ. Lorsque la pond&eacute;ration appliqu&eacute;e correspond &agrave; la proportion de la couche de synth&egrave;se figurant dans les polygones.
                    </li>
                    <li>Moyenne&nbsp;: moyenne pond&eacute;r&eacute;e des valeur de chaque champ. Lorsque la pond&eacute;ration appliqu&eacute;e correspond &agrave; la proportion de la couche de synth&egrave;se figurant dans les polygones.
                    </li>
                    <li>Min&nbsp;: minimum des valeurs pond&eacute;r&eacute;es de chaque champ. Lorsque la pond&eacute;ration appliqu&eacute;e correspond &agrave; la proportion de la couche de synth&egrave;se figurant dans les polygones.
                    </li>
                    <li>Max&nbsp;: maximum des valeurs pond&eacute;r&eacute;es de chaque champ. Lorsque la pond&eacute;ration appliqu&eacute;e correspond &agrave; la proportion de la couche de synth&egrave;se figurant dans les polygones.
                    </li>
                    <li>Plage&nbsp;: diff&eacute;rence entre les valeurs pond&eacute;r&eacute;es maximum et minimum.
                    </li>
                </ul>
                
            </p>
            <p>Selon les types d'entit&eacute;s que vous synth&eacute;tisez, le nombre total de points &agrave; proximit&eacute;, la longueur totale des lignes ou la surface totale seront calcul&eacute;s.
            </p>
        </div>
    </div>
    <div id="spatialReference">
        <div><h2>Référence spatiale (wkid)</h2></div>
        <hr/>
        <div>
            <p>Il s'agit d'un param&egrave;tre temporaire de la version pr&eacute;liminaire qui permet de d&eacute;finir la r&eacute;f&eacute;rence spatiale de traitement. De nombreux outils Big Data n&eacute;cessitent l'utilisation d'un syst&egrave;me de coordonn&eacute;es projet&eacute;es comme r&eacute;f&eacute;rence spatiale pour le traitement. Par d&eacute;faut, l'outil utilise le syst&egrave;me de coordonn&eacute;es en entr&eacute;e, mais &eacute;choue s'il s'agit d'un syst&egrave;me de coordonn&eacute;es g&eacute;ographiques. Pour d&eacute;finir un syst&egrave;me de coordonn&eacute;es projet&eacute;es, saisissez le WKID. Par exemple,  <b>Web Mercator</b> est saisi sous la forme <code>3857</code>.
            </p>
        </div>
    </div>
    <div id="dataStore">
        <div><h2>Choisir un stockage des données</h2></div>
        <hr/>
        <div>
            <p>Les r&eacute;sultats de l'outil GeoAnalytic sont stock&eacute;s dans une instance ArcGIS Data Store et s'affichent en tant que couche d'entit&eacute;s dans  Portal for ArcGIS. Dans la plupart des cas, les r&eacute;sultats doivent &ecirc;tre stock&eacute;s dans le stockage des donn&eacute;es spatio-temporelles, ce qui est le param&egrave;tre par d&eacute;faut. Dans certains cas, il peut &ecirc;tre judicieux d'enregistrer les r&eacute;sultats dans un stockage des donn&eacute;es relationnelles. Voici les raisons pour lesquelles stocker les r&eacute;sultats dans le stockage des donn&eacute;es relationnelles&nbsp;: 
                <ul>
                    <li>Utiliser vos r&eacute;sultats dans une collaboration de portail &agrave; portail.
                    </li>
                    <li>Activer les fonctionnalit&eacute;s de synchronisation avec vos r&eacute;sultats.
                    </li>
                </ul>
                
            </p>
            <p>Vous ne devez pas utiliser le stockage des donn&eacute;es relationnelles si vous pensez que vos r&eacute;sultats GeoAnalytics vont augmenter et que vous devez tirer part des fonctionnalit&eacute;s du stockage de Big Data spatio-temporelles pour g&eacute;rer les grands volumes de donn&eacute;es. 
            </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Nom de la couche de résultat</h2></div>
        <hr/>
        <div>
            <p> Il s&rsquo;agit du nom de la couche qui sera sur dans votre page <b>My Content (Mon contenu)</b> et ajout&eacute;e &agrave; la carte. Le nom par d&eacute;faut repose sur le nom de l'outil et sur le nom de la couche en entr&eacute;e. Si la couche existe d&eacute;j&agrave;, l'outil &eacute;choue.
            </p>
            <p>La zone de liste d&eacute;roulante  <b>Save result in (Enregistrer le r&eacute;sultat dans)</b> vous permet de sp&eacute;cifier le nom d&rsquo;un dossier dans <b>My content (Mon contenu)</b> o&ugrave; le r&eacute;sultat sera enregistr&eacute;.
            </p>
        </div>
    </div>
</div>
</html>
