<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Vytvoriť oblasti dojazdového času</h2><p/>
        <h2><img src="../images/GUID-6F629A09-768D-4C04-88A4-AB941811ADE9-web.png" alt="Vytvoriť oblasti dojazdov&eacute;ho času"></h2>
        <hr/>
    <p>Vytvorenie oblast&iacute; dojazdov&eacute;ho času vytvor&iacute; oblasti, ktor&eacute; je možn&eacute; dosiahnuť v r&aacute;mci určen&eacute;ho času jazdy, jazdnej vzdialenosti, pe&scaron;ej vzdialenosti atď. Meria sa od jedn&eacute;ho alebo viacer&yacute;ch bodov (až 1000) po cest&aacute;ch alebo pe&scaron;&iacute;ch z&oacute;nach a vytvor&iacute; vrstvu, ktor&aacute; v&aacute;m pom&ocirc;že zodpovedať ot&aacute;zky ako:
        <ul>
            <li>Kam m&ocirc;žem d&ocirc;jsť v r&aacute;mci 30-min&uacute;tovej jazdy?
            </li>
            <li>Kam m&ocirc;žem d&ocirc;jsť v r&aacute;mci 30-min&uacute;tovej jazdy o 17:30 počas dopravnej &scaron;pičky?
            </li>
            <li>Čo sa nach&aacute;dza v r&aacute;mci dvoch kilometrov pe&scaron;o od m&ocirc;jho hotela?
            </li>
            <li>Ktor&eacute; oblasti mesta m&ocirc;žu hasiči dosiahnuť za p&auml;ť min&uacute;t jazdy?
            </li>
            <li>Ako by sa pokrytie hasičskej odozvy zlep&scaron;ilo postaven&iacute;m novej hasičskej stanice na tomto mieste?
            </li>
            <li>Ak&eacute; oblasti trhu pokr&yacute;va m&ocirc;j podnik?
            </li>
        </ul>
        
    </p>
    <p>Možno budete vedieť odpovedať na svoje ot&aacute;zky len prostredn&iacute;ctvom vizualiz&aacute;cie t&yacute;chto oblast&iacute;. Pr&iacute;padne m&ocirc;žete pomocou v&yacute;stupn&yacute;ch oblast&iacute; vykonať ďal&scaron;iu priestorov&uacute; anal&yacute;zu. Napr&iacute;klad v&yacute;počet agreg&aacute;cie bodov pomocou oblast&iacute; dostupnosti autom s demografick&yacute;mi &uacute;dajmi m&ocirc;že pom&ocirc;cť určiť, ktor&aacute; potenci&aacute;lna lokalita obchodu by pravdepodobne poskytla najlep&scaron;iu z&aacute;kazn&iacute;cku z&aacute;kladňu pre v&aacute;&scaron; typ podnikania.
    </p>
    <p>
        <table>
        <tr><td colspan="3"><hr size="1" noshade="noshade"></td></tr>
        <tr><td valign="baseline"><img src="../images/tip.png"></td><td valign="baseline"><h2>Tip:&ensp;</h2></td>
        <td valign="baseline">
            <p>Na vytvorenie oblast&iacute; použit&iacute;m priamočiarej vzdialenosti, namiesto merania po cest&aacute;ch, použite n&aacute;stroj Create Buffers.
            </p>
        </td></tr>
        <tr><td colspan="3"><hr size="1" noshade="noshade"></td></tr>
        </table>
    </p>
    <p>Ak je za&scaron;krtnut&eacute;  <b>Použiť aktu&aacute;lny rozsah mapy</b>, na vytvorenie oblast&iacute; podľa času alebo vzdialenosti jazdy sa použij&uacute; iba prvky, ktor&eacute; s&uacute; viditeľn&eacute; v r&aacute;mci aktu&aacute;lneho rozsahu mapy. Ak nie je za&scaron;krtnut&eacute;, bud&uacute; použit&eacute; v&scaron;etky prvky vstupnej vrstvy, aj pokiaľ s&uacute; mimo aktu&aacute;lneho rozsahu mapy.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputLayer">
        <div><h2>Vybrať vrstvu bodov pre kalkuláciu oblasti podľa času jazdy v okolí</h2></div>
        <hr/>
        <div>
            <p>Bodov&eacute; prvky, okolo ktor&yacute;ch sa bud&uacute; poč&iacute;tať oblasti. M&ocirc;žete vybrať ako bud&uacute; oblasti vypoč&iacute;tan&eacute; na z&aacute;klade cestovn&eacute;ho režimu (jazda, n&aacute;kladn&aacute; preprava alebo ch&ocirc;dza) a merania (čas alebo vzdialenosť).
            </p>
            <p>Navy&scaron;e k v&yacute;beru vrstvy va&scaron;ej mapy, m&ocirc;žete zvoliť  <b>Vybrať analytick&uacute; vrstvu</b>, ktor&aacute; je na spodku rozbalen&eacute;ho zoznamu. T&aacute;to možnosť otv&aacute;ra gal&eacute;riu, kde m&ocirc;žete prehľad&aacute;vať a zvoliť d&aacute;tov&uacute; sadu z r&ocirc;znych zdrojov na použitie vo va&scaron;ej anal&yacute;ze. 
            </p>
            <p>N&aacute;stroj podporuje vy&scaron;e 1000 prvkov vo vstupnej vrstve.
            </p>
        </div>
    </div>
    <div id="MeasurementMethod">
        <div><h2>Zmerať</h2></div>
        <hr/>
        <div>
            <p>Vyberte v&aacute;&scaron; cestovn&yacute; režim (jazda, n&aacute;kladn&aacute; preprava alebo ch&ocirc;dza) a typ merania (čas alebo vzdialenosť). Dostupn&eacute; cestovn&eacute; režimy s&uacute; prednastaven&eacute; administr&aacute;torom va&scaron;ej organiz&aacute;cie. Po v&yacute;bere v&aacute;&scaron;ho režimu a merania zadajte trvanie alebo vzdialenosť do  5 hod&iacute;n (300 min&uacute;t) alebo  300 m&iacute;ľ (482.80 kilometrov). </p>
            <p>Smer cesty ( <b>Preč od zariadenia</b> alebo <b>Ku zariadeniu</b> m&ocirc;že ovplyvniť, ako bud&uacute; oblasti generovan&eacute;. Vytvoriť oblasti podľa času jazdy bude re&scaron;pektovať jednosmern&eacute; ulice, vyhne sa nepovolen&yacute;m odbočeniam a bude nasledovať in&eacute; pravidl&aacute; na z&aacute;klade smeru jazdy. Mali by ste vybrať smer jazdy na z&aacute;klade typu vstupn&yacute;ch lokal&iacute;t a kontextu va&scaron;ej anal&yacute;zy. Napr&iacute;klad oblasť podľa času jazdy pre prev&aacute;dzku s rozvozom pizze by mala byť vytvoren&aacute; v smere OD prev&aacute;dzky, zatiaľ čo oblasť času dojazdu do nemocnice by mala byť vytvoren&aacute; v smere K prev&aacute;dzke.
            </p>
            <p>Pri v&yacute;bere  <b>Čas jazdy</b>, <b>Čas jazdy na vidieku</b> alebo <b>Čas n&aacute;kladnej prepravy</b>, m&aacute;te r&ocirc;zne možnosti merania času jazdy.
                <ul>
                    <li>
                        <p>Od&scaron;krtnite  <b>Použiť prem&aacute;vku</b> na vytvorenie oblasti podľa času jazdy na z&aacute;klade fixn&yacute;ch r&yacute;chlost&iacute;. T&aacute;to možnosť umožňuje voľbu, či chcete vytvoriť v&scaron;eobecn&uacute; oblasť podľa času jazdy, ktor&aacute; nebude reflektovať zmeny dopravn&yacute;ch podmienok pre konkr&eacute;tny čas odchodu.
                        </p>
                    </li>
                    <li>
                        <p>Za&scaron;krtnut&iacute;m pol&iacute;čka  <b>Použiť prem&aacute;vku</b> vytvor&iacute;te oblasti podľa času jazdy na z&aacute;klade uveden&eacute;ho času &scaron;tartu a meniacich sa dopravn&yacute;ch podmienok. Z&aacute;roveň, zvolen&iacute;m možnosti <b>Živ&aacute; prem&aacute;vka</b>, je čas odchodu zo vstupn&yacute;ch bodov nastaven&yacute; na aktu&aacute;lny čas a aktu&aacute;lne a predpokladan&eacute; r&yacute;chlosti prem&aacute;vky s&uacute; referencovan&eacute; zo senzorov a prenosov, ktor&eacute; sa zohľadnia pre vytvorenie dojazdov&yacute;ch oblast&iacute;. Predpokladan&eacute; r&yacute;chlosti prem&aacute;vky s&uacute; vypoč&iacute;tan&eacute; referencovan&iacute;m živ&yacute;ch prenosov o r&yacute;chlost&iacute; prem&aacute;vky, historick&yacute;ch r&yacute;chlost&iacute; a aktu&aacute;lnych udalost&iacute;, ako napr&iacute;klad počasie. R&yacute;chlosti prem&aacute;vky s&uacute; predpokladan&eacute; 4 hod&iacute;n do bud&uacute;cnosti, takže m&ocirc;žete pomocou časovn&eacute;ho posuvn&iacute;ka nastaviť čas odchodu dopredu o  4 hod&iacute;n. </p>
                        <p>Použite nastavenia živej prem&aacute;vky, aby ste zistili, ktor&eacute; oblasti s&uacute; dosiahnuteľn&eacute; pri odchode teraz, o hodinu, atď.
                        </p>
                    </li>
                    <li>
                        <p>Za&scaron;krtnut&iacute;m  <b>Použiť prem&aacute;vku</b> a zvolen&iacute;m <b>Prem&aacute;vka na z&aacute;klade bežn&yacute;ch podmienok pre</b> deň a čas, n&aacute;stroj vytvor&iacute; dojazdov&uacute; oblasť na z&aacute;klade historick&yacute;ch priemerov r&yacute;chlost&iacute; pre každ&yacute; p&auml;ťmin&uacute;tov&yacute; interval naprieč rutinn&yacute;m t&yacute;ždňom. V&yacute;sledky zahŕňaj&uacute; prem&aacute;vku, ale odstraňuj&uacute; vplyv s&uacute;časn&yacute;ch podmienok prem&aacute;vky a udalost&iacute;, ktor&eacute; sa m&ocirc;žu v&yacute;znamne l&iacute;&scaron;iť od normy.
                        </p>
                        <p>Tieto nastavenia historickej prem&aacute;vky m&ocirc;žete použiť na položenie ot&aacute;zky, napr&iacute;klad, &quot;Ktor&eacute; oblasti m&ocirc;žem v&scaron;eobecne dosiahnuť pri odchode v stredu o 11:30?&quot;
                        </p>
                        <p>Čas, ktor&yacute; ste nastavili, referuje na časov&eacute; p&aacute;smo, v ktorom sa va&scaron;e vstupn&eacute; body nach&aacute;dzaj&uacute;. Ak teda nastav&iacute;te čas na 8:00 a m&aacute;te dva body, jeden v New York City a druh&yacute; v Los Angeles, dojazdov&aacute; oblasť bude generovan&aacute; pre 8:00 v&yacute;chodn&eacute;ho času a 8:00 tichomorsk&eacute;ho času.
                        </p>
                    </li>
                </ul>
                
            </p>
            <p>V&scaron;imnite si, že zatiaľ čo vozidlo odch&aacute;dza z bodu, čas ubieha a podmienky prem&aacute;vky sa menia. N&aacute;stroj Dojazdov&eacute; oblasti zohľadňuje tieto zmeny ak zvol&iacute;te  <b>Čas jazdy</b> a za&scaron;krtnete <b>Použiť prem&aacute;vku</b>; av&scaron;ak, nie v&scaron;etky regi&oacute;ny podporuj&uacute; prem&aacute;vku. Kliknite v n&aacute;stroji na link <b>Zobraziť dostupnosť</b>, aby ste zistili, či je možn&eacute; jeho využitie aj vo va&scaron;ej oblasti.
            </p>
            <p> <b>Čas n&aacute;kladnej prepravy</b> m&ocirc;že využ&iacute;vať dynamick&eacute; cestovn&eacute; r&yacute;chlosti na z&aacute;klade prem&aacute;vky, ale iba v r&aacute;mci povolen&eacute;ho r&yacute;chlostn&eacute;ho limitu. Napr&iacute;klad, ak je dynamick&aacute; r&yacute;chlosť pre ulicu na z&aacute;klade živej prem&aacute;vky 65 m&iacute;ľ za hodinu, ale maxim&aacute;lna povolen&aacute; r&yacute;chlosť n&aacute;kladnej prepravy je pre t&uacute;to ulicu 55 m&iacute;ľ za hodinu, v&yacute;počet použije pre t&uacute;to ulicu r&yacute;chlosť 55 m&iacute;ľ za hodinu.
            </p>
            <p> <b>Čas ch&ocirc;dze</b> a <b>Pe&scaron;ia vzdialenosť</b> použ&iacute;vaj&uacute; fixn&uacute; r&yacute;chlosť 5 kilometrov za hodinu (3.1 m&iacute;ľ za hodinu) a sleduj&uacute; pe&scaron;ie chodn&iacute;ky rovnako ako určen&eacute; ulice (ignoruj&uacute;c pravidl&aacute;, ktor&eacute; sa t&yacute;kaj&uacute; automobilov, ako jednosmern&eacute; ulice). </p>
            <p> <b>Vzdialenosť n&aacute;kladnej prepravy</b> použ&iacute;va fixn&eacute; r&yacute;chlosti a riadi sa pravidlami, ktor&eacute; s&uacute; aplikovateľn&eacute; na n&aacute;kladn&eacute; vozidl&aacute;, zatiaľ čo <b>Vzdialenosť jazdy</b> a <b>Vzdialenosť jazdy na vidieku</b> použ&iacute;vaj&uacute; fixn&eacute; r&yacute;chlosti a riadia sa pravidlami aplikovateľn&yacute;mi na automobily - aut&aacute;.
            </p> 
        </div>
    </div>
    <div id="barrier_layers">
        <div><h2>Vyberte vstvy bariér</h2></div>
        <hr/>
        <div>
            <p> Jeden alebo viac prvkov, ktor&eacute; sl&uacute;žia ako dočasn&eacute; obmedzenia (bari&eacute;ry), pri prechode po podkladov&yacute;ch prvkoch ciest. Bari&eacute;ry m&ocirc;žete &scaron;pecifikovať použit&iacute;m bodov, l&iacute;ni&iacute; alebo polyg&oacute;nov.
            </p>
            <p>Bodov&aacute; bari&eacute;ria m&ocirc;že modelovať spadnut&yacute; strom, nehodu, spadnut&eacute; elektrick&eacute; vedenie alebo čokoľvek, čo &uacute;plne blokuje dopravu na konkr&eacute;tnej poz&iacute;cii na ulici. Cestovanie je na ulici povolen&eacute;, av&scaron;ak nie cez bari&eacute;ru. M&ocirc;žete &scaron;pecifikovať viac ako 250 prvkov, ktor&eacute; bud&uacute; sl&uacute;žiť ako bodov&aacute; bari&eacute;ra.
            </p>
            <p>Line&aacute;rna bari&eacute;ra obmedzuje cestovanie kdekoľvek, kde sa bari&eacute;ra pret&iacute;na s ulicami. Napr&iacute;klad, pochod alebo protest, ktor&yacute; blokuje prem&aacute;vku naprieč niekoľk&yacute;mi segmentami ul&iacute;c, m&ocirc;že byť modelovan&yacute; ako line&aacute;rna bari&eacute;ra. Ak počet prvkov ul&iacute;c pretnut&yacute;ch line&aacute;rnymi bari&eacute;rami presiahne 500, n&aacute;stroj vr&aacute;ti chybu.
            </p>
            <p>Polyg&oacute;nov&aacute; bari&eacute;ra obmedzuje cestovanie kdekoľvek, kde sa polyg&oacute;n pret&iacute;na s ulicami. Jedno z použit&iacute; tak&eacute;hoto typu bari&eacute;ry je modelovanie povodn&iacute; pokr&yacute;vaj&uacute;cich plochy siete ul&iacute;c a t&yacute;m znemožnenie cestovania po zasiahnut&yacute;ch cest&aacute;ch. Ak počet prvkov ul&iacute;c pretnut&yacute;ch polyg&oacute;nov&yacute;mi bari&eacute;rami presiahne 200, n&aacute;stroj vr&aacute;ti chybu.
            </p>
        </div>
    </div>
    <div id="DissolveType">
        <div><h2>Oblasti z rôznych bodov</h2></div>
        <hr/>
        <div>
            <p>Vyberte, ako zaobch&aacute;dzať so zdieľan&yacute;mi oblasťami z r&ocirc;znych vstupn&yacute;ch bodov, keď dosiahne jedna druh&uacute;. M&ocirc;žu sa:
                <ul>
                    <li> <b>Prekryť</b> - Oblasti z r&ocirc;znych vstupn&yacute;ch bodov m&ocirc;žu pokr&yacute;vať rovnak&uacute; cestu. Toto je užitočn&eacute;, keď potrebujete poznať v&scaron;etky vstupn&eacute; body, ktor&eacute; m&ocirc;žu dosiahnuť konkr&eacute;tne lokality v r&aacute;mci dan&eacute;ho času alebo vzdialenosti.
                    </li>
                    <li> <b>Rozpustiť</b> - V&scaron;etky oblasti s&uacute; spojen&eacute; dohromady, a teda nie viac ako jedna plocha m&ocirc;že pokr&yacute;vať konkr&eacute;tnu lokalitu. Toto je užitočn&eacute;, keď potrebujete vedieť iba to, že oblasť je možn&eacute; dosiahnuť v danom čase alebo vzdialenosti, ale nemus&iacute;te vedieť, ktor&eacute; konkr&eacute;tne vstupn&eacute; body m&ocirc;žu dan&eacute; miesto dosiahnuť.
                    </li>
                    <li> <b>Rozdeliť</b> - Oblasti z r&ocirc;znych vstupn&yacute;ch lokal&iacute;t, ktor&eacute; by sa prekr&yacute;vali, s&uacute; rozdelen&eacute; v strede, takže sa namiesto prekryvu dot&yacute;kaj&uacute; jedna druhej. Toto je užitočn&eacute;, keď chcete vidieť oblasti v r&aacute;mci dan&eacute;ho času alebo vzdialenosti od vstupn&yacute;ch bodov a z&aacute;roveň určiť, ktor&eacute; vstupn&eacute; body s&uacute; k tejto oblasti najbliž&scaron;ie.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="showHoles">
        <div><h2>Zobraziť nedostupné oblasti ako diery</h2></div>
        <hr/>
        <div>
            <p>Vyberte, či bud&uacute; v&yacute;stupn&eacute; oblasti zahŕňať diery v pr&iacute;pade, že sa niektor&eacute; ulice nedaj&uacute; dosiahnuť v danom  <b>Meranie</b> čase alebo vzdialenosti alebo kv&ocirc;li obmedzeniam sp&ocirc;soben&yacute;m cestovn&yacute;m režimom.
            </p>
            <p>Dojazdov&eacute; oblasti vytvoren&eacute; použit&iacute;m tohto parametra maj&uacute; limit 15 min&uacute;t alebo 15 m&iacute;ľ (24 kilometrov).
            </p>
        </div>
    </div>
    <div id="OutputLayer">
        <div><h2>Názov výslednej vrstvy</h2></div>
        <hr/>
        <div>
            <p>n&aacute;zov vrstvy, ktor&aacute; bude vytvoren&aacute; v zložke  <b>M&ocirc;j obsah</b> a pridan&aacute; do mapy. Predvolen&yacute; n&aacute;zov je založen&yacute; na n&aacute;zve n&aacute;stroja a n&aacute;zve vstupnej vrstvy. Ak n&aacute;zov vrstvy už existuje, budete požiadan&yacute; zadať in&eacute; meno.
            </p>
            <p>Použit&iacute;m rozbaľovacieho menu  <b>Uložiť v&yacute;sledok v</b> m&ocirc;žete zadať n&aacute;zov novej zložky v zložke <b>M&ocirc;j obsah</b>, kam bude uložen&yacute; v&yacute;sledok.
            </p>
        </div>
    </div>
    <div id="includeReachableStreets">
        <div><h2>Zahrnúť dostupné ulice</h2></div>
        <hr/>
        <div>
            <p>Zahrn&uacute;ť ulice, ktor&eacute; s&uacute; použit&eacute; na vytvorenie dojazdov&yacute;ch oblast&iacute;, formou v&yacute;stupnej vrstvy.
            </p>
            <p>Vytvoriť dojazdov&eacute; oblasti meria dosah zariadenia po sieti ul&iacute;c, n&aacute;sledne vytvor&iacute; dojazdov&eacute; oblasti z prejden&yacute;ch ul&iacute;c. Oblasti s&uacute; z toho d&ocirc;vodu odhadom prejden&yacute;ch ul&iacute;c. Ak m&aacute; va&scaron;a anal&yacute;za za &uacute;čel určiť, ktor&eacute; ulice s&uacute; pokryt&eacute; konkr&eacute;tnou cestovnou vzdialenosťou alebo časom od zariadenia, generovanie dostupn&yacute;ch ul&iacute;c m&ocirc;že byť presnej&scaron;ie ako použitie dojazdov&yacute;ch oblast&iacute; na ohodnotenie, či bola konkr&eacute;tna ulica dosiahnut&aacute;.
            </p>
            <p>Dojazdov&eacute; oblasti vytvoren&eacute; použit&iacute;m tohto parametra maj&uacute; limit 15 min&uacute;t alebo 15 m&iacute;ľ (24 kilometrov).
            </p>
        </div>
    </div>
</div>
</html>
