<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Vytvoriť oblasti dojazdového času</h2><p/>
        <h2><img src="../images/GUID-6F629A09-768D-4C04-88A4-AB941811ADE9-web.png" alt="Vytvoriť oblasti dojazdov&eacute;ho času"></h2>
        <hr/>
    <p>Vytvoriť oblasti času jazdy vytvor&iacute; oblasti, ktor&eacute; je možn&eacute; dosiahnuť v r&aacute;mci určen&eacute;ho času jazdy, jazdnej vzdialenosti, pe&scaron;ej vzdialenosti atď. Meria sa od jedn&eacute;ho alebo viacer&yacute;ch bodov (až 1,000), popri cest&aacute;ch alebo pe&scaron;&iacute;ch z&oacute;nach, na vytvorenie vrstvy, ktor&aacute; v&aacute;m m&ocirc;že pomocť zodpovedať ot&aacute;zky ako:
        <ul>
            <li>Kam m&ocirc;žem d&ocirc;jsť v r&aacute;mci 30-min&uacute;tovej jazdy?
            </li>
            <li>Kam m&ocirc;žem d&ocirc;jsť v r&aacute;mci 30-min&uacute;tovej jazdy o 17:30 počas dopravnej &scaron;pičky?
            </li>
            <li>Čo sa nach&aacute;dza v r&aacute;mci dvoch kilometrov pe&scaron;i od m&ocirc;jho hotela?
            </li>
            <li>Ktor&eacute; oblasti mesta m&ocirc;žu hasiči dosiahnuť za p&auml;ť min&uacute;t jazdy?
            </li>
            <li>Ako by sa pokrytie hasičskej odozvy zlep&scaron;ilo postaven&iacute;m novej hasičskej stanice na tomto mieste?
            </li>
            <li>Ak&eacute; oblasti trhu pokr&yacute;va m&ocirc;j podnik?
            </li>
        </ul>
        
    </p>
    <p>Možno budete m&ocirc;cť odpovedať na svoje ot&aacute;zky iba prostredn&iacute;ctvom vizualiz&aacute;cie oblast&iacute; v&yacute;stupu. Pr&iacute;padne m&ocirc;žete vykonať ďal&scaron;iu priestorov&uacute; anal&yacute;zu pomocou v&yacute;stupn&yacute;ch oblast&iacute;. Napr&iacute;klad spustenie agregovania bodov pomocou oblast&iacute; dostupnosti autom s demografick&yacute;mi &uacute;dajmi m&ocirc;že pom&ocirc;cť určiť, ktor&eacute; potenci&aacute;lne umiestnenie obchodu by pravdepodobne poskytlo najlep&scaron;iu z&aacute;kazn&iacute;cku z&aacute;kladňu pre v&aacute;&scaron; typ podnikania.
    </p>
    <p>
        <table>
        <tr><td colspan="3"><hr size="1" noshade="noshade"></td></tr>
        <tr><td valign="baseline"><img src="../images/tip.png"></td><td valign="baseline"><h2>Tip:&ensp;</h2></td>
        <td valign="baseline">
            <p>Na vytvorenie oblast&iacute; použit&iacute;m priamočiarej vzdialenosti namiesto merania popri cest&aacute;ch, použite n&aacute;stroj Create Buffers.
            </p>
        </td></tr>
        <tr><td colspan="3"><hr size="1" noshade="noshade"></td></tr>
        </table>
    </p>
    <p>Ak je za&scaron;krtnut&eacute;  <b>Použiť aktu&aacute;lny rozsah mapy</b>, iba prvky, ktor&eacute; s&uacute; viditeľn&eacute; v r&aacute;mci aktu&aacute;lneho rozsahu mapy, bud&uacute; použit&eacute; na vytvorenie oblast&iacute; založen&yacute;ch na čase jazdy alebo vzdialensti jazdy. Ak je neza&scaron;krtnut&eacute;, v&scaron;etky prvky vo vrstve vstupu bud&uacute; použit&eacute;, aj pokiaľ s&uacute; mimo aktu&aacute;lneho rozsahu mapy.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputLayer">
        <div><h2>Vybrať vrstvu bodov pre kalkuláciu oblasti podľa času jazdy okolo</h2></div>
        <hr/>
        <div>
            <p>Bodov&eacute; prvky, okolo ktor&yacute;ch sa bud&uacute; poč&iacute;tať oblasti. M&ocirc;žete vybrať ako bud&uacute; oblasti vypoč&iacute;tan&eacute; na z&aacute;klade cestovn&eacute;ho režimu (jazda, n&aacute;kladn&aacute; preprava alebo ch&ocirc;dza) a merania (čas alebo vzdialenosť).
            </p>
            <p>Navy&scaron;e k v&yacute;beru vrstvy va&scaron;ej mapy, m&ocirc;žete zvoliť  <b>Vybrať analytick&uacute; vrstvu</b>, ktor&aacute; je na spodku rozbalen&eacute;ho zoznamu. T&aacute;to možnosť otv&aacute;ra gal&eacute;riu, kde m&ocirc;žete prehľad&aacute;vať a zvoliť d&aacute;tov&uacute; sadu z r&ocirc;znych zdrojov na použitie vo va&scaron;ej anal&yacute;ze. 
            </p>
            <p>N&aacute;stroj podporuje vy&scaron;e 1,000 prvkov vo vstupnej vrstve.
            </p>
        </div>
    </div>
    <div id="MeasurementMethod">
        <div><h2>Zmerať</h2></div>
        <hr/>
        <div>
            <p>Vyberte v&aacute;&scaron; cestovn&yacute; režim (jazda, n&aacute;kladn&aacute; preprava alebo ch&ocirc;dza) a merania (čas alebo vzdialenosť). Dostupn&eacute; cestovn&eacute; režimy s&uacute; prednastaven&eacute; administr&aacute;torom va&scaron;ej organiz&aacute;cie. Po vybran&iacute; v&aacute;&scaron;ho režimu a merania zadajte trvanie alebo vzdialenosť do  5 hod&iacute;n (300 min&uacute;t) alebo  300 m&iacute;ľ (482.80 kilometrov). </p>
            <p>Smer cesty ( <b>Preč od zariadenia</b> alebo <b>Ku zariadeniu</b> m&ocirc;že ovplyvniť, ako bud&uacute; oblasti generovan&eacute;. Vytvoriť oblasti podľa času jazdy bude re&scaron;pektovať jednosmern&eacute; ulice, vyhne sa nepovolen&yacute;m odbočeniam a bude nasledovať in&eacute; pravidl&aacute; na z&aacute;klade smeru jazdy. Mali by ste vybrať smer jazdy na z&aacute;klade typu vstupn&yacute;ch umiestnen&iacute; a kontextu va&scaron;ej anal&yacute;zy. Napr&iacute;klad oblasť podľa času jazdy pre obchod s dovozom pizze by mal byť vytvoren&yacute; smerom od zariadenia, zatiaľ čo oblasť podľa času jazdy pre nemocnicu by mala byť vytvoren&aacute; smerom k nemocnici.
            </p>
            <p>Pri v&yacute;bere  <b>Čas jazdy</b>, <b>Čas jazdy na vidieku</b> alebo <b>Prepravn&yacute; čas</b>, m&aacute;te r&ocirc;zne možnosti merania času jazdy.
                <ul>
                    <li>
                        <p>Od&scaron;krtnite  <b>Použiť prem&aacute;vku</b> na vytvorenie oblasti podľa času jazdy na z&aacute;klade fixn&yacute;ch r&yacute;chlost&iacute;. Toto je možnosť zvoliť si, či chcete mať k dispoz&iacute;cii v&scaron;eobecn&uacute; oblasť podľa času jazdy, nie t&uacute;, ktor&aacute; sa poč&iacute;ta pomocou zmeny dopravn&yacute;ch podmienok pre konkr&eacute;tny čas odchodu.
                        </p>
                    </li>
                    <li>
                        <p>Začiarknut&iacute;m pol&iacute;čka  <b>Použiť prem&aacute;vku</b> vytvor&iacute;te oblasti podľa času jazdy na z&aacute;klade dan&eacute;ho času &scaron;tartu a meniacich sa dopravn&yacute;ch podmienok. Z&aacute;roveň, zvolen&iacute;m možnosti <b>Živ&aacute; prem&aacute;vka</b>, čas odchodu zo vstupn&yacute;ch bodov je nastaven&yacute; na aktu&aacute;lny čas a aktu&aacute;lne a predpokladan&eacute; r&yacute;chlosti prem&aacute;vky s&uacute; referencovan&eacute; zo senzorov a prenosov na vytvorenie dojazdov&yacute;ch oblast&iacute;. Predpokladan&eacute; r&yacute;chlosti prem&aacute;vky s&uacute; vypoč&iacute;tan&eacute; referencovan&iacute;m živ&yacute;ch prenosov r&yacute;chlost&iacute; prem&aacute;vky, historick&yacute;ch r&yacute;chlost&iacute; a aktu&aacute;lnych udalost&iacute;, ako počasie. R&yacute;chlosti prem&aacute;vky s&uacute; predpokladan&eacute; 4 hod&iacute;n do bud&uacute;cnosti, takže m&ocirc;žete pohn&uacute;ť posuvn&iacute;kom na nastavenie času odchodu dopredu o  4 hod&iacute;n. </p>
                        <p>Použite tieto nastavenia živej prem&aacute;vky, aby ste zistili, ktor&eacute; oblasti m&ocirc;žu byť dosiahnut&eacute; pri odchode teraz, pri odchode o hodinu od teraz a podobone.
                        </p>
                    </li>
                    <li>
                        <p>Za&scaron;krtnut&iacute;m  <b>Použiť prem&aacute;vku</b> a zvolen&iacute;m <b>Prem&aacute;vka na z&aacute;klade bežn&yacute;ch podmienok pre</b> deň a čas, n&aacute;stroj vytvor&iacute; dojazdov&uacute; oblasť na z&aacute;klade historick&yacute;ch priemerov r&yacute;chlost&iacute; pre každ&yacute; p&auml;ťmin&uacute;tov&yacute; interval naprieč rutinn&yacute;m t&yacute;ždňom. V&yacute;sledky zahŕňaj&uacute; prem&aacute;vku, ale odstraňuj&uacute; vplyv s&uacute;časn&yacute;ch podmienok prem&aacute;vky a udalost&iacute;, ktor&eacute; sa m&ocirc;žu v&yacute;znamne l&iacute;&scaron;iť od normy.
                        </p>
                        <p>M&ocirc;žete použiť tieto nastavenia historickej prem&aacute;vky na položenie ot&aacute;zky, napr&iacute;klad, &quot;Ktor&eacute; oblasti m&ocirc;žem v&scaron;eobecne dosiahnuť pri odchode o 11:30 v stredu?&quot;
                        </p>
                        <p>Čas, ktor&yacute; ste nastavili, referuje na časov&eacute; p&aacute;smo, v ktorom sa va&scaron;e vstupn&eacute; body nach&aacute;dzaj&uacute;. Takže, ak nastav&iacute;te čas na 8:00 a m&aacute;te dva body, jeden v New York City a in&yacute; v Los Angeles, dojazdov&aacute; oblasť bude generovan&aacute; pre 8:00 v&yacute;chodn&eacute;ho času a 8:00 tichomorsk&eacute;ho času, v tomto porad&iacute;
                        </p>
                    </li>
                </ul>
                
            </p>
            <p>V&scaron;imnite si, že zatiaľ čo vozidlo odch&aacute;dza z bodu, ubieha čas a podmienky prem&aacute;vky sa menia. N&aacute;stroj dojazdov&eacute; oblasti je zodpovedn&yacute; za tieto zmeny, keď zvol&iacute;te  <b>Čas jazdy</b> a za&scaron;krtnete <b>Použiť prem&aacute;vku</b>; av&scaron;ak, nie v&scaron;etky regi&oacute;ny podporuj&uacute; prem&aacute;vku. Kliknite na prepojenie <b>Zobraziť dostupnosť</b> na n&aacute;stroji, aby ste zistili, či sa pon&uacute;ka vo vami &scaron;tudovanej oblasti.
            </p>
            <p> <b>Prepravn&yacute; čas</b> m&ocirc;že použ&iacute;vať dynamick&eacute; cestovn&eacute; r&yacute;chlosti na z&aacute;klade prem&aacute;vky, ale iba v r&aacute;mci povolen&eacute;ho r&yacute;chlostn&eacute;ho limitu. Napr&iacute;klad, ak je dynamick&aacute; r&yacute;chlosť pre ulicu na z&aacute;klade živej prem&aacute;vky 65 m&iacute;ľ za hodinu, ale maxim&aacute;lna povolen&aacute; r&yacute;chlosť pre t&uacute;to ulicu je 55 m&iacute;ľ za hodinu, v&yacute;počet použije pre t&uacute;to ulicu r&yacute;chlosť 55 m&iacute;ľ za hodinu.
            </p>
            <p> <b>Čas ch&ocirc;dzy</b> a <b>Pe&scaron;ia vzdialenosť</b> použ&iacute;vaj&uacute; fixn&uacute; r&yacute;chlosť 5 kilometrov za hodinu (3.1 m&iacute;ľ za hodinu) a nasleduj&uacute; pe&scaron;ie chodn&iacute;ky rovnako, ako určen&eacute; ulice (ignoruj&uacute;c pravidl&aacute;, ktor&eacute; sa t&yacute;kaj&uacute; automobilov, ako jednosmern&eacute; ulice). </p>
            <p> <b>Prepravn&aacute; vzdialenosť</b> použ&iacute;va fixn&eacute; r&yacute;chlosti a riadi sa pravidlami, ktor&eacute; s&uacute; aplikovateľn&eacute; na n&aacute;kladn&eacute; vozidl&aacute;, zatiaľ čo <b>Vzdialenosť jazdy</b> a <b>Vzdialenosť jazdy na vidieku</b> použ&iacute;vaj&uacute; ficn&eacute; r&yacute;chlosti a riadia sa pravidlami aplikovateľn&yacute;mi na automobily ako s&uacute; aut&aacute;.
            </p> 
        </div>
    </div>
    <div id="barrier_layers">
        <div><h2>Vyberte vstvy bariér</h2></div>
        <hr/>
        <div>
            <p> Jeden alebo viac prvkov, ktor&eacute; sl&uacute;žia ako dočasn&eacute; obmedzenia (bari&eacute;ry), keď cestujete na podkladov&yacute;ch cest&aacute;ch. Bari&eacute;ry m&ocirc;žete &scaron;pecifikovať použit&iacute;m prvkov bodu, l&iacute;nie alebo polyg&oacute;nu.
            </p>
            <p>Bodov&aacute; bari&eacute;ria m&ocirc;že modelovať spadnut&yacute; strom, nehodu, spadnut&eacute; elektrick&eacute; vedenie alebo čokolvek, čo &uacute;plne blokuje dopravu na konkr&eacute;tnej poz&iacute;cii na ulici. Cestovanie je na ulici povolen&eacute;, av&scaron;ak nie cez bari&eacute;ru. M&ocirc;žete &scaron;pecifikovať viac ako 250 prvkov, ktor&eacute; bud&uacute; sl&uacute;žiť ako bodov&aacute; bari&eacute;ry.
            </p>
            <p>Line&aacute;rna bari&eacute;ra obmedzuje cestovanie kdekoľvek, kde sa bari&eacute;ra pret&iacute;na s ulicami. Napr&iacute;klad, pochod alebo protest, ktor&yacute; blokuje prem&aacute;vku nprieč niekoľk&yacute;mi segmentami ul&iacute;c, m&ocirc;že byť modelovan&yacute; ako line&aacute;rna bari&eacute;ra. Ak počet prvkov ulice pretnut&yacute;chv&scaron;etk&yacute;mi line&aacute;rnymi bari&eacute;rami presiahne 500, n&aacute;stroj vr&aacute;ti chybu.
            </p>
            <p>Polyg&oacute;nov&aacute; bari&eacute;ra obmedzuje cestovanie kdekoľvek, kde sa polyg&oacute;n pret&iacute;na s ulicami. Jedno z použit&iacute; tak&eacute;hoto typu bari&eacute;ry je modelovať povodne pokr&yacute;vaj&uacute;ce plochy siete ul&iacute;c a t&yacute;m znemožnuj&uacute; cestovanie na ceste. Ak počet prvkov ulice pretnut&yacute;ch v&scaron;etk&yacute;mi polyg&oacute;nov&yacute;mi bari&eacute;rami presiahne 200, n&aacute;stroj vr&aacute;ti chybu.
            </p>
        </div>
    </div>
    <div id="DissolveType">
        <div><h2>Oblasti z rôznych bodov</h2></div>
        <hr/>
        <div>
            <p>Vyberte, ako je so zdieľan&yacute;mi oblasťami z r&ocirc;znych vstupn&yacute;ch bodov zaobch&aacute;dzan&eacute;, keď dosiahnu jedna druh&uacute;. M&ocirc;žu sa:
                <ul>
                    <li> <b>Prekryť</b> - Oblasti z r&ocirc;znych vstupn&yacute;ch bodov m&ocirc;žu pokr&yacute;vať rovnak&uacute; cestu. Toto je užitočn&eacute;, keď potrebujete poznať v&scaron;etky vstupn&eacute; body, ktor&eacute; m&ocirc;žu dosiahnuť konkr&eacute;tne umiestnenie v r&aacute;mci dan&eacute;ho času alebo vzdialenosti.
                    </li>
                    <li> <b>Rozpustiť</b> - V&scaron;etky oblasti s&uacute; spojen&eacute; do jednej a nie viac ako jedna plocha m&ocirc;že pokr&yacute;vať konkr&eacute;tne umiestnenie. Toto je užitočn&eacute;, keď potrebujete vedieť iba to, že oblasť je možn&eacute; dosiahnuť v danom čase alebo vzdialenosti, ale nemus&iacute;te vedieť, ktor&eacute; konkr&eacute;tne vstupn&eacute; body sa m&ocirc;žu dan&eacute; miesto dosiahnuť.
                    </li>
                    <li> <b>Rozdeliť</b> - Oblasti z r&ocirc;znych vstupn&yacute;ch umiestnen&iacute;, ktor&eacute; by sa prekr&yacute;vali, s&uacute; rozdelen&eacute; v strede, takže sa namiesto toho dot&yacute;kaj&uacute; jedna druhej. Toto je užitočn&eacute;, keď chcete vidieť, ktor&eacute; oblasti s&uacute; v r&aacute;mci dan&eacute;ho času alebo vzdialenosti od vstupn&yacute;ch bodov a z&aacute;roveň určiť, ktor&eacute; vstupn&eacute; body s&uacute; k tejto oblasti najbliž&scaron;ie.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="showHoles">
        <div><h2>Zobraziť nedostupné oblasti ako diery</h2></div>
        <hr/>
        <div>
            <p>Vyberte, či bud&uacute; v&yacute;stupn&eacute; oblasti zahŕňať diery, ak sa niektor&eacute; ulice nedaj&uacute; dosiahnuť kv&ocirc;li času alebo vzdialenosti  <b>Meranie</b> alebo kv&ocirc;li obmedzeniam uložen&yacute;m cestovn&yacute;m režimom.
            </p>
            <p>Dojazdov&eacute; oblasti vytvoren&eacute; použit&iacute;m tohto parametra maj&uacute; limit 15 min&uacute;t alebo 15 m&iacute;ľ (24 kilometrov).
            </p>
        </div>
    </div>
    <div id="OutputLayer">
        <div><h2>Názov výslednej vrstvy</h2></div>
        <hr/>
        <div>
            <p>n&aacute;zov vrstvy, ktor&aacute; bude vytvoren&aacute; v zložke  <b>M&ocirc;j obsah</b> a pridan&aacute; do mapy. Predvolen&yacute; n&aacute;zov je založen&yacute; na n&aacute;zve n&aacute;stroja a n&aacute;zve vstupnej vrstvy. Ak n&aacute;zov vrstvy už existuje, budete požiadan&yacute; poskytn&uacute;ť in&eacute; meno.
            </p>
            <p>Použit&iacute;m rozbaľovacieho menu  <b>Uložiť v&yacute;sledok v</b> m&ocirc;žete zadať n&aacute;zov novej zložky v zložke <b>M&ocirc;j obsah</b>, kam bude v&yacute;sledok uložen&yacute;.
            </p>
        </div>
    </div>
    <div id="includeReachableStreets">
        <div><h2>Zahrnúť dostupné ulice</h2></div>
        <hr/>
        <div>
            <p>Zahrn&uacute;ť ulice, ktor&eacute; s&uacute; použ&iacute;van&eacute; na vytvorenie dojazdov&yacute;ch oblast&iacute; ako v&yacute;stupnej vrstvy.
            </p>
            <p>Vytvoriť dojazdov&eacute; oblasti meria dosah zariadenia spolu so sieťou ul&iacute;c, potom vytvor&iacute; dojazdov&eacute; oblasti z prejden&yacute;ch ul&iacute;c. Preto, oblasti s&uacute; s&uacute; odhadom prejden&yacute;ch ul&iacute;c. Ak m&aacute; va&scaron;a anal&yacute;za za &uacute;čel určiť, ktor&eacute; ulice s&uacute; pokryt&eacute; v r&aacute;mci konkr&eacute;tnej cestovnej vzdialenosti alebo času od zaradenia, generovanie dostupn&yacute;ch ul&iacute;c m&ocirc;že byť presnej&scaron;ie ako použitie dojazdov&yacute;ch oblast&iacute; na ohodnotenie, či bola konkr&eacute;tna ulica dosiahnuteľn&aacute;.
            </p>
            <p>Dojazdov&eacute; oblasti vytvoren&eacute; použit&iacute;m tohto parametra maj&uacute; limit 15 min&uacute;t alebo 15 m&iacute;ľ (24 kilometrov).
            </p>
        </div>
    </div>
</div>
</html>
