<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="smallsize">
        <h2>Povodie</h2><p/>
        <h2><img src="../images/GUID-AF749369-8C2D-46FF-9D74-2CF7CAB7C7B0-web.png" alt="&Uacute;loha povodia"></h2>
        <hr/>
    <p>Tento n&aacute;stroj určuje pr&iacute;rastkov&uacute; oblasť nad sadou buniek v rastri.
    </p>
    <p> Vstupn&yacute; bod Rieky Mississippi v Louisiane vytvor&iacute; prvok povodia roz&scaron;iruj&uacute;ci sa pre zahrnutie oblast&iacute; od New Yorku do Montany a do Kanady.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputFlowDirectionRaster">
        <div><h2>Vyberte vrstvu smeru toku</h2></div>
        <hr/>
        <div>
            <p>Vstupn&yacute; raster, ktor&yacute; ukazuje smer toku von z každej bunky.
            </p>
            <p>Raster smeru toku m&ocirc;že byť vytvoren&yacute; pomocou rastrovej funkcie Smer toku s predvolen&yacute;m typom smeru toku  <b>D8</b>.
            </p>
        </div>
    </div>
    <div id="inPourPointRasterOrFeatures">
        <div><h2>Špecifikovať vstupné lokality odtokových bodov</h2></div>
        <hr/>
        <div>
            <p>Vstupn&eacute; lokality odtokov&yacute;ch bodov.
            </p>
            <p>Toto m&ocirc;že byť raster alebo bodov&yacute; prvok. Pre raster toto predstavuje bunky, nad ktor&yacute;mi bude určen&aacute; prispievaj&uacute;ca alebo zachyt&aacute;vacia oblasť. V&scaron;etky bunky, ktor&eacute; nie s&uacute; NoData, bud&uacute; použit&eacute; ako zdrojov&eacute; bunky. Pre bodov&yacute; vstup toto predstavuje lokality, nad ktor&yacute;mi bude určen&aacute; prispievaj&uacute;ca alebo zachyt&aacute;vacia oblasť.
            </p>
        </div>
    </div>
    <div id="pourPointField">
        <div><h2>Vyberte atribút určujúci odtokové body</h2></div>
        <hr/>
        <div>
            <p>Pole použit&eacute; na pridelenie hodn&ocirc;t k lokalit&aacute;m odtokov&yacute;ch bodov.
            </p>
            <p>Ak je vstupn&aacute; vrstva bodov odtoku raster, použije sa  <i>Value</i>. Ak ide o prvok, je použit&eacute; č&iacute;seln&eacute; pole. Ak pole obsahuje desatinn&eacute; hodnoty, bud&uacute; orezan&eacute; na cel&eacute; č&iacute;sla.
            </p>
        </div>
    </div>
    <div id="resultLayer">
        <div><h2>Názov výslednej vrstvy</h2></div>
        <hr/>
        <div>
            
            <p>N&aacute;zov vrstvy, ktor&aacute; bude vytvoren&aacute; v zložke  <b>M&ocirc;j obsah</b> a pridan&aacute; do mapy. Predvolen&yacute; n&aacute;zov je založen&yacute; na n&aacute;zve n&aacute;stroja a n&aacute;zve vstupnej vrstvy. Ak vrstva už existuje, budete požiadan&yacute; zadať in&eacute; meno.
            </p>
            <p>M&ocirc;žete zmeniť n&aacute;zov zložky v zložke  <b>M&ocirc;j Obsah</b>, kde bude v&yacute;sledok uložen&yacute; pomocou <b>Uložiť v&yacute;sledok v</b> vo v&yacute;suvnom menu. Ak máte oprávnenia na vytváranie dlaždicových a dynamických snímkových vrstiev, môžete špecifikovať, ktorý typ vrstvy generovať vo výstupe pri použití rozbaľovacieho boxu Uložiť výsledok ako. </p>
        </div>
    </div>
</div>
</html>
