<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Valim</h2><p/>
        <h2><img src="../images/GUID-3950CCA3-C1D0-493F-A33D-93673443ADD2-web.png" alt="Valim"></h2>
        <hr/>
    <p>See t&ouml;&ouml;riist loob tabeli v&otilde;i punktobjektiklassi, mis n&auml;itab rastri v&otilde;i rastrikogumi pikslite v&auml;&auml;rtusi m&auml;&auml;ratud asukohtade jaoks. Asukohad m&auml;&auml;ratakse rastri pikslite, pol&uuml;giooniobjektide, pol&uuml;jooneobjektide v&otilde;i punktikogumi j&auml;rgi.
    </p>
    <p>M&otilde;ned n&auml;ited selle t&ouml;&ouml;riista kasutusaladest:
        <ul>
            <li> Tuletage mobiilimasti asukoha atribuudid mitmest rastrist, n&auml;iteks maakasutus, pinnase t&uuml;&uuml;p, k&otilde;rgus ja kaugus teest.
            </li>
            <li>M&auml;&auml;rake etteantud punktide jaoks pinnase temperatuur erinevatel s&uuml;gavustel.
            </li>
            <li>Tehke 30-aastaste igakuiste merepinna temperatuuri andmete p&otilde;hjal kokkuv&otilde;te loomade asukohtade v&otilde;i elupiirkonna kohta antud aja jooksul, mil loomaliiki t&auml;heldati.
            </li>
        </ul>
        
    </p>
    <p>Kui ruut  <b>Kasuta praeguse kaardi kuvaulatust</b> on m&auml;rgitud, anal&uuml;&uuml;sitakse kihi muutujaid v&otilde;i ribasid, mis on praeguse kaardi kuvaulatuses n&auml;htavad. Kui ruut pole m&auml;rgitud, kasutatakse anal&uuml;&uuml;si koostamisel t&auml;ieliku kihi muutujaid v&otilde;i ribasid ka siis, kui neid pole praeguse kaardi kuvaulatuses n&auml;ha.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inRasters">
        <div><h2>Vali valimi jaoks pildikiht (kihid)</h2></div>
        <hr/>
        <div>
            <p>&Uuml;ksik pilt v&otilde;i piltide loend, mille v&auml;&auml;rtused v&otilde;etakse valimisse sisendasukohaandmete p&otilde;hjal. 
            </p>
            <p>Mitmem&otilde;&otilde;tmelise pildikihi k&otilde;igi kihtide valimisse h&otilde;lmamiseks peab see olema ainus sisendraster.
            </p>
        </div>
    </div>
    <div id="inLocationData">
        <div><h2>Vali asukohakiht:</h2></div>
        <hr/>
        <div>
            <p>Andmed, mis m&auml;&auml;ravad valimi jaoks asukohad.
            </p>
            <p>Sisendasukoht v&otilde;ib olla raster v&otilde;i punkt-, pol&uuml;joon- v&otilde;i pol&uuml;goonobjektiklass.
            </p>
        </div>
    </div>
    <div id="uniqueIdField">
        <div><h2>Määra unikaalne ID väli</h2></div>
        <hr/>
        <div>
            <p>V&auml;li, mis sisaldab erinevat v&auml;&auml;rtust iga asukoha v&otilde;i objekti kohta sisendiks olevas asukoharastris v&otilde;i objektiklassis
            </p>
        </div>
    </div>
    <div id="acquisitionDefinition">
        <div><h2>Määra asukohaandmete hankimise teave (valikuline)</h2></div>
        <hr/>
        <div>
            <p>M&auml;&auml;rake aeg, s&uuml;gavus v&otilde;i muu asukohapikslite- v&otilde;i objektidega seotud andmete hankimise teave.
            </p>
            <p>Iga dimensiooni puhul on asukohapikslite v&otilde;i -objektidega seotud andmete hankimise teabe m&auml;&auml;ramiseks kolm v&otilde;imalust.
            </p>
            <ul>
                <li> <b>&Uuml;ksik v&auml;li v&otilde;i v&auml;&auml;rtus</b>&mdash; kui see v&otilde;imalus on valitud, tuleb m&auml;&auml;rata j&auml;rgnev teave:
                    <ul>
                        <li> <b>Dimensiooni v&auml;li v&otilde;i v&auml;&auml;rtus</b>&mdash;valige asukohaandmetest dimensioonv&auml;&auml;rtuste v&auml;li v&otilde;i sisestage kindel dimensiooniv&auml;&auml;rtus.
                        </li>
                    </ul>
                    
                    

                </li>
                <li> <b>&Uuml;ksik v&auml;li v&otilde;i v&auml;&auml;rtus suhteliste v&auml;&auml;rtustega</b>&mdash;kui see v&otilde;imalus on valitud, tuleb m&auml;&auml;rata alltoodud teave, et m&auml;&auml;rata vahemik, mille piires andmed muutujate jaoks arvutatakse:
                    <ul>
                        <li> <b>Dimensiooni v&auml;li v&otilde;i v&auml;&auml;rtus</b>&mdash;valige asukohaandmetest dimensioonv&auml;&auml;rtuste v&auml;li.
                        </li>
                        <li> <b>Suhteline v&auml;&auml;rtus enne</b>&mdash;valige mittenegatiivne number, mis lahutatakse <b>dimensiooni v&auml;lja v&otilde;i v&auml;&auml;rtuse</b> n&auml;itajast, et m&auml;&auml;rata dimensiooni v&auml;&auml;rtuse vahemiku algus. See v&auml;&auml;rtus t&auml;histab p&auml;evade arvu, kui dimensioon on aeg.
                        </li>
                        <li> <b>Suhteline v&auml;&auml;rtus p&auml;rast</b>&mdash;valige mittenegatiivne number, mis lisatakse <b>dimensiooni v&auml;lja v&otilde;i v&auml;&auml;rtuse</b> n&auml;itajale, et m&auml;&auml;rata dimensiooni v&auml;&auml;rtuse vahemiku l&otilde;pp. See v&auml;&auml;rtus t&auml;histab p&auml;evade arvu, kui dimensioon on aeg.
                        </li>
                    </ul>
                    
                </li>
                <li> <b>Alguse ja l&otilde;pu v&auml;ljad v&otilde;i v&auml;&auml;rtused </b>&mdash;kui see v&otilde;imalus on valitud, tuleb m&auml;&auml;rata alltoodud teave, et m&auml;&auml;rata vahemik, mille piires andmed muutujate jaoks arvutatakse.
                    <ul>
                        <li> <b>Alguse v&auml;li v&otilde;i v&auml;&auml;rtus</b>&mdash;valige asukohaandmetest dimensioonv&auml;&auml;rtuste v&auml;li v&otilde;i sisestage kindel dimensiooniv&auml;&auml;rtus, et m&auml;&auml;rata dimensiooni v&auml;&auml;rtuse vahemiku algus.
                        </li>
                        <li> <b>L&otilde;pu v&auml;li v&otilde;i v&auml;&auml;rtus</b>&mdash;valige asukohaandmetest dimensioonv&auml;&auml;rtuste v&auml;li v&otilde;i sisestage kindel dimensiooniv&auml;&auml;rtus, et m&auml;&auml;rata dimensiooni v&auml;&auml;rtuse vahemiku l&otilde;pp.
                        </li>
                    </ul>
                    
                    

                </li>
            </ul>
            
            <p>See parameeter on saadaval ainult juhul, kui parameeter  <b>Vali h&otilde;lmamiseks pildikiht (-kihid)</b> on mitmem&otilde;&otilde;tmeline raster.
            </p>
        </div>
    </div>
    <div id="bufferDistance">
        <div><h2>Määra puhvrina kasutatava vahemaa väli või väärtus</h2></div>
        <hr/>
        <div>
            <p>M&auml;&auml;ratud vahemaa asukohaandmete objektide &uuml;mber. Puhvervahemaa m&auml;&auml;ratletakse asukohaobjektide ruumiliste referentsi lineaarsetes &uuml;hikutes. Kui objekt kasutab geograafilist referentss&uuml;steemi, kasutatakse &uuml;hikutena kraade.
            </p>
            <p>Andmed arvutatakse selle puhverala piires.
            </p>
            <p>See parameeter on saadaval ainult juhul, kui parameeter  <b>Vali h&otilde;lmamiseks pildikiht (-kihid)</b> on mitmem&otilde;&otilde;tmeline raster.
            </p>
        </div>
    </div>
    <div id="statisticsType">
        <div><h2>Vali andmete tüüp</h2></div>
        <hr/>
        <div>
            <p>Arvutatavate andmete t&uuml;&uuml;p.
            </p>
            <ul>
                <li> <b>Miinimum</b> &ndash; leiab m&auml;&auml;ratud vahemiku minimaalse v&auml;&auml;rtuse.
                </li>
                <li> <b>Maksimum</b> &ndash; leiab m&auml;&auml;ratud vahemiku maksimaalse v&auml;&auml;rtuse.
                </li>
                <li> <b>Mediaan</b> &ndash; leiab m&auml;&auml;ratud vahemiku mediaani v&auml;&auml;rtuse.
                </li>
                <li> <b>Keskmine</b> &ndash; leiab m&auml;&auml;ratud vahemiku keskmise v&auml;&auml;rtuse.
                </li>
                <li> <b>Summa</b> &ndash; arvutab m&auml;&auml;ratud vahemiku muutujate summa.
                </li>
                <li> <b>Enamus</b> &ndash; leiab k&otilde;ige sagedamini esineva v&auml;&auml;rtuse.
                </li>
                <li> <b>V&auml;hemus</b> &ndash; leiab k&otilde;ige harvemini esineva v&auml;&auml;rtuse.
                </li>
                <li> <b>Standardh&auml;lve</b> &ndash; arvutab standardh&auml;lbe.
                </li>
                <li> <b>Protsentiil</b> &ndash; arvutab m&auml;&auml;ratud vahemiku m&auml;&auml;ratletud protsentiili.
                </li>
            </ul>
            
            <p>See parameeter on saadaval ainult juhul, kui parameeter  <b>Vali h&otilde;lmamiseks pildikiht (-kihid)</b> on mitmem&otilde;&otilde;tmeline raster ning parameeter <b>Vali asukoha kiht</b> on murdjoon v&otilde;i pol&uuml;goon v&otilde;i parameeter <b>M&auml;&auml;ra puhvri vahemaa v&auml;li v&otilde;i v&auml;&auml;rtus (valikuline)</b> on m&auml;&auml;ratud.
            </p>
        </div>
    </div>
    <div id="percentileValue">
        <div><h2>Protsentiili väärtus</h2></div>
        <hr/>
        <div>
            <p>See v&auml;&auml;rtus j&auml;&auml;b vahemikku 0 kuni 100. Vaikev&auml;&auml;rtus on 90.
            </p>
            <p>See parameeter on saadaval ainult juhul, kui parameeter  <b>Vali statistika t&uuml;&uuml;p</b> on seatud v&auml;&auml;rtusele <b>Protsentiil</b>.
            </p>
        </div>
    </div>
    <div id="resamplingType">
        <div><h2>Määra korduvvalimi moodustamise meetod</h2></div>
        <hr/>
        <div>
            <p>Korduvvalimi moodustamise algoritm, mida kasutatakse rastrist valimi v&otilde;tmisel.
            </p>
            <ul>
                <li> <b>L&auml;him</b>&mdash;L&auml;him naaber, mis kasutab l&auml;hima lahtri v&auml;&auml;rtust, et m&auml;&auml;rata prooviv&otilde;tmisel v&auml;ljundpikslile v&auml;&auml;rtus. See on vaikevalik.
                </li>
                <li> <b>Bilineaarne</b>&mdash;Bilineaarne interpolatsioon arvutab piksli v&auml;&auml;rtuse, kasutades nelja l&auml;hima piksli kaugusega kaalutud v&auml;&auml;rtust.
                </li>
                <li> <b>Kuupkonvulutsioon</b>&mdash;Kuupkonvolutsioon m&auml;&auml;rab piksli uue v&auml;&auml;rtuse, tuginedes sujuva k&otilde;vera paigutamisele l&auml;bi 16 l&auml;hima sisendpiksli keskpunkti.
                </li>
            </ul>
            
        </div>
    </div>
    <div id="layout">
        <div><h2>Määra väljundi paigutus</h2></div>
        <hr/>
        <div>
            <p>M&auml;&auml;rab selle, kas valimi v&auml;&auml;rtused kuvatakse v&auml;ljundtabelis ridades v&otilde;i veergudes.
            </p>
            <ul>
                <li> <b>Valimi v&auml;&auml;rtused kuvatakse reas</b> &ndash; valimi v&auml;&auml;rtused kuvatakse v&auml;ljundtabeli eri ridades. See on vaikevalik.
                </li>
                <li> <b>Valimi v&auml;&auml;rtused kuvatakse veerus</b> &ndash; valimi v&auml;&auml;rtused kuvatakse v&auml;ljundtabeli eri veergudes.
                </li>
            </ul>
            
            <p>See v&otilde;imalus on saadaval ainult siis, kui parameeter  <b>Valige teisendamiseks pildikiht (-kihid)</b> on mitmem&otilde;&otilde;tmeline raster ja sisaldab &uuml;ht muutujat ja &uuml;ht dimensiooni ning iga l&otilde;ik on &uuml;he ribaga raster.
            </p>
        </div>
    </div>
    <div id="outputType">
        <div><h2>Määra väljundi tüüp</h2></div>
        <hr/>
        <div>
            <p>M&auml;&auml;rab, kas luuakse punktobjektiklass koos valimi v&auml;&auml;rtuste tabeliga v&otilde;i ainult tabel valimi v&auml;&auml;rtustega.
            </p>
            <ul>
                <li> <b>Tabel</b> &ndash; genereerib valimiv&auml;&auml;rtustega tabeli. See on vaikevalik.
                </li>
                <li> <b>Objektid</b> &ndash; genereerib punktobjektiklassi, mille tabelis on valimiv&auml;&auml;rtused. Kui parameetrid <b>vali asukohakiht</b> on pol&uuml;jooned v&otilde;i pol&uuml;goonid, siis on v&auml;ljundi iga punkt sisendi asukohaobjektide geomeetriline tsenter. 
                </li>
            </ul>
            
        </div>
    </div>
    <div id="outputName">
        <div><h2>Tulemkihi nimi</h2></div>
        <hr/>
        <div>
            
            <p>Selle kihi nimi, mis luuakse jaotises  <b>Minu sisu</b> ja lisatakse kaardile. Vaikimisi nimi p&otilde;hineb t&ouml;&ouml;riista nimel ja sisendkihi nimel. Kui kiht on juba olemas, palutakse teil sisestada m&otilde;ni muu nimi.
            </p>
            <p>Saate m&auml;&auml;rata kausta nime jaotises  <b>Minu sisu</b>, kus tulemus salvestatakse ripploendi k&auml;suga <b>Salvesta tulemus kausta</b>.
            </p>
        </div>
    </div>
</div>
</html>
