<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="smallsize">
        <h2>Valgala</h2><p/>
        <h2><img src="../images/GUID-AF749369-8C2D-46FF-9D74-2CF7CAB7C7B0-web.png" alt="Valgala &uuml;lesanne"></h2>
        <hr/>
    <p>See t&ouml;&ouml;vahend m&auml;&auml;rab m&otilde;jupiirkonna, mis paikneb rastris pikslikomplekti kohal.
    </p>
    <p> Louisiana osariigis asuva Mississippi j&otilde;e sisendpunkt loob valgalade funktsiooni, mis h&otilde;lmab ka New Yorgist Montanani ja Kanadasse ulatuvaid alasid.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputFlowDirectionRaster">
        <div><h2>Valige voolusuuna kiht</h2></div>
        <hr/>
        <div>
            <p>Sisendraster, mis n&auml;itab voosuunda igast lahtrist v&auml;lja.
            </p>
            <p>Voolusuuna rastri loomiseks saab kasutada voolusuuna rastri funktsiooni ja need t&ouml;&ouml;tavad vaikevoolusuuna t&uuml;&uuml;biga  <b>D8</b>.
            </p>
        </div>
    </div>
    <div id="inPourPointRasterOrFeatures">
        <div><h2>Määrake sisend-valgumispunkti asukohad</h2></div>
        <hr/>
        <div>
            <p>Sisend-valgumispunkti asukohad.
            </p>
            <p>See v&otilde;ib olla raster v&otilde;i punktobjekt. Rastri puhul v&auml;ljendab see piksleid, millest k&otilde;rgemal m&auml;&auml;ratakse m&otilde;jupiirkond v&otilde;i valgala. K&otilde;iki lahtreid, mis ei ole NoData-lahtrid, kasutatakse l&auml;htelahtritena. Punktsisendi puhul v&auml;ljendab see asukohti, millest k&otilde;rgemal m&auml;&auml;ratakse m&otilde;jupiirkond v&otilde;i valgala.
            </p>
        </div>
    </div>
    <div id="pourPointField">
        <div><h2>Väljavoolupunkti valimine</h2></div>
        <hr/>
        <div>
            <p>Seda v&auml;lja kasutatakse v&auml;&auml;rtuste m&auml;&auml;ramiseks valgumispunkti asukohtadele.
            </p>
            <p>Kui sisend-valgumispunkt on raster, kasutatakse v&auml;&auml;rtust  <i>Value</i>. Kui see on objekt, kasutatakse numbriv&auml;lja. Kui v&auml;li sisaldab ujuvpunktiga v&auml;&auml;rtusi, l&uuml;hendatakse need t&auml;isarvudeks.
            </p>
        </div>
    </div>
    <div id="resultLayer">
        <div><h2>Tulemkihi nimi</h2></div>
        <hr/>
        <div>
            
            <p>Selle kihi nimi, mis luuakse jaotises  <b>Minu sisu</b> ja lisatakse kaardile. Vaikimisi nimi p&otilde;hineb t&ouml;&ouml;riista nimel ja sisendkihi nimel. Kui kiht on juba olemas, palutakse teil sisestada m&otilde;ni muu nimi.
            </p>
            <p>Saate m&auml;&auml;rata kausta nime jaotises  <b>Minu sisu</b>, kus tulemus salvestatakse ripploendi k&auml;suga <b>Salvesta tulemus kausta</b>. Kui teil on õigused nii paanitud kui ka dünaamiliste pildikihtide loomiseks, saate määrata, millist kihitüüpi soovite väljundis kasutada, rakendades ripploendit Salvesta tulemus nimega. </p>
        </div>
    </div>
</div>
</html>
