<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="regularsize">
        <h2>Tsoonipõhine statistika tabelina</h2><p/>
        <h2><img src="../images/GUID-2847466F-BF22-4545-BDCE-7EB7B1D15F2D-web.png" alt="Diagramm Tsoonip&otilde;hine statistika tabelina"></h2>
        <hr/>
    <p>See t&ouml;&ouml;riist v&otilde;tab kokku rastri v&auml;&auml;rtused teise andmestiku tsoonides ja esitab tulemused tabelisse.
    </p>
    <p>M&otilde;ned n&auml;ited selle t&ouml;&ouml;riista kasutusaladest:
        <ul>
            <li>&Uuml;leujutusalade ulatuse ja maakasutuse piirkondade v&otilde;rdluse tulemusena on leitav iga &uuml;leujutuspiirkonna alla j&auml;&auml;va konkreetse kasutatava maa-ala kogupindala.
                

            </li>
            <li>Omavalitsuse piirides paiknevate katastri&uuml;ksuste keskmine maamaksu suurus asustus&uuml;ksuste kaupa.
                

            </li>
        </ul>
        
    </p>
    <p>Kui tingimus  <b>Kasuta praegust kaardi ulatust</b> on m&auml;rgitud, anal&uuml;&uuml;sitakse &uuml;ksnes neid sisendkihi ja summeeritava kihi objekte, mis on kaardil praegu n&auml;htavad. Kui see ruut on m&auml;rkimata, anal&uuml;&uuml;sitakse k&otilde;iki sisendkihi ja summeeritava kihi objekte ka siis, kui neid pole praegu kaardil n&auml;ha.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputZoneRasterOrFeatures">
        <div><h2>Valige tsooni raster või objektid</h2></div>
        <hr/>
        <div>
            <p>Summeeritavate tsoonide v&otilde;i alade piire m&auml;&auml;ratlev sisend.
            </p>
            <p>Sisend v&otilde;ib olla t&auml;isarvuline raster v&otilde;i vektorandmed. Rastrite puhul on tsoonid m&auml;&auml;ratletud k&otilde;ikide asukohtadega sisendis, millel on sama piksliv&auml;&auml;rtus. Objektide puhul v&otilde;ivad tsoonid kattuda. Alad ei pea olema omavahel &uuml;hendatud.
            </p>
        </div>
    </div>
    <div id="zoneField">
        <div><h2>Tsooni väli</h2></div>
        <hr/>
        <div>
            <p>V&auml;li, mis sisaldab iga tsooni m&auml;&auml;ratlevaid v&auml;&auml;rtusi.
            </p>
            <p>See v&otilde;ib olla t&auml;isarv v&otilde;i tsooni andmekogumi stringiv&auml;li.
            </p>
        </div>
    </div>
    <div id="inputValueRaster">
        <div><h2>Valige väärtusraster</h2></div>
        <hr/>
        <div>
            <p>Raster, mis sisaldab v&auml;&auml;rtusi, mille alusel arvutatakse statistika.
            </p>
            <p>See v&otilde;ib olla t&auml;isarv v&otilde;i ujukomat&uuml;&uuml;pi arv. Kui sisendv&auml;&auml;rtuse raster on ujukomaga t&uuml;&uuml;pi, ei saa teha sisendite Enamus, V&auml;hemus ja Variatsioon p&otilde;hiseid arvutusi.
            </p>
        </div>
    </div>
    <div id="ignoreNodata">
        <div><h2>Eira arvutustes väärtust NoData (valikuline)</h2></div>
        <hr/>
        <div>
            <p> M&auml;&auml;rab &auml;ra, kas NoData v&auml;&auml;rtusi anal&uuml;&uuml;sis ignoreerida.
            </p>
            <ul>
                <li>M&auml;rgitud &mdash; anal&uuml;&uuml;s h&otilde;lmab lahtreid, millel on v&auml;&auml;rtus sisendv&auml;&auml;rtuse rastris mis tahes konkreetses tsoonis, et m&auml;&auml;rata selle tsooni v&auml;ljundv&auml;&auml;rtus. V&auml;&auml;rtuse rastris olevaid NoData-lahtreid eiratakse statistilises arvutuses. See on vaikevalik.
                </li>
                <li>M&auml;rkimata -- kui konkreetses tsoonis on v&auml;&auml;rtusrastri lahtrites NoData-v&auml;&auml;rtusi, on anal&uuml;&uuml;si tulemuseks NoData.
                </li>
            </ul>
            
        </div>
    </div>
    <div id="statisticType">
        <div><h2>Statistika tüüp (valikuline)</h2></div>
        <hr/>
        <div>
            <p>M&auml;&auml;rab arvutatava statistika t&uuml;&uuml;bi.
            </p>
            <p> Sisend v&otilde;ib olla &uuml;ks j&auml;rgmistest: <b>K&otilde;ik</b>, <b>Keskmine</b>, <b>Enamus</b>, <b>Maksimum</b>, <b>Mediaan</b>, <b>Miinimum</b>, <b>V&auml;hemus</b>, <b>Protsentiil</b>, <b>Vahemik</b>, <b>Standardh&auml;lve</b>, <b>Summa</b>, <b>Variatsioon</b>, <b>Miinimum ja maksimum</b>, <b>Keskmine ja standardh&auml;lve</b> v&otilde;i <b>Miinimum, maksimum ja keskmine</b>. Vaikev&auml;&auml;rtus on <b>K&otilde;ik</b>.
            </p>
        </div>
    </div>
    <div id="percentileValues">
        <div><h2>Protsentiili väärtused (valikuline)</h2></div>
        <hr/>
        <div>
            <p>Arvutatav protsentiil. Vaikev&auml;&auml;rtus on 90, mis n&auml;itab 90. protsentiili.
            </p>
            <p>V&auml;&auml;rtus v&otilde;ib olla vahemikus 0 kuni 100. 0. protsentiili m&auml;&auml;ramise tulemus on sisuliselt v&otilde;rdne miinimumstatistikaga ja 100. protsentiil on v&otilde;rdne maksimumiga. V&auml;&auml;rtus 50 annab sisuliselt sama tulemuse kui mediaanstatistika.
            </p>
            <p> Seda parameetrit toetatakse ainult juhul, kui parameetri <b>Statistika t&uuml;&uuml;p</b> v&auml;&auml;rtuseks on m&auml;&auml;ratud <b>Protsentiil</b> v&otilde;i <b>K&otilde;ik</b>.
            </p>
        </div>
    </div>
    <div id="percentileInterpolationType">
        <div><h2>Protsentiili interpoleerimise tüüp (valikuline)</h2></div>
        <hr/>
        <div>
            <p>M&auml;&auml;rab protsentiili interpoleerimise meetodi, mida kasutatakse juhul, kui sisendrastri arvutatavate v&auml;&auml;rtuste arv on &uuml;htlane.
            </p>
            <ul>
                <li>  <b>Automaatne tuvastamine</b>&mdash;Kui sisendv&auml;&auml;rtuse raster on t&auml;isarvuga piksli t&uuml;&uuml;pi, kasutatakse meetodit <b>L&auml;him</b>. Kui sisendv&auml;&auml;rtuse raster on ujukomaga t&uuml;&uuml;pi, kasutatakse meetodit <b>Lineaarne</b>. See on vaikevalik.
                </li>
                <li> <b>L&auml;him</b>&mdash;Kasutatakse soovitud protsentiili l&auml;himat saadaolevat v&auml;&auml;rtust.
                </li>
                <li> <b>Lineaarne</b>&mdash; Kasutatakse soovitud protsentiili kahe &uuml;mbritseva v&auml;&auml;rtuse kaalutud keskmist.
                </li>
            </ul>
            
            <p> Seda parameetrit toetatakse ainult juhul, kui parameetri <b>Statistika t&uuml;&uuml;p</b> v&auml;&auml;rtuseks on m&auml;&auml;ratud <b>Protsentiil</b> v&otilde;i <b>K&otilde;ik</b>.
            </p>
        </div>
    </div>
    <div id="processAsMultidimensional">
        <div><h2>Töötle mitmemõõtmelisena (valikuline)</h2></div>
        <hr/>
        <div>
            <p>M&auml;&auml;rab, kuidas mitmem&otilde;&otilde;tmelise pildi teenuseid t&ouml;&ouml;deldakse, kui need on mitmem&otilde;&otilde;tmelised.
            </p>
            <ul>
                <li>M&auml;rgitud - statistika arvutatakse sisendi mitmem&otilde;&otilde;tmelise andmestiku praegusest l&otilde;igust. See on vaikevalik.
                    

                </li>
                <li>M&auml;rkimata - statistika arvutatakse sisendi mitmem&otilde;&otilde;tmelise andmestiku k&otilde;ikide m&otilde;&otilde;tmete kohta.
                </li>
            </ul>
            
        </div>
    </div>
    <div id="outputTableName">
        <div><h2>Tulemtabeli nimi</h2></div>
        <hr/>
        <div>
            <p>Selle kihi nimi, mis luuakse jaotises  <b>Minu sisu</b> ja lisatakse kaardile. Vaikimisi nimi p&otilde;hineb t&ouml;&ouml;riista nimel ja sisendkihi nimel. Kui kiht on juba olemas, palutakse teil sisestada m&otilde;ni muu nimi.
            </p>
            <p>Saate m&auml;&auml;rata kausta nime jaotises  <b>Minu sisu</b>, kus tulemus salvestatakse ripploendi k&auml;suga <b>Salvesta tulemus kausta</b>.
            </p>
        </div>
    </div>
</div>
</html>
