<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="regularsize">
        <h2>Çok Boyutlu Rasterı Topla</h2><p/>
        <h2><img src="../images/GUID-2C2320A3-EC6E-4FFC-B59B-9551BB02C545-web.png" alt="&Ccedil;ok Boyutlu Rasterı Topla"></h2>
        <hr/>
    <p>Generates a multidimensional raster dataset by combining existing multidimensional raster variables along a dimension.
    </p>
    <p>30 yıllık deniz y&uuml;zeyi sıcaklık verileriniz varsa, aylık olarak ve 100 metreye kadar her 5 metrede bir derinlikte toplanmışsa, bazı &ouml;rnek uygulamalar aşağıda verilmiştir:
        <ul>
            <li>Aylık sıcaklık verilerini yıllık olarak toplayın.
            </li>
            <li>Aylık sıcaklık verilerini 4 aylık aralıklarla toplayın.
            </li>
            <li>0 ila 25 metre, ardından 25 ila 50 metre, ardından 50 ila 100 metre arasındaki sıcaklık verilerini toplayın.
            </li>
        </ul>
        
    </p>
    <p> <b>Ge&ccedil;erli harita yayılımını kullan</b> işaretliyse, ge&ccedil;erli harita yayılımı dahilinde g&ouml;r&uuml;n&uuml;r olan katman değişkenleri analiz edilir. İşaretli değilse, ge&ccedil;erli harita yayılımının dışında bile olsa t&uuml;m katmanın değişkenleri analiz edilir.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputMultidimensionalRaster">
        <div><h2>Toplanacak çok boyutlu görüntü katmanını seçin</h2></div>
        <hr/>
        <div>
            <p>&Ccedil;ok boyutlu rasterın toplanacak girdi g&ouml;r&uuml;nt&uuml;leme katmanı.
            </p>
        </div>
    </div>
    <div id="dimension">
        <div><h2>Toplanacak boyutu seçin</h2></div>
        <hr/>
        <div>
            <p>Toplama boyutu. Bu, değişkenlerin toplanacağı boyuttur.
            </p>
        </div>
    </div>
    <div id="variables">
        <div><h2>Toplanacak değişkenleri seçin</h2></div>
        <hr/>
        <div>
            <p>Verilen boyut boyunca toplanacak değişken veya değişkenler. Değişken belirtilmediğinde, se&ccedil;ilen boyuta sahip t&uuml;m değişkenler toplanır.
            </p>
            <p>&Ouml;rneğin, g&uuml;nl&uuml;k sıcaklık verilerinizi, aylık ortalama değerler olarak toplamak i&ccedil;in sıcaklığı toplanacak değişken olarak belirtin. Herhangi bir değişken belirtmezseniz ve hem g&uuml;nl&uuml;k sıcaklık hem de g&uuml;nl&uuml;k yağış değişkenlerine sahipseniz, her iki değişken de aylık ortalamalar olarak toplanır ve &ccedil;ıktı &ccedil;ok boyutlu rasterı her iki değişkeni de i&ccedil;erir.
            </p>
        </div>
    </div>
    <div id="aggregationMethod">
        <div><h2>Toplama yöntemini seç</h2></div>
        <hr/>
        <div>
            <p>Toplanan dilimleri bir aralıkta birleştirmek i&ccedil;in kullanılacak matematiksel y&ouml;ntemi belirtir.
                <ul>
                    <li> <b>Ortalama</b>&mdash;Bir pikselin değerlerinin aralıktaki t&uuml;m dilimlerdeki ortalamasını hesaplar. Varsayılan değerdir.
                    </li>
                    <li> <b>Maksimum</b>&mdash;Bir pikselin aralıktaki t&uuml;m dilimlerdeki maksimum değerini hesaplar.
                    </li>
                    <li> <b>&Ccedil;oğunluk</b>&mdash;Aralıktaki t&uuml;m dilimler arasında bir piksel i&ccedil;in en sık meydana gelen değeri hesaplar.
                    </li>
                    <li> <b>Minimum</b>&mdash;Bir pikselin aralıktaki t&uuml;m dilimlerdeki minimum değerini hesaplar.
                    </li>
                    <li> <b>Azınlık</b>&mdash;Aralıktaki t&uuml;m dilimler arasında bir piksel i&ccedil;in en az sıklıkta meydana gelen değeri hesaplar.
                    </li>
                    <li> <b>Ortanca</b>&mdash;Bir pikselin aralıktaki t&uuml;m dilimlerdeki ortanca değerini hesaplar.
                    </li>
                    <li> <b>Y&uuml;zdelik</b>&mdash;Bir piksele ilişkin değerlerin y&uuml;zdelik dilimi, aralıktaki t&uuml;m dilimlerde hesaplanır. Y&uuml;zde 90 varsayılan olarak hesaplanır. <b>Y&uuml;zdelik değer</b> parametresini kullanarak diğer değerleri (0'dan 100'e) belirtebilirsiniz.
                    </li>
                    <li> <b>Aralık</b>&mdash;Bir pikselin aralıktaki t&uuml;m dilimlerdeki değer aralığını hesaplar.
                    </li>
                    <li> <b>Standart Sapma</b>&mdash;Bir pikselin değerlerinin aralıktaki t&uuml;m dilimlerdeki standart sapmasını hesaplar.
                    </li>
                    <li> <b>Toplam</b>&mdash;Bir pikselin değerlerinin aralıktaki t&uuml;m dilimlerdeki toplamını hesaplar.
                    </li>
                    <li> <b>&Ccedil;eşitli</b>&mdash;Bir pikselin aralıktaki t&uuml;m dilimlerdeki benzersiz değerlerini hesaplar.
                    </li>
                    <li> <b>&Ouml;zel</b>&mdash;Bir pikselin değerini &ouml;zel bir raster fonksiyonu temelinde hesaplar.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="aggregationFunction">
        <div><h2>Raster fonksiyonu şablonunu seç</h2></div>
        <hr/>
        <div>
            <p>Toplanan rasterların piksel değerlerini hesaplamak i&ccedil;in kullanılacak &ouml;zel bir raster fonksiyonu. Bu girdi, portaldaki bir raster fonksiyonu şablonu &ouml;gesidir.  <b>Toplama Y&ouml;ntemi</b> <b>&Ouml;zel</b> olarak ayarlanırsa bu girdi gereklidir.
            </p>
        </div>
    </div>
    <div id="aggregationDefinition">
        <div><h2>Toplama tanımını seç</h2></div>
        <hr/>
        <div>
            <p>Verilerin toplanacağı boyut aralığını belirtir.
                <ul>
                    <li> <b>T&uuml;m&uuml;</b>&mdash;T&uuml;m dilimlerdeki veri değerleri k&uuml;melenir. Varsayılan değerdir.
                    </li>
                    <li> <b>Aralık Anahtar S&ouml;zc&uuml;ğ&uuml;</b>&mdash;Değişken verileri, genel olarak bilinen bir aralık kullanılarak k&uuml;melenir.
                    </li>
                    <li> <b>Aralık Değeri</b>&mdash;Değişken verileri, kullanıcı tarafından belirlenen bir aralık ve birim kullanılarak k&uuml;melenir.
                    </li>
                    <li> <b>Aralık Aralıkları</b>&mdash;Belirtilen değer &ccedil;iftleri veya tarihler arasındaki değişken verileri k&uuml;melenir.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="intervalKeyword">
        <div><h2>Anahtar sözcük aralığını seç</h2></div>
        <hr/>
        <div>
            <p>Boyut boyunca toplama yapılırken kullanılacak anahtar s&ouml;zc&uuml;k aralığını belirtir.  <b>Toplama Tanımı</b> <b>Aralık Anahtar S&ouml;zc&uuml;ğ&uuml;</b> olarak ayarlanırsa bu girdi gereklidir ve toplama zamana g&ouml;re yapılmalıdır.
                <ul>
                    <li> <b>Saatlik</b>&mdash;Veri değerleri saatlik zaman adımlarında k&uuml;melenir ve sonu&ccedil; zaman serisindeki her saati i&ccedil;erir.
                    </li>
                    <li> <b>G&uuml;nl&uuml;k</b>&mdash;Veri değerleri g&uuml;nl&uuml;k zaman adımlarında k&uuml;melenir ve sonu&ccedil; zaman serisindeki her g&uuml;n&uuml; i&ccedil;erir.
                    </li>
                    <li> <b>Haftalık</b>&mdash;Veri değerleri haftalık zaman adımlarında k&uuml;melenir ve sonu&ccedil; zaman serisindeki her haftayı i&ccedil;erir.
                    </li>
                    <li> <b>Aylık</b>&mdash;Veri değerleri aylık zaman adımlarında k&uuml;melenir ve sonu&ccedil; zaman serisindeki her ayı i&ccedil;erir.
                    </li>
                    <li> <b>&Uuml;&ccedil; Aylık</b>&mdash;Veri değerleri &uuml;&ccedil; aylık zaman adımlarında k&uuml;melenir ve sonu&ccedil; zaman serisindeki her &uuml;&ccedil; ayı i&ccedil;erir.
                    </li>
                    <li> <b>Yıllık</b>&mdash;Veri değerleri yıllık zaman adımlarında k&uuml;melenir ve sonu&ccedil; zaman serisindeki her yılı i&ccedil;erir.
                    </li>
                    <li> <b>G&uuml;nl&uuml;k Tekrarlanır</b>&mdash;Veri değerleri g&uuml;nl&uuml;k zaman adımlarında k&uuml;melenir ve sonu&ccedil; her J&uuml;lyen g&uuml;n&uuml; i&ccedil;in bir toplam değer i&ccedil;erir. &Ccedil;ıktı en fazla 366 g&uuml;nl&uuml;k zaman dilimini i&ccedil;erir.
                    </li>
                    <li> <b>Haftalık Tekrarlanır</b>&mdash;Veri değerleri haftalık zaman adımlarında k&uuml;melenir ve sonu&ccedil; her hafta i&ccedil;in bir toplam değer i&ccedil;erir. &Ccedil;ıktı en fazla 53 haftalık zaman dilimini i&ccedil;erir.
                    </li>
                    <li> <b>Aylık Tekrarlanır</b>&mdash;Veri değerleri Ay zaman adımlarında k&uuml;melenir ve sonu&ccedil; her ay i&ccedil;in bir toplam değer i&ccedil;erir. &Ccedil;ıktı en fazla 12 aylık zaman dilimini i&ccedil;erir.
                    </li>
                    <li> <b>&Uuml;&ccedil; ayda bir tekrarlanır</b>&mdash;Veri değerleri &uuml;&ccedil; aylık zaman adımlarında k&uuml;melenir ve sonu&ccedil; her &uuml;&ccedil; ay i&ccedil;in bir toplam değer i&ccedil;erir. &Ccedil;ıktı en fazla 4 &uuml;&ccedil; aylık zaman dilimini i&ccedil;erir.
                    </li>
                    <li> <b>On G&uuml;nl&uuml;k</b>&mdash;Veri değerleri, her biri 10 g&uuml;nl&uuml;k 3 d&ouml;nemde k&uuml;melenir. Son d&ouml;nem 10 g&uuml;nden az veya daha fazla g&uuml;n i&ccedil;erebilir. &Ccedil;ıktı, her ay i&ccedil;in 3 dilim i&ccedil;erir.
                    </li>
                    <li> <b>Beş G&uuml;nl&uuml;k</b>&mdash;Veri değerleri, her biri 5 g&uuml;nl&uuml;k 6 d&ouml;nemde k&uuml;melenir. Son d&ouml;nem 5 g&uuml;nden az veya daha fazla g&uuml;n i&ccedil;erebilir. &Ccedil;ıktı, her ay i&ccedil;in 6 dilim i&ccedil;erir.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="intervalValue">
        <div><h2>Değer Aralığı</h2></div>
        <hr/>
        <div>
            <p>Toplama i&ccedil;in kullanılacak aralık boyutu.  <b>Toplama Tanımı</b> <b>Aralık Değeri</b> olarak ayarlanırsa bu parametre gereklidir.
            </p>
            <p>&Ouml;rneğin, 30 yıllık aylık sıcaklık verilerini 5 yıllık artışlarla toplamak i&ccedil;in  <b>Değer Aralığı</b>&rsquo;na 5 değerini girin ve <b>Birimi</b> <b>Yıl</b> olarak belirtin.
            </p>
        </div>
    </div>
    <div id="intervalUnit">
        <div><h2>Birim</h2></div>
        <hr/>
        <div>
            <p>Aralık değeri i&ccedil;in kullanılacak birim.  <b>Boyut</b> bir zaman alanı olduğunda ve <b>Toplama Tanımı</b> <b>Aralık Değeri</b> olarak ayarlanırsa bu girdi gereklidir.
            </p>
            <p>Zaman dışında herhangi bir şey &uuml;zerinde toplama yapıyorsanız, bu se&ccedil;enek kullanılamaz ve aralık değeri birimi girdi &ccedil;ok boyutlu raster verisinin değişken birimi ile eşleşir.
                <ul>
                    <li> <b>Saatler</b>&mdash;Veri değerleri, sağlanan aralıklarla saatlik zaman dilimleri i&ccedil;inde k&uuml;melenir.
                    </li>
                    <li> <b>G&uuml;nler</b>&mdash;Veri değerleri, sağlanan aralıklarla g&uuml;nl&uuml;k zaman dilimleri i&ccedil;inde k&uuml;melenir.
                    </li>
                    <li> <b>Haftalar</b>&mdash;Veri değerleri, sağlanan aralıklarla haftalık zaman dilimleri i&ccedil;inde k&uuml;melenir.
                    </li>
                    <li> <b>Aylar</b>&mdash;Veri değerleri, sağlanan aralıklarla aylık zaman dilimleri i&ccedil;inde k&uuml;melenir.
                    </li>
                    <li> <b>Yıllar</b>&mdash;Veri değerleri, sağlanan aralıklarla yıllık zaman dilimleri i&ccedil;inde k&uuml;melenir.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="intervalRanges">
        <div><h2>Aralıkları tanımla</h2></div>
        <hr/>
        <div>
            <p>Aralık aralıkları, değer gruplarını toplamak i&ccedil;in kullanılır. Veri t&uuml;r&uuml; &Ccedil;ift veya Tarih olan minimum ve maksimum aralık değeri &ccedil;iftlerinden oluşur.  <b>Toplama Tanımı</b> <b>Aralık Aralıkları</b> olarak ayarlanırsa bu girdi gereklidir.
            </p>
        </div>
    </div>
    <div id="ignoreNodata">
        <div><h2>Hesaplamadaki eksik değerleri yoksay</h2></div>
        <hr/>
        <div>
            <p>Eksik değerlerin analizde g&ouml;z ardı edilip edilmeyeceğini belirtir.
                <ul>
                    <li>İşaretli&mdash;Analizde verilen bir boyut boyunca ge&ccedil;erli olan t&uuml;m pikseller yer alır ancak NoData pikselleri dikkate alınmaz. Varsayılan değerdir.
                    </li>
                    <li>İşaretli değil&mdash;Verilen boyut boyunca mevcut pikseller i&ccedil;in herhangi bir NoData değeri varsa, analiz NoData ile sonu&ccedil;lanır.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Sonuç katmanı adı</h2></div>
        <hr/>
        <div>
            
            <p> <b>İ&ccedil;eriğim</b>'de oluşturulacak ve haritaya eklenecek katmanın adı. Varsayılan ad, ara&ccedil; adına ve girdi katmanı adına dayanır. Katman zaten mevcutsa, başka bir ad sağlamanız istenir.
            </p>
            <p> <b>İ&ccedil;eriğim</b>&rsquo;de, <b>Sonu&ccedil;ları Kaydet</b> a&ccedil;ılır kutusunu kullanarak sonucun kaydedileceği klas&ouml;r&uuml;n adını belirleyebilirsiniz. Hem döşemeli hem de dinamik görüntü katmanları oluşturma ayrıcalıklarınız varsa, Sonucu farklı kaydet açılır kutusunu kullanarak çıktıda hangi katman türünün oluşturulacağını belirtebilirsiniz. </p>
        </div>
    </div>
    <div id="percentileValue">
        <div><h2>Yüzde değeri</h2></div>
        <hr/>
        <div>
            <p>Hesaplanacak olan y&uuml;zde. Varsayılan 90'dır ve 90. y&uuml;zdelik dilimi g&ouml;sterir.
            </p>
            <p>Değerler 0 ile 100 arasında değişebilir. Y&uuml;zde 0, temelde minimum istatistiğe ve y&uuml;zde 100, maksimum istatistiğe eşittir. 50 değeri temelde ortanca istatistiğiyle aynı sonucu &uuml;retir.
            </p>
        </div>
    </div>
    <div id="percentileInterpolationType">
        <div><h2>Yüzde enterpolasyon türü</h2></div>
        <hr/>
        <div>
            <p>Girdi rasterında &ccedil;ift sayıda değer hesaplanacak olduğunda kullanılacak olan y&uuml;zdelik enterpolasyon y&ouml;ntemini belirtir.
            </p>
        </div>
    </div>
</div>
</html>
