<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="smallsize">
        <h2>Forudsig ved brug af tendensraster</h2><p/>
        <h2><img src="../images/GUID-E3758820-51A9-46DE-AAF6-E27B68DE4012-web.png" alt="Forudsig ved brug af tendensraster"></h2>
        <hr/>
    <p>Beregner en forventet flerdimensional raster ved hj&aelig;lp af output-tendensrasteren fra v&aelig;rkt&oslash;jet  Generer tendensraster.
    </p>
    <p>Hvis feltet  <b>Brug aktuel kortudstr&aelig;kning</b> er markeret, er det variabler fra laget, der er synlige inden for den aktuelle kortudstr&aelig;kning, der analyseres. Hvis markeringen fjernes, analyseres variabler fra hele laget, ogs&aring; selvom de er placeret uden for den aktuelle kortudstr&aelig;kning.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputMultidimensionalRaster">
        <div><h2>Vælg det flerdimensionale billedlag, der skal forudsiges</h2></div>
        <hr/>
        <div>
            <p>Den flerdimensionale input-tendensraster fra v&aelig;rkt&oslash;jet  Generer tendensraster.
            </p>
        </div>
    </div>
    <div id="variables">
        <div><h2>Vælg den eller de variabler, der forudsiges</h2></div>
        <hr/>
        <div>
            <p>Den eller de variabler, der forudsiges i analysen. Hvis ingen variabler er angivet, bruges alle variabler.
            </p>
        </div>
    </div>
    <div id="dimensionDefinition">
        <div><h2>Vælg den metode, der bruges til at tilvejebringe forudsigelsesdimensionværdier.</h2></div>
        <hr/>
        <div>
            <p>Angiver den metode, der bruges til at tilvejebringe forudsigelsesdimensionv&aelig;rdier.
                <ul>
                    <li> <b>Efter v&aelig;rdi</b>&mdash;Forudsigelsen beregnes for en enkelt dimensions v&aelig;rdi eller en liste over v&aelig;rdier, der angives i n&aelig;ste trin. Dette er standardv&aelig;rdien. Hvis du f.eks. &oslash;nsker at forudsige &aring;rlig nedb&oslash;r for &aring;rene 2050, 2100 og 2150.
                    </li>
                    <li> <b>Efter interval</b>&mdash;Forudsigelsen beregnes for et interval af den dimension, der er defineret ved en start og en slutv&aelig;rdi. Hvis du f.eks. &oslash;nsker at forudsige &aring;rlig nedb&oslash;r for &aring;rene mellem 2050 og 2150.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="dimensionValues">
        <div><h2>Angiv målværdi(er) for forudsigelse</h2></div>
        <hr/>
        <div>
            <p>Dimensionsv&aelig;rdien eller -v&aelig;rdierne, der skal bruges i forudsigelsen.
            </p>
            <p>Tids-, dybde- og h&oslash;jdev&aelig;rdiernes format skal matche det format for dimensionsv&aelig;rdierne, som bruges til at generere tendensrasteren. Hvis tendensrasteren blev genereret til StdTime-dimensionen, b&oslash;r formatet v&aelig;re &Aring;&Aring;&Aring;&Aring;-MM-DDTTT:MM:SS, f.eks. 2050-01-01T00:00:00. Flere v&aelig;rdier adskilles med et semikolon.
            </p>
            <p>Denne parameter er p&aring;kr&aelig;vet, n&aring;r metoden  <b>Efter v&aelig;rdi</b> er valgt til at definere dimensionsv&aelig;rdier for forudsigelse.
            </p>
        </div>
    </div>
    <div id="start">
        <div><h2>Start</h2></div>
        <hr/>
        <div>
            <p>Startdato, h&oslash;jde eller dybde af dimensionsintervallet, der skal bruges i forudsigelsen.
            </p>
        </div>
    </div>
    <div id="end">
        <div><h2>Slut</h2></div>
        <hr/>
        <div>
            <p>Slutdato, h&oslash;jde eller dybde af dimensionsintervallet, der skal bruges i forudsigelsen.
            </p>
        </div>
    </div>
    <div id="dimensionInterval">
        <div><h2>Definér det dimensionsinterval, der skal forudsiges</h2></div>
        <hr/>
        <div>
            <p>Defin&eacute;r start- og slutdato, h&oslash;jde eller dybde af dimensionsintervallet, der skal bruges i forudsigelsen.
            </p>
        </div>
    </div>
    <div id="intervalValue">
        <div><h2>Angiv antallet af trin mellem start- og slutværdierne</h2></div>
        <hr/>
        <div>
            <p>Antallet af trin mellem to dimensionsv&aelig;rdier, der skal inkluderes i beregningen. Standardv&aelig;rdien er 1.
            </p>
            <p>Hvis du eksempelvis vil forudsige temperaturv&aelig;rdier hvert femte &aring;r, skal du bruge en v&aelig;rdi p&aring; 5.
            </p>
        </div>
    </div>
    <div id="intervalUnit">
        <div><h2>Vælg den enhed, der skal bruges til tidsværdi-intervallet.</h2></div>
        <hr/>
        <div>
            <p>Angiv den enhed, der bliver brugt til v&aelig;rdiintervallet. Dette g&aelig;lder kun, n&aring;r analysens dimension er en tidsdimension.
            </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Navn på resultatlag</h2></div>
        <hr/>
        <div>
            
            <p>Navnet p&aring; det lag, som oprettes under  <b>Mit indhold</b> og f&oslash;jes til kortet. Standardnavnet er baseret p&aring; navnet p&aring; v&aelig;rkt&oslash;jet og navnet p&aring; inputlaget. Hvis laget allerede findes, vil du blive bedt om at angive et andet navn.
            </p>
            <p>Du kan angive navnet p&aring; en mappe i  <b>Mit indhold</b>, hvor resultatet bliver gemt ved at benytte rullelisten <b>Gem resultat i</b>. Hvis du har rettigheder til at oprette både tile-billedlag og dynamiske billedlag, kan du angive, hvilken type lag der skal genereres i outputtet ved hjælp af Gem resultat som-rullelisten. </p>
        </div>
    </div>
</div>
</html>
