<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Summér inden for</h2><p/>
        <h2><img src="../images/GUID-90E0CB1F-EB97-4752-B2EE-452B7B45475E-web.png" alt="Summ&eacute;r inden for"></h2>
        <hr/>
    <p>Dette v&aelig;rkt&oslash;j finder objekter (og dele af objekter), der ligger inden for gr&aelig;nserne for omr&aring;der i det f&oslash;rste inputlag.   
        <ul>
            <li>Ved angivelse af et lag med afvandingsomr&aring;der og et lag med gr&aelig;nser for arealanvendelse beregnes det samlede areal for anvendelsestype pr. afvandingsomr&aring;de. 
            </li>
            <li>Ved angivelse af et lag med parceller i et amt og et lag med bygr&aelig;nser opsummeres gennemsnitsv&aelig;rdien af ledige parceller inden for hver bygr&aelig;nse.
            </li>
        </ul>
        
    </p>
    <p>Hvis  <b>Anvend aktuel kortudstr&aelig;kning</b> er markeret, er det kun objekterne i inputlaget og laget, som skal summeres, der er synlige inden for den aktuelle kortudstr&aelig;kning, der analyseres. Hvis umarkeret, analyseres alle objekter i b&aring;de inputlaget og laget, der skal summeres, ogs&aring; selvom de befinder sig uden for den aktuelle kortudstr&aelig;kning.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="sumWithinLayer">
        <div><h2>Vælg det områdelag, der skal summere andre objekter inden for sine grænser</h2></div>
        <hr/>
        <div>
            <p>Det omr&aring;delag, der skal benyttes til at summere objekter, der falder inden for omr&aring;dets gr&aelig;nser. Du kan v&aelig;lge mellem et polygonlag, som du opretter, eller kvadratiske eller sekskantede beholdere, der genereres, n&aring;r v&aelig;rkt&oslash;jet k&oslash;rer. N&aring;r der genereres beholdere, er det for  <b>Kvadratiske</b> beholdere antallet af angivne enheder, der bestemmer h&oslash;jden og l&aelig;ngden p&aring; kvadratet. For <b>Sekskantede</b> beholdere er det antallet af angivne enheder, der bestemmer afstanden mellem de parallelle sider.
            </p>
            <p>Udover at du kan v&aelig;lge et lag i dit kort, kan du v&aelig;lge  <b>Gennemse lag</b> nederst p&aring; rullelisten for at g&aring; til dit indhold til et big data-fildelingsdatas&aelig;t eller -vektorlag.  
            </p>
        </div>
    </div>
    <div id="summaryLayer">
        <div><h2>Vælg et lag at summere</h2></div>
        <hr/>
        <div>
            <p>Objekter i dette lag, der falder inden for objekternes gr&aelig;nser i inputlaget, eller de beholdere, der er angivet ovenfor, opsummeres. 
            </p>
            <p>Udover at du kan v&aelig;lge et lag i dit kort, kan du v&aelig;lge  <b>Gennemse lag</b> nederst p&aring; rullelisten for at g&aring; til dit indhold til et big data-fildelingsdatas&aelig;t eller -vektorlag.  
            </p>
        </div>
    </div>
    <div id="inputBins">
        <div><h2>Vælg en afstand til generering af intervaller og aggregering</h2></div>
        <hr/>
        <div>
            <p>Den afstand, der benyttes til at generere beholdere.  
            </p>
            <p> <b>Beholderst&oslash;rrelse</b> eller <b>Omr&aring;delag</b> skal v&aelig;re indstillet.
            </p>
        </div>
    </div>
    <div id="timeSlicing">
        <div><h2>Aggregér ved hjælp af tidsintervaller (valgfrit)</h2></div>
        <hr/>
        <div>
            <p>Hvis der er aktiveret tid for inputpunktlaget, og det tilh&oslash;rer &oslash;jeblikstypen, kan du analysere ved hj&aelig;lp af tidsintervaller. Du kan indstille tre parametre, n&aring;r du bruger tiden:
                <ul>
                    <li>  <b>Tidsinterval</b>
                    </li>
                    <li> <b>Tidstrin</b>
                    </li>
                    <li> <b>Referencetid</b>
                    </li>
                </ul>
                
            </p>
            <p>Forestil dig, at du har data, der repr&aelig;senterer et &aring;r i tiden, og at du &oslash;nsker at analysere ved hj&aelig;lp af ugentlige tidsintervaller. For at g&oslash;re dette skal du indstille  <b>Tidsinterval</b> til <code>1 uge</code>.
            </p>
            <p> Forestil dig, at du har data, der repr&aelig;senterer et &aring;r i tiden, og at du &oslash;nsker at analysere ved hj&aelig;lp af den f&oslash;rste uge i m&aring;neden. For at g&oslash;re dette skal du indstille <b>Tidsinterval</b> til <code>1 uge</code>, <b>Tidstrin</b> til <code>1 m&aring;ned</code> og <b>Referencetid</b> til <code>1. januar kl. 12:00 AM</code>.
            </p>
        </div>
    </div>
    <div id="timeInterval">
        <div><h2>Tidsinterval, der skal aggregeres til</h2></div>
        <hr/>
        <div>
            <p>Det tidsinterval, der benyttes til opdele tiden. Tidsinterval kan benyttes alene elle sammen med  <b>Tidstrin</b>- eller <b>Referencetid</b>-parameteren.
            </p>
            <p> Hvis du &oslash;nskede at oprette tidsintervaller, som finder sted hver mandag fra kl. 9:00 til kl. 10:00., ville <b>Tidsinterval</b> v&aelig;re <code>1 time</code>, <b>Tidstrin</b> ville v&aelig;re <code>1 uge</code>, og <b>Referencetid</b> ville v&aelig;re <code>9:00:00 om mandagen</code>.
            </p>
        </div>
    </div>
    <div id="timeStep">
        <div><h2>Tidstrin, der skal aggregeres til</h2></div>
        <hr/>
        <div>
            <p> Det tidstrin, der benyttes til at beregne tidsopdelingen. <b>Tidstrin</b> kan benyttes alene elle sammen med <b>Tidsinterval</b>, sammen med <b>Referencetid</b> eller sammen med b&aring;de <b>Tidsinterval</b> og <b>Referencetid</b>.
            </p>
            <p> Hvis du &oslash;nskede at oprette tidsintervaller, som finder sted hver mandag fra kl. 9:00 til kl. 10:00., ville <b>Tidsinterval</b> v&aelig;re <code>1 time</code>, <b>Tidstrin</b> ville v&aelig;re <code>1 uge</code>, og <b>Referencetid</b> ville v&aelig;re <code>9:00:00 om mandagen</code>.
            </p>
        </div>
    </div>
    <div id="timeReference">
        <div><h2>Referencetid, der benyttes til at justere tidsintervaller</h2></div>
        <hr/>
        <div>
            <p>Den dato og det klokkesl&aelig;t, der benyttes til at justere tidsintervallerne.  <b>Tidstrin</b> starter fra og forts&aelig;tter bagud med den tid, der er angivet af referencetiden.
            </p>
            <p> Hvis du &oslash;nskede at oprette tidsintervaller, som finder sted hver mandag fra kl. 9:00 til kl. 10:00., ville <b>Tidsinterval</b> v&aelig;re <code>1 time</code>, <b>Tidstrin</b> ville v&aelig;re <code>1 uge</code>, og <b>Referencetid</b> ville v&aelig;re <code>9:00:00 om mandagen</code>.
            </p>
        </div>
    </div>
    <div id="summaryFields">
        <div><h2>Tilføj statistik fra det lag, der skal summeres (valgfrit)</h2></div>
        <hr/>
        <div>
            <p> Du kan beregne statistik for objekter, der er summeret. For numeriske felter kan du beregne f&oslash;lgende:
                <ul>
                    <li>T&aelig;lling
                    </li>
                    <li>Middel
                    </li>
                    <li>Min
                    </li>
                    <li>Maks
                    </li>
                    <li>Omr&aring;de
                    </li>
                    <li>Varians
                    </li>
                    <li>Standardafvigelse
                    </li>
                </ul>
                
            </p>
            <p>For strengfelter kan du beregne f&oslash;lgende:
                <ul>
                    <li>T&aelig;lling
                    </li>
                    <li>Vilk&aring;rlig &ndash; Denne statistik er et vilk&aring;rligt eksempel p&aring; en strengv&aelig;rdi i det angivne felt.
                    </li>
                </ul>
                Alle statistiske data beregnes ud fra ikke-nul-v&aelig;rdier. Resultatlaget vil indeholde et nyt felt for hver beregnet statistik. Du kan tilf&oslash;je et vilk&aring;rligt antal statistikker ved at v&aelig;lge attributter og statistikker. 
            </p>
            <p>Ud over disse statistikker beregnes der proportionale statistikker p&aring; alle numeriske felter:
                <ul>
                    <li>Opt&aelig;lling &ndash; Opt&aelig;lling af hvert felt multipliceret med den del af summeringslaget, der ligger inden for polygonerne. 
                    </li>
                    <li>Sum &ndash; Summen af de v&aelig;gtede v&aelig;rdier i hvert felt. Hvor den anvendte v&aelig;gt er den del af summeringslaget, der ligger inden for polygonerne.
                    </li>
                    <li>Middel &ndash; De v&aelig;gtede middelv&aelig;rdier i hvert felt. Hvor den anvendte v&aelig;gt er den del af summeringslaget, der ligger inden for polygonerne.
                    </li>
                    <li>Min &ndash; De minimale v&aelig;gtede v&aelig;rdier i hvert felt. Hvor den anvendte v&aelig;gt er den del af summeringslaget, der ligger inden for polygonerne.
                    </li>
                    <li>Maks &ndash; De maksimale v&aelig;gtede v&aelig;rdier i hvert felt. Hvor den anvendte v&aelig;gt er den del af summeringslaget, der ligger inden for polygonerne.
                    </li>
                    <li>Omr&aring;de &ndash; Forskellen mellem de v&aelig;gtede maksimums- og minimumsv&aelig;rdier.
                    </li>
                </ul>
                
            </p>
            <p>Afh&aelig;ngigt af de objekttyper, du summerer, beregnes det samlede antal punkter i n&aelig;rheden, den samlede linjel&aelig;ngde eller det samlede areal.
            </p>
        </div>
    </div>
    <div id="spatialReference">
        <div><h2>SpatialReference (wkid)</h2></div>
        <hr/>
        <div>
            <p>Dette er en midlertidig parameter til prerelease med henblik p&aring; angivelse af den spatiale reference til behandling. Mange big data-v&aelig;rkt&oslash;jer kr&aelig;ver, at et projiceret koordinatsystem benyttes som spatial reference med henblik p&aring; behandling. V&aelig;rkt&oslash;jet vil som standard benytte inputkoordinatsystemet, men dette vil ikke fungere, hvis et geografisk koordinatsystem benyttes. Angiv WKID, hvis et projiceret koordinatsystem skal indstilles. For eksempel ville  <b>Web Mercator</b> blive angivet som <code>3857</code>.
            </p>
        </div>
    </div>
    <div id="dataStore">
        <div><h2>Vælg Datastore</h2></div>
        <hr/>
        <div>
            <p>Dette er en midlertidig parameter til prerelease med henblik p&aring; angivelse af det datalager, hvor resultaterne bliver gemt. Begge datalagre er en del af  ArcGIS Data Store. Hvis du v&aelig;lger det spatiotemporale datalager, men ikke har et s&aring;dant installeret, vil v&aelig;rkt&oslash;jet ikke fungere. </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Navn på resultatlag</h2></div>
        <hr/>
        <div>
            <p> Dette er navnet p&aring; det lag, som oprettes i <b>Mit indhold</b> og f&oslash;jes til kortet. Standardnavnet er baseret p&aring; navnet p&aring; v&aelig;rkt&oslash;jet og navnet p&aring; inputlaget. Hvis laget allerede findes, vil v&aelig;rkt&oslash;jet ikke fungere.
            </p>
            <p>Ved hj&aelig;lp af rullelisten  <b>Gem resultat i</b> kan du angive navnet p&aring; en mappe i <b>Mit indhold</b>, hvor resultatet skal gemmes.
            </p>
        </div>
    </div>
</div>
</html>
