<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="regularsize">
        <h2>Agreguoti daugiamatį rastrą</h2><p/>
        <h2><img src="../images/GUID-2C2320A3-EC6E-4FFC-B59B-9551BB02C545-web.png" alt="Agreguoti daugiamatį rastrą"></h2>
        <hr/>
    <p>Generuoja daugiamačių rastrinių duomenų rinkinį, apjungdamas esamus daugiamačius rastrinius kintamuosius pagal matmenį.
    </p>
    <p>Jei turite 30 metų jūros pavir&scaron;iaus temperatūros duomenis, kurie buvo renkami kasmet iki 100 metrų gylio kas 5 metrus, galimi tokie įrankio pritaikymo pavyzdžiai:
        <ul>
            <li>Mėnesio temperatūrų duomenų agregavimas į metinius duomenis.
            </li>
            <li>Mėnesio temperatūrų duomenų agregavimas į 4 mėnesių intervalus.
            </li>
            <li>Temperatūros duomenų agregavimas nuo 0 iki 25 metrų, tada nuo 25 iki 50 metrų, tada nuo 50 iki 100 metrų.
            </li>
        </ul>
        
    </p>
    <p>Jei pažymėta  <b>Naudoti esamą žemėlapio aprėptį</b>, bus analizuojami tik esamoje žemėlapio aprėptyje matomi kintamieji. Jei nepažymėta, bus analizuojami viso žemėlapio kintamieji, net jei jie nepatenka į esamą žemėlapio aprėptį.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputMultidimensionalRaster">
        <div><h2>Pasirinkti daugiamatį vaizdų sluoksnį, kuris bus agreguojamas</h2></div>
        <hr/>
        <div>
            <p>Daugiamačio rastro įvesties vaizdų sluoksnis, kuris bus agreguojamas.
            </p>
        </div>
    </div>
    <div id="dimension">
        <div><h2>Pasirinkti, pagal kurį matmenį agreguoti</h2></div>
        <hr/>
        <div>
            <p>Agregavimo matmuo. Tai yra matmuo, pagal kurį kintamieji bus agreguojami.
            </p>
        </div>
    </div>
    <div id="variables">
        <div><h2>Pasirinkti kintamąjį (kintamuosius), kuris (kurie) bus agreguojamas (agreguojami)</h2></div>
        <hr/>
        <div>
            <p>Kintamasis arba kintamieji, kuris (kurie) bus agreguojamas (agreguojami) pagal nurodytą matmenį. Jei kintamasis nenurodytas, bus agreguojami visi pasirinktą matmenį turintys kintamieji.
            </p>
            <p>Pavyzdžiui, jei norite agreguoti kasdienius temperatūros duomenis į vidutines mėnesio reik&scaron;mes, kaip agreguojamą kintamąjį nurodykite temperatūrą. Jei nenurodysite jokių kintamųjų, o turite ir kasdienius temperatūros, ir kasdienius kritulių kintamuosius, jie abu bus agreguojami į mėnesio vidurkius, ir i&scaron;vesties daugiamačiame rastre bus abu kintamieji.
            </p>
        </div>
    </div>
    <div id="aggregationMethod">
        <div><h2>Pasirinkti agregavimo būdą</h2></div>
        <hr/>
        <div>
            <p>Nurodo matematinį metodą, kuris bus naudojamas agreguotų skilčių jungimui į intervalą.
                <ul>
                    <li> <b>Vidurkis</b> &ndash; skaičiuoja pikselio reik&scaron;mių visose intervalo skiltyse vidurkį. Tai yra numatytasis nustatymas.
                    </li>
                    <li> <b>Maksimumas</b> &ndash; skaičiuoja maksimalią pikselio reik&scaron;mę visose intervalo skiltyse.
                    </li>
                    <li> <b>Dauguma</b> &ndash; skaičiuoja dažniausiai pasitaikančią pikselio reik&scaron;mę visose intervalo skiltyse.
                    </li>
                    <li> <b>Minimumas</b> &ndash; skaičiuoja mažiausią pikselio reik&scaron;mę visose intervalo skiltyse.
                    </li>
                    <li> <b>Mažuma</b> &ndash; skaičiuoja rečiausiai pasitaikančią pikselio reik&scaron;mę visose intervalo skiltyse.
                    </li>
                    <li> <b>Mediana</b> &ndash; skaičiuoja pikselio medianos reik&scaron;mę visose intervalo skiltyse.
                    </li>
                    <li> <b>Procentinė dalis</b> &ndash; per visus intervalo rėžius bus skaičiuojama pikselio reik&scaron;mių procentinė reik&scaron;mė. Pagal numatytuosius nustatymus skaičiuojama 90-oji procentinė dalis. Naudodami parametrą <b>Procentinė reik&scaron;mė</b> galite nurodyti kitokias reik&scaron;mes (nuo 0 iki 100).
                    </li>
                    <li> <b>Intervalas</b> &ndash; skaičiuoja pikselio reik&scaron;mių intervalą visose intervalo skiltyse.
                    </li>
                    <li> <b>Standartinis nuokrypis</b> &ndash; skaičiuoja pikselio reik&scaron;mių visose intervalo skiltyse standartinį nuokrypį.
                    </li>
                    <li> <b>Suma</b> &ndash; skaičiuoja pikselio reik&scaron;mių visose intervalo skiltyse sumą.
                    </li>
                    <li> <b>Įvairovė</b> &ndash; skaičiuoja pikselio unikalių reik&scaron;mių visose intervalo skiltyse skaičių.
                    </li>
                    <li> <b>Adaptuota</b> &ndash; skaičiuoja pikselio reik&scaron;mę pagal adaptuotą rastro funkciją.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="aggregationFunction">
        <div><h2>Pasirinkti rastrų funkcijos šabloną</h2></div>
        <hr/>
        <div>
            <p>Adaptuota rastrų funkcija, kuris bus naudojama skaičiuojant agreguotų rastrų pikselių reik&scaron;mes. Įvestis yra portale esantis rastrų funkcijos &scaron;ablonas. &Scaron;ios įvesties reikia, jei  <b>Agregavimo metodas</b> nustatytas kaip <b>Adaptuotas</b>.
            </p>
        </div>
    </div>
    <div id="aggregationDefinition">
        <div><h2>Pasirinkti agregavimo aprašą</h2></div>
        <hr/>
        <div>
            <p>Nurodo matmens intervalą, kuriame esantys duomenys bus agreguojami
                <ul>
                    <li> <b>Viskas</b> &ndash; bus agreguojamos visų skilčių duomenų reik&scaron;mės. Tai yra numatytasis nustatymas.
                    </li>
                    <li> <b>Intervalo raktažodis</b> &ndash; kintamojo duomenys bus agreguojami naudojant vieną i&scaron; įprastinių intervalų.
                    </li>
                    <li> <b>Intervalo reik&scaron;mės</b> &ndash; kintamojo duomenys bus agreguojami naudojant naudotojo nurodytą intervalą ir matavimo vienetus.
                    </li>
                    <li> <b>Intervalų diapazonai</b> &ndash; kintamojo duomenys bus agreguojami, jei patenka tarp nurodytų reik&scaron;mių arba datų porų.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="intervalKeyword">
        <div><h2>Pasirinkti raktažodžio intervalą</h2></div>
        <hr/>
        <div>
            <p>Nurodo raktažodžio intervalą, kurį naudojant bus agreguojama pagal matmenį. &Scaron;ios įvesties reikia, jei  <b>Agregavimo apra&scaron;as</b> nustatytas kaip <b>Intervalo raktažodis</b>, o agregavimas vykdomas pagal laiką.
                <ul>
                    <li> <b>Valandos</b> &ndash; duomenų reik&scaron;mės bus agreguojamos į valandinius laiko etapus, o rezultatuose bus pateikiama kiekviena laiko sekos valanda.
                    </li>
                    <li> <b>Dienos</b> &ndash; duomenų reik&scaron;mės bus agreguojamos į dieninius laiko etapus, o rezultatuose bus pateikiama kiekviena laiko sekos diena.
                    </li>
                    <li> <b>Savaitės</b> &ndash; duomenų reik&scaron;mės bus agreguojamos į savaitinius laiko etapus, o rezultatuose bus pateikiama kiekviena laiko sekos savaite.
                    </li>
                    <li> <b>Mėnesio</b> &ndash; duomenų reik&scaron;mės bus agreguojamos į mėnesinius laiko etapus, o rezultatuose bus pateikiamas kiekvienu laiko sekos mėnesiu.
                    </li>
                    <li> <b>Ketvirčio</b> &ndash; duomenų reik&scaron;mės bus agreguojamos į ketvirčio trukmės laiko etapus, o rezultatuose bus pateikiamas kiekvienu laiko sekos ketvirčiu.
                    </li>
                    <li> <b>Metų</b> &ndash; duomenų reik&scaron;mės bus agreguojamos į metinius laiko etapus, o rezultatuose bus pateikiama kiekvieni laiko sekos metai.
                    </li>
                    <li> <b>Kasdien</b> &ndash; duomenų reik&scaron;mės bus agreguojamos į dieninius laiko etapus, o rezultatuose bus pateikiama viena agreguota reik&scaron;mė kiekvienai kalendorinei dienai. Tokia i&scaron;vestis turės ne daugiau nei 366 dienines laiko skiltis.
                    </li>
                    <li> <b>Kas savaitę</b> &ndash; duomenų reik&scaron;mės bus agreguojamos į savaitinius laiko etapus, o rezultatuose bus pateikiama viena agreguota reik&scaron;mė kiekvienai savaitei. Tokia i&scaron;vestis turės ne daugiau nei 53 savaitines laiko skiltis.
                    </li>
                    <li> <b>Kas mėnesį</b> &ndash; duomenų reik&scaron;mės bus agreguojamos į savaitinius laiko etapus, o rezultatuose bus pateikiama viena agreguota reik&scaron;mė kiekvienam kalendoriniam mėnesiui. Tokia i&scaron;vestis turės ne daugiau nei 12 mėnesio trukmės laiko skilčių.
                    </li>
                    <li> <b>Kas ketvirtį</b> &ndash; duomenų reik&scaron;mės bus agreguojamos į savaitinius laiko etapus, o rezultatuose bus pateikiama viena agreguota reik&scaron;mė kiekvienam metų ketvirčiui. Tokia i&scaron;vestis turės ne daugiau nei 4 ketvirčių laiko skiltis.
                    </li>
                    <li> <b>Kas dekadą</b> &ndash; duomenų reik&scaron;mės bus agreguojamos į 3 laikotarpius po 10 dienų. Paskutinis laikotarpis gali būti ilgesnis arba trumpesnis nei 10 dienų. I&scaron;vestyje kiekvienam mėnesiui bus 3 skiltys.
                    </li>
                    <li> <b>Kas penkias dienas</b> &ndash; duomenų reik&scaron;mės bus agreguojamos į 6 laikotarpius po 5 dienas. Paskutinis laikotarpis gali būti ilgesnis arba trumpesnis nei 5 dienų. I&scaron;vestyje kiekvienam mėnesiui bus 6 skiltys.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="intervalValue">
        <div><h2>Reikšmių intervalas</h2></div>
        <hr/>
        <div>
            <p>Intervalo, kuris bus naudojamas agregavimui, dydis. &Scaron;io parametro reikia, jei parametras  <b>Agregavimo apra&scaron;as</b> nustatytas kaip <b>Intervalo reik&scaron;mė</b>.
            </p>
            <p>Pavyzdžiui, norėdami agreguoti 30 metų mėnesio temperatūrų duomenis į 5 metų atkarpas, įveskite 5 kaip  <b>Reik&scaron;mių intervalą</b>, o <b>Vienetus</b> nurodykite kaip <b>Metai</b>.
            </p>
        </div>
    </div>
    <div id="intervalUnit">
        <div><h2>Matavimo vienetai</h2></div>
        <hr/>
        <div>
            <p>Intervalo reik&scaron;mei naudojami matavimo vienetai. &Scaron;i įvestis reikalinga, jei  <b>Matmuo</b> yra laiko laukas, o <b>Agregavimo apra&scaron;as</b> nustatytas kaip <b>Intervalo reik&scaron;mė</b>.
            </p>
            <p>Jei agreguojate pagal kitą kintamąjį nei laikas, &scaron;i parinktis nebus galima, o intervalo reik&scaron;mės matavimo vienetai bus tokie patys, kaip įvesties daugiamačių rastrinių duomenų kintamojo matavimo vienetai.
                <ul>
                    <li> <b>Valandos</b> &ndash; nurodytame intervale duomenų reik&scaron;mės bus agreguojamos į valandos trukmės laiko skiltis.
                    </li>
                    <li> <b>Dienos</b> &ndash; nurodytame intervale duomenų reik&scaron;mės bus agreguojamos į dienos trukmės laiko skiltis.
                    </li>
                    <li> <b>Savaitės</b> &ndash; nurodytame intervale duomenų reik&scaron;mės bus agreguojamos į savaitines laiko skiltis.
                    </li>
                    <li> <b>Mėnesiai</b> &ndash; nurodytame intervale duomenų reik&scaron;mės bus agreguojamos į mėnesio trukmės laiko skiltis.
                    </li>
                    <li> <b>Metai</b> &ndash; nurodytame intervale duomenų reik&scaron;mės bus agreguojamos į metų trukmės laiko skiltis.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="intervalRanges">
        <div><h2>Apibrėžti intervalus</h2></div>
        <hr/>
        <div>
            <p>Reik&scaron;mių grupėms agreguoti bus naudojami intervalai. Juos sudaro minimalios ir maksimalios intervalo reik&scaron;mių poros, kurių duomenų tipas yra Dvigubo tikslumo arba Data. &Scaron;ios įvesties reikia, jei  <b>Agregavimo apra&scaron;as</b> nustatyta kaip <b>Intervalai</b>.
            </p>
        </div>
    </div>
    <div id="ignoreNodata">
        <div><h2>Nepaisyti trūkstamų reikšmių skaičiuojant</h2></div>
        <hr/>
        <div>
            <p>Nurodo, ar analizuojant ignoruojamos trūkstamos reik&scaron;mės.
                <ul>
                    <li>Pažymėta &ndash; analizėje bus įtraukti visi nurodyto matmens tinkami pikseliai ir neįtraukti visi NoData pikseliai. Tai yra numatytasis nustatymas.
                    </li>
                    <li>Nepažymėta &ndash; analizė pateiks rezultatą NoData, jei nurodytame matmenyje pikselis turi bent vieną NoData reik&scaron;mę.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Rezultatų sluoksnio pavadinimas</h2></div>
        <hr/>
        <div>
            
            <p>Sluoksnio, kuris bus sukurtas puslapyje  <b>Turinys</b> ir įtrauktas į žemėlapį, pavadinimas. Numatytasis pavadinimas sukuriamas naudojant įrankio ir įvesties sluoksnio pavadinimus. Jei toks sluoksnis jau egzistuoja, būsite papra&scaron;yti pateikti kitą pavadinimą.
            </p>
            <p>Galite nurodyti aplanko  <b>Turinyje</b>, kuriame rezultatai bus įra&scaron;yti naudojant i&scaron;&scaron;okantįjį meniu <b>Rezultatą įra&scaron;yti į</b>, pavadinimą. Jei turite teises kurti išklotinių ir dinaminių vaizdų sluoksnius, naudodami išskleidžiamąjį laukelį Įrašyti rezultatą kaip galite nurodyti, kokį sluoksnio tipą generuoti išvestyje. </p>
        </div>
    </div>
    <div id="percentileValue">
        <div><h2>Procentilinė reikšmė</h2></div>
        <hr/>
        <div>
            <p>Apskaičiuotina procentinė dalis. Numatytoji reik&scaron;mė yra 90, nurodanti 90-ąją procentinę dalį.
            </p>
            <p>Tinkami reik&scaron;mių intervalai yra nuo 0 iki 100. 0-inė procentinė dalis i&scaron; esmės atitinka Minimumo statistiką, o 100 procentų ekvivalentas yra Maksimumas. 50 lygi reik&scaron;mė i&scaron; esmės pateiks analogi&scaron;kus rezultatus kaip ir Medianos statistika.
            </p>
        </div>
    </div>
    <div id="percentileInterpolationType">
        <div><h2>Procentinės interpoliacijos tipas</h2></div>
        <hr/>
        <div>
            <p>Nurodo, koks procentinės interpoliacijos metodas bus naudojamas, kai skaičiuotinų įvesties rastro reik&scaron;mių skaičius yra lyginis.
            </p>
        </div>
    </div>
</div>
</html>
