<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="regularsize">
        <h2>Sumuoti rastrą viduje</h2><p/>
        <h2><img src="../images/GUID-D61C156C-2B2C-488C-BF28-B6CB9277BF4B-web.png" alt="Įrankis Sumuoti rastrą viduje"></h2>
        <hr/>
    <p>&Scaron;is įrankis apibendrina rastro, esančio kito duomenų rinkinio zonose, reik&scaron;mes.
    </p>
    <p>Įrankio taikymo pavyzdžiai:
        <ul>
            <li>Suskaičiuoti kiekvienos žemėnaudos dalį procentais upės baseine.
                

            </li>
            <li>Turint sklypų ir savivaldybių sluoksnius apskaičiuoti neužstatytų sklypų kiekvienos savivaldybės ribose skaičių.
                

            </li>
        </ul>
        
    </p>
    <p>Jei  <b>Naudoti esamą žemėlapio aprėptį</b> pažymėta, bus analizuojami tik į esamo žemėlapio aprėptį patenkantys įvesties ir sumuojamo sluoksnių elementai. Jei nepažymėta, bus analizuojami visi abiejų sluoksnių (įvesties sluoksnio ir sumuojamo sluoksnio) elementai, net jei jie nepatenka į esamo žemėlapio aprėpties ribas.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="sumWithinLayer">
        <div><h2>Pasirinkite plotų sluoksnį, kurio apibrėžtose ribose sumuoti rastro sluoksnį</h2></div>
        <hr/>
        <div>
            <p>Sumuojamų zonų arba plotų ribas apibrėžianti įvestis.
            </p>
            <p>Įvestį gali sudaryti sveikieji rastriniai arba elementų duomenys. Rastro atveju zonas apibrėžia visos įvesties vietos, turinčios tą pačią gardelės reik&scaron;mę. Elementų atžvilgiu zonos gali sutapti. Plotai neprivalo susisiekti.
            </p>
        </div>
    </div>
    <div id="zoneField">
        <div><h2>Pasirinkite lauką, kad apibrėžtumėte ribas</h2></div>
        <hr/>
        <div>
            <p>Laukas, kuriame yra kiekvieną zoną apra&scaron;ančios reik&scaron;mės.
            </p>
            <p>Tai gali būti sveikasis skaičius arba tekstinis zonos duomenų rinkinio laukas.
            </p>
        </div>
    </div>
    <div id="sumRasterLayer">
        <div><h2>Pasirinkite rastro sluoksnį sumavimui</h2></div>
        <hr/>
        <div>
            <p>Rastras, kuriame yra reik&scaron;mės, pagal kurias skaičiuojama statistika.
            </p>
            <p>Jis gali būti sveikojo skaičiaus arba skaičiaus su slankiuoju kableliu tipo. Tačiau kai jis yra skaičiaus arba skaičiaus su slankiuoju kableliu tipo, daugumos, mažumos ir įvairovės skaičiavimo parinktys nėra pasiekiamos.
            </p>
        </div>
    </div>
    <div id="sumStatistic">
        <div><h2>Pasirinkite norimą skaičiuoti statistiką</h2></div>
        <hr/>
        <div>
            <p>Nurodo skaičiuotiną statistikos tipą.
            </p>
            <p> Įvestis gali būti viena i&scaron; &scaron;ių: <b>Vidurkis</b>, <b>Dauguma</b>, <b>Maksimumas</b>, <b>Mediana</b>, <b>Minimumas</b>, <b>Mažuma</b>, <b>Procentinė dalis</b>, <b>Intervalas</b>, <b>Standartinis nuokrypis</b>, <b>Suma</b> arba <b>Įvairovė</b>. Numatytoji reik&scaron;mė yra <b>Vidurkis</b>.
            </p>
        </div>
    </div>
    <div id="percentileValue">
        <div><h2>Procentilinė reikšmė</h2></div>
        <hr/>
        <div>
            <p>Apskaičiuotina procentinė dalis. Numatytoji reik&scaron;mė yra 90, nurodanti 90-ąją procentinę dalį.
            </p>
            <p>Tinkamas reik&scaron;mės intervalas yra nuo 0 iki 100. Rezultatas, nurodant 0-inę procentinę dalį, i&scaron; esmės atitinka minimumo statistiką, o 100 procentų ekvivalentas yra maksimumas. 50 lygi reik&scaron;mė i&scaron; esmės pateiks analogi&scaron;kus rezultatus kaip ir Medianos statistika.
            </p>
            <p> &Scaron;is parametras palaikomas tik tuo atveju, jei parametras <b>Pasirinkite norimą skaičiuoti statistiką</b> nustatytas kaip <b>Procentinė dalis</b>.
            </p>
        </div>
    </div>
    <div id="missingValues">
        <div><h2>Nepaisyti trūkstamų reikšmių skaičiuojant</h2></div>
        <hr/>
        <div>
            <p> Nurodo, ar analizuojant ignoruojamos trūkstamos reik&scaron;mės.
            </p>
            <ul>
                <li>Pažymėta &ndash; Į analizę įtraukiamos gardelės, kurių įvesties reik&scaron;mės rastro reik&scaron;mė yra bet kurioje konkrečioje zonoje, kad būtų galima nustatyti tos zonos i&scaron;vesties reik&scaron;mę. NoData gardelės reik&scaron;mės rastre atliekant statistinius skaičiavimus nebus paisomos. Tai yra numatytasis nustatymas.
                </li>
                <li>Nepažymėta &ndash; Analizės rezultatas bus NoData, jei tam tikroje zonoje reik&scaron;mių rastro gardelės turi NoData reik&scaron;mių.
                </li>
            </ul>
            
        </div>
    </div>
    <div id="processAsMultidimensional">
        <div><h2>Apdoroti kaip daugiamatį</h2></div>
        <hr/>
        <div>
            <p>Nurodo, kaip bus apdorojami įvesties daugiamatės vaizdų paslaugos, jei jos yra daugiamatės.
            </p>
            <ul>
                <li>Pažymėta &ndash; Statistika bus apskaičiuojama naudojant įvesties daugiamačio duomenų rinkinio dabartinę skiltį. Tai yra numatytasis nustatymas.
                    

                </li>
                <li>Nepažymėta &ndash; Bus apskaičiuojama visų įvesties daugiamačio duomenų rinkinio matmenų statistika.
                </li>
            </ul>
            
        </div>
    </div>
    <div id="resultLayer">
        <div><h2>Rezultatų sluoksnio pavadinimas</h2></div>
        <hr/>
        <div>
            
            <p>Sluoksnio, kuris bus sukurtas puslapyje  <b>Turinys</b> ir įtrauktas į žemėlapį, pavadinimas. Numatytasis pavadinimas sukuriamas naudojant įrankio ir įvesties sluoksnio pavadinimus. Jei toks sluoksnis jau egzistuoja, būsite papra&scaron;yti pateikti kitą pavadinimą.
            </p>
            <p>Galite nurodyti aplanko  <b>Turinyje</b>, kuriame rezultatai bus įra&scaron;yti naudojant i&scaron;&scaron;okantįjį meniu <b>Rezultatą įra&scaron;yti į</b>, pavadinimą. Jei turite teises kurti išklotinių ir dinaminių vaizdų sluoksnius, naudodami išskleidžiamąjį laukelį Įrašyti rezultatą kaip galite nurodyti, kokį sluoksnio tipą generuoti išvestyje. </p>
        </div>
    </div>
</div>
</html>
