<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="regularsize">
        <h2>Sumuoti rastrą viduje</h2><p/>
        <h2><img src="../images/GUID-D61C156C-2B2C-488C-BF28-B6CB9277BF4B-web.png" alt="Įrankis Sumuoti rastrą viduje"></h2>
        <hr/>
    <p>&Scaron;is įrankis apibendrina rastro, esančio kito duomenų rinkinio zonose, reik&scaron;mes.
    </p>
    <p>Taikymo pavyzdžiai:
    </p>
    <p>
        <ul>
            <li>Suskaičiuoti kiekvienos žemėnaudos dalį procentais upės baseine.
                

            </li>
            <li>Turint sklypų ir savivaldybių sluoksnius apskaičiuoti neužstatytų sklypų kiekvienos savivaldybės ribose skaičių.
                

            </li>
        </ul>
        
    </p>
    <p>Jei  <b>Naudoti esamą žemėlapio aprėptį</b> pažymėta, bus analizuojami tik į esamo žemėlapio aprėptį patenkantys įvesties ir sumuojamo sluoksnių elementai. Jei nepažymėta, bus analizuojami visi abiejų sluoksnių (įvesties sluoksnio ir sumuojamo sluoksnio) elementai, net jei jie nepatenka į esamo žemėlapio aprėpties ribas.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="sumWithinLayer">
        <div><h2>Pasirinkite plotų sluoksnį, kurio apibrėžtose ribose sumuoti rastro sluoksnį</h2></div>
        <hr/>
        <div>
            <p>Sumuojamų plotų arba zonų ribas apibrėžiantis sluoksnis.
            </p>
            <p>Sluoksnį gali sudaryti rastriniai arba elementų duomenys. Rastro atveju zonas apibrėžia visos įvesties vietos, turinčios tą pačią gardelės reik&scaron;mę. Plotai neprivalo susisiekti.
            </p>
        </div>
    </div>
    <div id="zoneField">
        <div><h2>Pasirinkite lauką, kad apibrėžtumėte ribas</h2></div>
        <hr/>
        <div>
            <p>&Scaron;is sluoksnio atributas naudojamas plotų riboms apibrėžti.
            </p>
            <p>Pavyzdžiui, pirmasis įvesčių sluoksnis apibrėžia valdomų vienetų ribas, su atributais, nurodančiais regioną, rajoną ir kiekvieno vieneto sklypo ID. Taip pat turite rastrų sluoksnį, apibrėžiantį kiekvienos vietos biologinės įvairovės rodiklį. Galite pasirinktame lauke apskaičiuoti vidutinę biologinę įvairovę vietiniu, rajono arba regioniniu lygmeniu.
            </p>
        </div>
    </div>
    <div id="sumRasterLayer">
        <div><h2>Pasirinkite rastro sluoksnį sumavimui</h2></div>
        <hr/>
        <div>
            <p>&Scaron;io sluoksnio rastro gardelės bus sumuojamos pagal plotus (zonas), kurios yra viduje.
            </p>
        </div>
    </div>
    <div id="sumStatistic">
        <div><h2>Pasirinkite norimą skaičiuoti statistiką</h2></div>
        <hr/>
        <div>
            <p>Pasirinkę sumuojamą sluoksnį, taip pat galite apskaičiuoti bet kurių ta&scaron;kų, linijų ar plotų įvesties ploto sluoksnyje skaitinių atributų statistinius rodiklius.
            </p>
            <p>Kai pasirinktas laukas yra sveikasis skaičius, galima apskaičiuoti &scaron;iuos statistinius duomenis: vidurkį, daugumą, maksimumą, medianą, minimumą, mažumą, procentinę dalį, imtį, standartinį nuokrypį, sumą ir dispersiją.
            </p>
            <p>Jeigu lauką sudaro slankiojo kablelio skaičius, galima apskaičiuoti vidurkį, maksimumą, minimumą, diapazoną, standartinį nuokrypį ir sumą.
            </p>
        </div>
    </div>
    <div id="percentileValue">
        <div><h2>Procentilinė reikšmė</h2></div>
        <hr/>
        <div>
            <p>Apskaičiuotina procentinė dalis. Numatytoji reik&scaron;mė yra 90, nurodanti 90-ąją procentinę dalį.
            </p>
            <p>Tinkami reik&scaron;mių intervalai yra nuo 0 iki 100. 0-inė procentinė dalis i&scaron; esmės atitinka Minimumo statistiką, o 100 procentų ekvivalentas yra Maksimumas. 50 lygi reik&scaron;mė i&scaron; esmės pateiks analogi&scaron;kus rezultatus kaip ir Medianos statistika.
            </p>
            <p>&Scaron;i parinktis palaikoma tik tuo atveju, jei parametras  <b>Pasirinkite norimą skaičiuoti statistiką</b> nustatytas kaip <b>Procentinė dalis</b>.
            </p>
        </div>
    </div>
    <div id="missingValues">
        <div><h2>Nepaisyti trūkstamų reikšmių skaičiuojant</h2></div>
        <hr/>
        <div>
            <p>Pasirinkus nepaisyti trūkstamų reik&scaron;mių, ploto i&scaron;vesties reik&scaron;mei apskaičiuoti bus naudojamos tik sumuojamo sluoksnio reik&scaron;mę turinčios gardelės. Prie&scaron;ingu atveju, jeigu plote yra trūkstamų reik&scaron;mių, laikoma, kad nepakanka informacijos visų zonos gardelių statistiniams skaičiavimams atlikti ir i&scaron;vestyje plotui priskiriama nulinė (NoData) reik&scaron;mė.
            </p>
        </div>
    </div>
    <div id="processAsMultidimensional">
        <div><h2>Apdoroti kaip daugiamatį</h2></div>
        <hr/>
        <div>
            <p>Nurodo, kaip bus apdorojami įvesties rastrai, jei jie yra daugiamačiai. Jei duomenis pasirinksite apdoroti kaip daugiamačius, statistika bus apskaičiuojama naudojat visus įvesties daugiamačio duomenų rinkinio matmenis. Prie&scaron;ingu atveju statistika bus apskaičiuojama naudojant įvesties daugiamačio duomenų rinkinio dabartinę skiltį. Tai yra numatytasis nustatymas.
            </p>
        </div>
    </div>
    <div id="resultLayer">
        <div><h2>Rezultatų sluoksnio pavadinimas</h2></div>
        <hr/>
        <div>
            
            <p>Sluoksnio, kuris bus sukurtas puslapyje  <b>Turinys</b> ir įtrauktas į žemėlapį, pavadinimas. Numatytasis pavadinimas sukuriamas naudojant įrankio ir įvesties sluoksnio pavadinimus. Jei toks sluoksnis jau egzistuoja, būsite papra&scaron;yti pateikti kitą pavadinimą.
            </p>
            <p>Galite nurodyti aplanko  <b>Turinyje</b>, kuriame rezultatai bus įra&scaron;yti naudojant i&scaron;&scaron;okantįjį meniu <b>Rezultatą įra&scaron;yti į</b>, pavadinimą.
            </p>
        </div>
    </div>
</div>
</html>
