<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="smallsize">
        <h2>Baseinas</h2><p/>
        <h2><img src="../images/GUID-AF749369-8C2D-46FF-9D74-2CF7CAB7C7B0-web.png" alt="Baseino užduotis"></h2>
        <hr/>
    <p>&Scaron;is įrankis nustato priklausantį plotą vir&scaron; gardelių rinkinio rastre.
    </p>
    <p> Įvesties ta&scaron;kas, pažymėtas vir&scaron; Misisipės upės Luizianoje, sukurs baseino funkciją, apimančią teritorijas nuo Niujorko iki Montanos ir Kanados.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputFlowDirectionRaster">
        <div><h2>Pasirinkite tėkmės krypties sluoksnį</h2></div>
        <hr/>
        <div>
            <p>Įvesties rastras, rodantis tėkmės i&scaron; kiekvienos gardelės kryptį.
            </p>
            <p>Srauto krypties rastrą galima sukurti naudojant srauto krypties rastro funkciją ir numatytąjį srauto krypties tipą  <b>D8</b>.
            </p>
        </div>
    </div>
    <div id="inPourPointRasterOrFeatures">
        <div><h2>Nurodykite įvesties nutekėjimo taškų padėtis</h2></div>
        <hr/>
        <div>
            <p>Įvesties nutekėjimo ta&scaron;kų padėtys.
            </p>
            <p>Tai gali būti rastras arba ta&scaron;kinis elementas. Rastre tai yra gardelės, vir&scaron; kurių esantis plotas, arba upių baseinas, bus nustatomas. Kaip &scaron;altinio gardelės bus naudojamos visos, i&scaron;skyrus gardeles be duomenų. Ta&scaron;ko įvesčiai tai yra padėtys, vir&scaron; kurių esantis plotas, arba upių baseinas, bus nustatomas.
            </p>
        </div>
    </div>
    <div id="pourPointField">
        <div><h2>Pasirinkite nutekėjimo taško lauką</h2></div>
        <hr/>
        <div>
            <p>Laukas, naudojamas priskirti reik&scaron;mes nutekėjimo ta&scaron;ko padėtims.
            </p>
            <p>Jei įvesties nutekėjimo ta&scaron;ko sluoksnis yra rastras, naudojama  <i>Value</i>. Jei elementas &ndash; naudojamas skaitinis laukas. Jei lauke yra slankiojo kablelio reik&scaron;mių, jos supaprastinamos iki sveikųjų skaičių.
            </p>
        </div>
    </div>
    <div id="resultLayer">
        <div><h2>Rezultatų sluoksnio pavadinimas</h2></div>
        <hr/>
        <div>
            
            <p>Sluoksnio, kuris bus sukurtas puslapyje  <b>Turinys</b> ir įtrauktas į žemėlapį, pavadinimas. Numatytasis pavadinimas sukuriamas naudojant įrankio ir įvesties sluoksnio pavadinimus. Jei toks sluoksnis jau egzistuoja, būsite papra&scaron;yti pateikti kitą pavadinimą.
            </p>
            <p>Galite nurodyti aplanko  <b>Turinyje</b>, kuriame rezultatai bus įra&scaron;yti naudojant i&scaron;&scaron;okantįjį meniu <b>Rezultatą įra&scaron;yti į</b>, pavadinimą. Jei turite teises kurti išklotinių ir dinaminių vaizdų sluoksnius, naudodami išskleidžiamąjį laukelį Įrašyti rezultatą kaip galite nurodyti, kokį sluoksnio tipą generuoti išvestyje. </p>
        </div>
    </div>
</div>
</html>
