<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="smallsize">
        <h2>Förutsäg med trendraster</h2><p/>
        <h2><img src="../images/GUID-E3758820-51A9-46DE-AAF6-E27B68DE4012-web.png" alt="F&ouml;ruts&auml;g med trendraster"></h2>
        <hr/>
    <p>Computes a forecasted multidimensional raster using the output trend raster from the  Generate Trend Raster tool.
    </p>
    <p>Om  <b>Anv&auml;nd aktuell kartutbredning</b> &auml;r markerat analyseras variabler f&ouml;r de lager som &auml;r synliga i den aktuella kartutbredningen. Om alternativet inte markeras analyseras variablerna i hela lagret, &auml;ven om de ligger utanf&ouml;r den aktuella kartutbredningen.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputMultidimensionalRaster">
        <div><h2>Välj flerdimensionellt bildlager att förutsäga</h2></div>
        <hr/>
        <div>
            <p>Det flerdimensionella indatatrendrastret fr&aring;n verktyget  Generera trendraster.
            </p>
        </div>
    </div>
    <div id="variables">
        <div><h2>Välj variabel/variabler som ska förutsägas</h2></div>
        <hr/>
        <div>
            <p>Variabel/variabler som ska f&ouml;ruts&auml;gas i analysen. Om inga variabler anges anv&auml;nds alla variabler.
            </p>
        </div>
    </div>
    <div id="dimensionDefinition">
        <div><h2>Välj metod för att tillhandahålla dimensionsvärden för förutsägelser</h2></div>
        <hr/>
        <div>
            <p>Anger metod f&ouml;r att tillhandah&aring;lla dimensionsv&auml;rden f&ouml;r f&ouml;ruts&auml;gelser.
                <ul>
                    <li> <b>Efter v&auml;rde</b> &ndash; F&ouml;ruts&auml;gelsen kommer att ber&auml;knas f&ouml;r ett enda dimensionsv&auml;rde eller en lista &ouml;ver dimensionsv&auml;rden som anges i n&auml;sta steg. Det h&auml;r &auml;r standardinst&auml;llningen. Du kanske till exempel vill f&ouml;ruts&auml;ga &aring;rsnederb&ouml;rden f&ouml;r &aring;r 2050, 2100 och 2150.
                    </li>
                    <li> <b>Efter intervall</b> &ndash; F&ouml;ruts&auml;gelsen kommer att ber&auml;knas f&ouml;r ett intervall av dimensionen definierad av ett start- och slutv&auml;rde. Du kanske till exempel vill f&ouml;ruts&auml;ga &aring;rsnederb&ouml;rden f&ouml;r varje &aring;r mellan 2050 och 2150.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="dimensionValues">
        <div><h2>Ange dimensionsvärde(n) för förutsägelse</h2></div>
        <hr/>
        <div>
            <p>Dimensionsv&auml;rdet eller -v&auml;rdena som ska anv&auml;ndas i f&ouml;ruts&auml;gelsen.
            </p>
            <p>Formatet f&ouml;r tid, djup och h&ouml;jdv&auml;rden m&aring;ste matcha formatet p&aring; de dimensionsv&auml;rden som anv&auml;nts f&ouml;r att generera trendrastret. Om trendrastret genererades f&ouml;r StdTime-dimensionen, b&ouml;r formatet vara YYYY-MM-DDTHH:MM:SS, till exempel 2050-01-01T00:00:00. Flera v&auml;rden separeras av ett semikolon.
            </p>
            <p>Den h&auml;r parametern kr&auml;vs n&auml;r metoden  <b>Efter v&auml;rde</b> har valts f&ouml;r att definiera dimensionsv&auml;rden f&ouml;r f&ouml;ruts&auml;gelse.
            </p>
        </div>
    </div>
    <div id="start">
        <div><h2>Start</h2></div>
        <hr/>
        <div>
            <p>Dimensionsintervall f&ouml;r startdatum, h&ouml;jd eller djup som ska anv&auml;ndas i f&ouml;ruts&auml;gelsen.
            </p>
        </div>
    </div>
    <div id="end">
        <div><h2>Stopp</h2></div>
        <hr/>
        <div>
            <p>Dimensionsintervall f&ouml;r slutdatum, h&ouml;jd eller djup som ska anv&auml;ndas i f&ouml;ruts&auml;gelsen.
            </p>
        </div>
    </div>
    <div id="dimensionInterval">
        <div><h2>Definiera dimensionsintervallet för förutsägelse</h2></div>
        <hr/>
        <div>
            <p>Definiera start- och slutdatum, h&ouml;jd eller djup f&ouml;r dimensionsintervallet som ska anv&auml;ndas i f&ouml;ruts&auml;gelsen.
            </p>
        </div>
    </div>
    <div id="intervalValue">
        <div><h2>Ange antalet steg mellan start- och slutvärdena</h2></div>
        <hr/>
        <div>
            <p>Antal steg mellan tv&aring; dimensionsv&auml;rden som ska inkluderas i f&ouml;ruts&auml;gelsen. Standardv&auml;rdet &auml;r 1.
            </p>
            <p>Om du till exempel vill f&ouml;ruts&auml;ga temperaturv&auml;rden vart femte &aring;r anv&auml;nder du v&auml;rdet 5.
            </p>
        </div>
    </div>
    <div id="intervalUnit">
        <div><h2>Välj den enhet som ska användas för tidsvärdesintervallet</h2></div>
        <hr/>
        <div>
            <p>Anger den enhet som ska anv&auml;ndas f&ouml;r v&auml;rdeintervallet. Detta g&auml;ller endast n&auml;r analysdimensionen &auml;r en tidsdimension.
            </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Resultatlagrets namn</h2></div>
        <hr/>
        <div>
            
            <p>Namnet p&aring; lagret som skapas i  <b>Mitt inneh&aring;ll</b> och l&auml;ggs till i kartan. Standardnamnet baseras p&aring; verktygets namn och indatalagrets namn. Om lagret redan finns uppmanas du ange ett annat namn.
            </p>
            <p>Du kan ange namnet p&aring; en mapp i  <b>Mitt inneh&aring;ll</b> d&auml;r resultatet sparas med listrutan <b>Spara resultat i</b>. Om du har behörigheter att skapa både tilelager och dynamiska bildlager kan du ange vilken lagertyp som ska genereras i utdata med hjälp av listrutan Spara resultat som. </p>
        </div>
    </div>
</div>
</html>
