<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Sampla</h2><p/>
        <h2><img src="../images/GUID-3950CCA3-C1D0-493F-A33D-93673443ADD2-web.png" alt="Sampla"></h2>
        <hr/>
    <p>Det h&auml;r verktyget skapar en tabell eller punktgeoobjektklass som visar v&auml;rdena f&ouml;r celler fr&aring;n ett raster, eller ett rasterset, f&ouml;r definierade platser. Platserna definieras av rasterceller, polygongeoobjekt, polylinjegeoobjekt eller av en upps&auml;ttning punkter.
    </p>
    <p>H&auml;r &auml;r n&aring;gra exempel p&aring; anv&auml;ndningar av det h&auml;r verktyget:
        <ul>
            <li> Extrahera attribut f&ouml;r mobilmastplatsen fr&aring;n flera raster, som markanv&auml;ndning, jordtyp, h&ouml;jd och avst&aring;nd till v&auml;g.
            </li>
            <li>Extrahera jordtemperatur p&aring; olika djup f&ouml;r en given upps&auml;ttning punkter.
            </li>
            <li>Med utg&aring;ngspunkt fr&aring;n 30 &aring;rs m&aring;nadsbaserade temperaturdata f&ouml;r havsytan, summerar du vid platser d&auml;r djur befinner sig eller inom hemomr&aring;den under en viss tid n&auml;r en djurart observerades.
            </li>
        </ul>
        
    </p>
    <p>Om  <b>Anv&auml;nd aktuell kartutbredning</b> &auml;r markerat analyseras variabler eller band f&ouml;r de lager som &auml;r synliga i den aktuella kartutbredningen. Om alternativet inte markeras analyseras variablerna eller banden i hela lagret, &auml;ven om de ligger utanf&ouml;r den aktuella kartutbredningen.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inRasters">
        <div><h2>Välj bildlager att sampla</h2></div>
        <hr/>
        <div>
            <p>En enda bild eller en lista &ouml;ver bilder vars v&auml;rden ska samplas baserat p&aring; platsdata f&ouml;r indata. 
            </p>
            <p>F&ouml;r att sampla alla sektorer fr&aring;n ett flerdimensionellt bildlager, m&aring;ste det vara det enda indatarastret.
            </p>
        </div>
    </div>
    <div id="inLocationData">
        <div><h2>Välj platslager</h2></div>
        <hr/>
        <div>
            <p>Data som identifierar positioner du vill sampla.
            </p>
            <p>Platsdata f&ouml;r indata kan vara ett raster, eller en punkt-, polylinje- eller polygongeoobjektklass.
            </p>
        </div>
    </div>
    <div id="uniqueIdField">
        <div><h2>Fältet Ange Unikt ID</h2></div>
        <hr/>
        <div>
            <p>Ett f&auml;lt som inneh&aring;ller olika v&auml;rden f&ouml;r varje plats eller geoobjekt i indataplatsrastret eller -geoobjektklassen.
            </p>
        </div>
    </div>
    <div id="acquisitionDefinition">
        <div><h2>Ange inhämtningsinformation för platsdata (valfritt)</h2></div>
        <hr/>
        <div>
            <p>Ange tid, djup eller andra inh&auml;mtningsdata kopplade till platscellerna eller geoobjekten.
            </p>
            <p>F&ouml;r varje dimension finns det tre alternativ f&ouml;r att ange inh&auml;mtningsinformationen kopplad till platsceller eller geoobjekt:
            </p>
            <ul>
                <li> <b>Ett f&auml;lt eller v&auml;rde</b> &mdash; N&auml;r det h&auml;r alternativet &auml;r markerat m&aring;ste f&ouml;ljande information anges:
                    <ul>
                        <li> <b>Dimensionsf&auml;lt eller v&auml;rde</b> &mdash; V&auml;lj ett f&auml;lt med dimensionsv&auml;rden fr&aring;n platsdata eller ange ett specifikt dimensionsv&auml;rde.
                        </li>
                    </ul>
                    
                    

                </li>
                <li> <b>Ett f&auml;lt eller v&auml;rde med relativa v&auml;rden</b> &mdash; Om det h&auml;r alternativet &auml;r valt, m&aring;ste informationen nedan anges tillsammans f&ouml;r att definiera det intervall inom vilket statistiken ber&auml;knas f&ouml;r variabler:
                    <ul>
                        <li> <b>Dimensionsf&auml;lt eller v&auml;rde</b> &mdash; V&auml;lj ett f&auml;lt med dimensionsv&auml;rden fr&aring;n platsdata.
                        </li>
                        <li> <b>Relativt v&auml;rde f&ouml;re</b> &mdash; Ange ett icke-negativt tal som ska anv&auml;ndas f&ouml;r att subtrahera fr&aring;n <b>Dimensionsf&auml;lt eller v&auml;rde</b> f&ouml;r att definiera starten av ett dimensionsv&auml;rdesintervall. Detta v&auml;rde motsvarar antalet dagar om dimensionen &auml;r tid.
                        </li>
                        <li> <b>Relativt v&auml;rde efter</b> &mdash; Ange ett icke-negativt tal som ska anv&auml;ndas f&ouml;r att l&auml;gga till <b>Dimensionsf&auml;lt eller v&auml;rde</b> f&ouml;r att definiera slutet av ett dimensionsv&auml;rdesintervall. Detta v&auml;rde motsvarar antalet dagar om dimensionen &auml;r tid.
                        </li>
                    </ul>
                    
                </li>
                <li> <b>Start- och slutf&auml;lt eller -v&auml;rden</b> &mdash; Om det h&auml;r alternativet &auml;r valt, m&aring;ste informationen nedan anges tillsammans f&ouml;r att definiera det intervall inom vilket statistiken ber&auml;knas f&ouml;r variabler:
                    <ul>
                        <li> <b>Startf&auml;lt eller -v&auml;rden</b> &mdash; V&auml;lj ett f&auml;lt med dimensionsv&auml;rden fr&aring;n platsdata eller ange ett specifikt dimensionsv&auml;rde f&ouml;r att definiera starten av ett dimensionsv&auml;rdesintervall.
                        </li>
                        <li> <b>Slutf&auml;lt eller -v&auml;rden</b> &mdash; V&auml;lj ett f&auml;lt med dimensionsv&auml;rden fr&aring;n platsdata eller ange ett specifikt dimensionsv&auml;rde f&ouml;r att definiera slutet av ett dimensionsv&auml;rdesintervall.
                        </li>
                    </ul>
                    
                    

                </li>
            </ul>
            
            <p>Den h&auml;r parametern &auml;r endast tillg&auml;nglig n&auml;r parametern  <b>V&auml;lj bildlager att sampla</b> &auml;r ett flerdimensionellt raster.
            </p>
        </div>
    </div>
    <div id="bufferDistance">
        <div><h2>Ange buffertavståndsfält eller värde</h2></div>
        <hr/>
        <div>
            <p>Det angivna avst&aring;ndet runt platsdatageoobjekten. Buffertavst&aring;ndet anges i de linj&auml;ra enheterna f&ouml;r platsgeoobjektets geografiska referens. Om geoobjektet anv&auml;nder en geografisk referens blir enheten grader.
            </p>
            <p>Statistik ber&auml;knas inom detta buffertomr&aring;de.
            </p>
            <p>Den h&auml;r parametern &auml;r endast tillg&auml;nglig n&auml;r  <b>V&auml;lj bildlager att sampla </b> &auml;r ett flerdimensionellt raster.
            </p>
        </div>
    </div>
    <div id="statisticsType">
        <div><h2>Välj statistiktyp</h2></div>
        <hr/>
        <div>
            <p>Typen av statistik som ska ber&auml;knas.
            </p>
            <ul>
                <li> <b>Minimum</b> &ndash; Hittar minimiv&auml;rdet inom det angivna intervallet.
                </li>
                <li> <b>Maximum</b> &ndash; Hittar maximiv&auml;rdet inom det angivna intervallet.
                </li>
                <li> <b>Median</b> &ndash; Hittar medianv&auml;rdet inom det angivna intervallet.
                </li>
                <li> <b>Medel</b> &ndash; Ber&auml;knar genomsnittet f&ouml;r det angivna intervallet.
                </li>
                <li> <b>Summa</b> &ndash; Ber&auml;knar summan f&ouml;r variablerna inom det angivna intervallet.
                </li>
                <li> <b>Majoritet</b> &ndash; Hittar det oftast f&ouml;rekommande v&auml;rdet.
                </li>
                <li> <b>Majoritet</b> &ndash; Hittar det minst ofta f&ouml;rekommande v&auml;rdet.
                </li>
                <li> <b>Standardavvikelse</b> &ndash; Ber&auml;knar standardavvikelsen.
                </li>
                <li> <b>Percentil</b> &ndash; Ber&auml;knar en definierad percentil inom det angivna omr&aring;det.
                </li>
            </ul>
            
            <p>Den h&auml;r parametern &auml;r endast tillg&auml;nglig n&auml;r parametern  <b>V&auml;lj bildlager att sampla</b> &auml;r ett flerdimensionellt raster och parametrarna <b>V&auml;lj platslager</b> &auml;r polylinjer eller polygoner eller <b>Ange buffertavst&aring;ndsf&auml;lt eller v&auml;rde (valfritt)</b> &auml;r angivet.
            </p>
        </div>
    </div>
    <div id="percentileValue">
        <div><h2>Percentilvärde</h2></div>
        <hr/>
        <div>
            <p>V&auml;rdet kan vara fr&aring;n 0 till 100. Standard &auml;r 90.
            </p>
            <p>Den h&auml;r parametern &auml;r endast tillg&auml;nglig n&auml;r parametern  <b>V&auml;lj statistiktyp</b> &auml;r inst&auml;lld p&aring; <b>Percentil</b>.
            </p>
        </div>
    </div>
    <div id="resamplingType">
        <div><h2>Ange omsamplingsteknik</h2></div>
        <hr/>
        <div>
            <p>Omsamplingsalgoritm som anv&auml;nds n&auml;r ett raster samplas.
            </p>
            <ul>
                <li> <b>N&auml;rmast</b> &mdash; N&auml;rmaste granne, som anv&auml;nder v&auml;rdet i den n&auml;rmaste cellen f&ouml;r att tilldela ett v&auml;rde till utdatacellen vid omsampling. Det h&auml;r &auml;r standardinst&auml;llningen.
                </li>
                <li> <b>Bilinj&auml;r</b> &mdash; Bilinj&auml;r interpolation, som fastst&auml;ller det nya v&auml;rdet i en cell baserat p&aring; ett viktat avst&aring;ndsgenomsnitt f&ouml;r de fyra n&auml;rmaste indatacellcentren.
                </li>
                <li> <b>Kubisk</b> &mdash; Kubisk interpolation, som fastst&auml;ller det nya v&auml;rdet i en cell baserat p&aring; inpassningen av en mjuk kurva genom de 16 n&auml;rmaste indatacellcentren.
                </li>
            </ul>
            
        </div>
    </div>
    <div id="layout">
        <div><h2>Ange utdatalayout</h2></div>
        <hr/>
        <div>
            <p>Anger om samplade v&auml;rden f&ouml;rekommer i rader eller kolumner i utdatatabellen.
            </p>
            <ul>
                <li> <b>Samplade v&auml;rden visas i rad</b> &ndash; Samplade v&auml;rden visas i separata rader i utdatatabellen. Det h&auml;r &auml;r standardinst&auml;llningen.
                </li>
                <li> <b>Samplade v&auml;rden visas i kolumn</b> &ndash; Samplade v&auml;rden visas i separata kolumner i utdatatabellen.
                </li>
            </ul>
            
            <p>Den h&auml;r parametern &auml;r endast tillg&auml;nglig n&auml;r parametern  <b>V&auml;lj bildlager att sampla</b> &auml;r ett flerdimensionellt raster och inneh&aring;ller en variabel och en dimension, och varje sektor &auml;r ett enbandsraster.
            </p>
        </div>
    </div>
    <div id="outputType">
        <div><h2>Ange utdatatyp</h2></div>
        <hr/>
        <div>
            <p>Anger om det ska genereras en punktgeoobjektklass med samplade v&auml;rden i tabellen, eller bara en tabell med samplade v&auml;rden.
            </p>
            <ul>
                <li> <b>Tabell</b> &ndash; Generera en tabell med samplade v&auml;rden. Det h&auml;r &auml;r standardinst&auml;llningen.
                </li>
                <li> <b>Geoobjekt</b> &ndash; Generera en punktgeoobjektklass med samplade v&auml;rden i tabellen. Om parametrarna <b>V&auml;lj platslager</b> &auml;r polylinjer eller polygoner &auml;r varje punkt i utdata centroiden f&ouml;r varje geometri i indataplatsgeoobjekten. 
                </li>
            </ul>
            
        </div>
    </div>
    <div id="outputName">
        <div><h2>Resultatlagrets namn</h2></div>
        <hr/>
        <div>
            
            <p>Namnet p&aring; lagret som skapas i  <b>Mitt inneh&aring;ll</b> och l&auml;ggs till i kartan. Standardnamnet baseras p&aring; verktygets namn och indatalagrets namn. Om lagret redan finns uppmanas du ange ett annat namn.
            </p>
            <p>Du kan ange namnet p&aring; en mapp i  <b>Mitt inneh&aring;ll</b> d&auml;r resultatet sparas med listrutan <b>Spara resultat i</b>.
            </p>
        </div>
    </div>
</div>
</html>
