<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Summera inom</h2><p/>
        <h2><img src="../images/GUID-90E0CB1F-EB97-4752-B2EE-452B7B45475E-web.png" alt="Summera inom"></h2>
        <hr/>
    <p>Det h&auml;r verktyget anv&auml;nds f&ouml;r att hitta geoobjekt (och delar av geoobjekt) som ligger inom gr&auml;nserna f&ouml;r omr&aring;den i det f&ouml;rsta indatalagret.   
        <ul>
            <li>Med ett lager f&ouml;r avrinningsgr&auml;nser och ett lager f&ouml;r markanv&auml;ndningsgr&auml;nser kan du ber&auml;kna den totala arealen f&ouml;r de olika markanv&auml;ndningstyperna f&ouml;r varje avrinningsomr&aring;de. 
            </li>
            <li>Med ett lager f&ouml;r fastigheter i ett l&auml;n och ett lager kommungr&auml;nser kan du summera snittv&auml;rdet f&ouml;r de tomma fastigheterna inom varje kommungr&auml;ns.
            </li>
        </ul>
        
    </p>
    <p>Om  <b>Anv&auml;nd aktuell kartutbredning</b> markeras, analyseras bara de geoobjekt i indatalagret och lagret som ska summeras som visas i den aktuella kartutbredningen. Om alternativet inte &auml;r markerat, analyseras alla geoobjekt i b&aring;de indatalagret och lagret som ska summeras, &auml;ven om de ligger utanf&ouml;r den aktuella kartutbredningen.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="sumWithinLayer">
        <div><h2>Välj områdeslager där andra geoobjekt ska summeras inom dess gränser</h2></div>
        <hr/>
        <div>
            <p>Det omr&aring;deslager som ska anv&auml;ndas f&ouml;r att summera geoobjekt inom dess gr&auml;nser. Du kan v&auml;lja att summera ett omr&aring;deslager inom ett polygonlager som du anger, eller lagringsplatser i form av fyrkanter eller hexagoner som genereras n&auml;r verktyget k&ouml;rs. N&auml;r lagringsplatser skapas avg&ouml;r siffran och enheterna som angivits f&ouml;r  <b>Kvadrat</b> kvadratens h&ouml;jd och l&auml;ngd. F&ouml;r <b>Hexagon</b> avg&ouml;r siffran och enheterna som angivits avst&aring;ndet mellan parallella sidor.
            </p>
            <p>F&ouml;rutom att v&auml;lja ett lager fr&aring;n kartan kan du v&auml;lja  <b>Bl&auml;ddra bland lager</b> l&auml;ngst ned i listrutan f&ouml;r att bl&auml;ddra till ditt inneh&aring;ll efter ett big data-fildelningsdataset eller geoobjektslager.  
            </p>
        </div>
    </div>
    <div id="summaryLayer">
        <div><h2>Välj lager som ska summeras</h2></div>
        <hr/>
        <div>
            <p>Geoobjekt i det h&auml;r lagret som hamnar innanf&ouml;r gr&auml;nserna f&ouml;r geoobjekt i indatalagret eller lagringsplatserna ovan summeras. 
            </p>
            <p>F&ouml;rutom att v&auml;lja ett lager fr&aring;n kartan kan du v&auml;lja  <b>Bl&auml;ddra bland lager</b> l&auml;ngst ned i listrutan f&ouml;r att bl&auml;ddra till ditt inneh&aring;ll efter ett big data-fildelningsdataset eller geoobjektslager.  
            </p>
        </div>
    </div>
    <div id="inputBins">
        <div><h2>Välj avstånd för att generera lagerplatser och aggregera till</h2></div>
        <hr/>
        <div>
            <p>Avst&aring;ndet som anv&auml;nds f&ouml;r att skapa lagringsplatser.  
            </p>
            <p>Du m&aring;ste ange antingen  <b>Lagringsplatsstorlek</b> f&ouml;r lagringsplatser eller ett <b>Omr&aring;deslager</b>.
            </p>
        </div>
    </div>
    <div id="timeSlicing">
        <div><h2>Aggregera med tidsdelar (valfritt)</h2></div>
        <hr/>
        <div>
            <p>Om tid &auml;r aktiverat p&aring; indatapunktlagret och det &auml;r av typen tidspunkt, kan du analysera med tidsdelning. Du kan st&auml;lla in tre parametrar n&auml;r du anv&auml;nder tid:
                <ul>
                    <li>  <b>Tidsintervall</b>
                    </li>
                    <li> <b>Tidssteg</b>
                    </li>
                    <li> <b>Referenstid</b>
                    </li>
                </ul>
                
            </p>
            <p>T&auml;nk dig att du har data som representerar ett &aring;r i tiden och du vill analysera med tidsdelar p&aring; veckoniv&aring;. Det g&ouml;r du genom att ange  <b>Tidsintervall</b> som <code>1 vecka</code>.
            </p>
            <p> T&auml;nk dig att du har data som representerar ett &aring;r i tiden och du vill analysera utifr&aring;n f&ouml;rsta veckan i m&aring;naden. Det g&ouml;r du genom att ange <b>Tidsintervall</b> som <code>1 vecka</code>, <b>Tidssteg</b> som <code>1 m&aring;nad</code> och <b>Referenstid</b> som <code>1 januari kl 0:00</code>.
            </p>
        </div>
    </div>
    <div id="timeInterval">
        <div><h2>Tidsintervall som ska aggregeras till</h2></div>
        <hr/>
        <div>
            <p>Tidsintervall som anv&auml;nds f&ouml;r att dela data. Tidsintervall kan anv&auml;ndas frist&aring;ende eller anv&auml;ndas med parametern  <b>Tidssteg</b> eller <b>Referenstid</b>.
            </p>
            <p> Om du vill skapa tidsdelar som &auml;ger rum varje m&aring;ndag fr&aring;n 9.00 till 10.00 skulle <b>Tidsintervall</b> vara <code>1 timme</code>, <b>Tidssteg</b> skulle vara <code>1 vecka</code>, och <b>Referenstid</b> skulle vara <code>9:00:00 p&aring; en m&aring;ndag</code>.
            </p>
        </div>
    </div>
    <div id="timeStep">
        <div><h2>Tidssteg som ska aggregeras till</h2></div>
        <hr/>
        <div>
            <p> Det steg som anv&auml;nds f&ouml;r att ber&auml;kna en tidsdel. <b>Tidssteg</b> kan anv&auml;ndas frist&aring;ende eller med <b>Tidsintervall</b>, med <b>Referenstid</b>, eller med b&aring;de <b>Tidsintervall</b> och <b>Referenstid</b>.
            </p>
            <p> Om du vill skapa tidsdelar som &auml;ger rum varje m&aring;ndag fr&aring;n 9.00 till 10.00 skulle <b>Tidsintervall</b> vara <code>1 timme</code>, <b>Tidssteg</b> skulle vara <code>1 vecka</code>, och <b>Referenstid</b> skulle vara <code>9:00:00 p&aring; en m&aring;ndag</code>.
            </p>
        </div>
    </div>
    <div id="timeReference">
        <div><h2>Referenstid som används till att justera tidsdelar</h2></div>
        <hr/>
        <div>
            <p>Datum och tid som anv&auml;nds f&ouml;r att justera tidsdelar.  <b>Tidssteg</b> startar fr&aring;n och forts&auml;tter bak&aring;t f&ouml;r referenstiden.
            </p>
            <p> Om du vill skapa tidsdelar som &auml;ger rum varje m&aring;ndag fr&aring;n 9.00 till 10.00 skulle <b>Tidsintervall</b> vara <code>1 timme</code>, <b>Tidssteg</b> skulle vara <code>1 vecka</code>, och <b>Referenstid</b> skulle vara <code>9:00:00 p&aring; en m&aring;ndag</code>.
            </p>
        </div>
    </div>
    <div id="summaryFields">
        <div><h2>Lägg till statistik från lagret som ska summeras (alternativt)</h2></div>
        <hr/>
        <div>
            <p> Du kan ber&auml;kna statistik p&aring; summerade geoobjekt. P&aring; numeriska f&auml;lt kan du ber&auml;kna f&ouml;ljande:
                <ul>
                    <li>Antal
                    </li>
                    <li>Medelv&auml;rde
                    </li>
                    <li>min
                    </li>
                    <li>max
                    </li>
                    <li>Intervall
                    </li>
                    <li>Varians
                    </li>
                    <li>Standardavvikelse
                    </li>
                </ul>
                
            </p>
            <p>P&aring; f&auml;lt med str&auml;ngar kan du ber&auml;kna f&ouml;ljande:
                <ul>
                    <li>Antal
                    </li>
                    <li>Alla &ndash; Det statistiska v&auml;rdet &auml;r ett slumpm&auml;ssigt exempel p&aring; ett str&auml;ngv&auml;rde i det angivna f&auml;ltet.
                    </li>
                </ul>
                All statistik ber&auml;knas p&aring; v&auml;rden som inte &auml;r null. Det resulterande lagret inneh&aring;ller ett nytt f&auml;lt f&ouml;r varje statistiskt v&auml;rde som ber&auml;knas. Du kan l&auml;gga till valfri m&auml;ngd statistiska v&auml;rden genom att v&auml;lja ett attribut och statistik. 
            </p>
            <p>F&ouml;rutom den h&auml;r statistiken ber&auml;knas proportionell statistik f&ouml;r alla numeriska f&auml;lt:
                <ul>
                    <li>Antal &ndash; Antalet f&ouml;r varje f&auml;lt multiplicerat med proportionen f&ouml;r sammanfattningslagret inom polygonerna. 
                    </li>
                    <li>Summa &ndash; Summan av de viktade v&auml;rdena i varje f&auml;lt. D&auml;r den till&auml;mpade vikten &auml;r proportionen f&ouml;r sammanfattningslagret inom polygonerna.
                    </li>
                    <li>Medelv&auml;rde &ndash; Det viktade medelv&auml;rdet f&ouml;r v&auml;rdena i varje f&auml;lt. D&auml;r den till&auml;mpade vikten &auml;r proportionen f&ouml;r sammanfattningslagret inom polygonerna.
                    </li>
                    <li>Min &ndash; Minsta v&auml;rde f&ouml;r de viktade v&auml;rdena i varje f&auml;lt. D&auml;r den till&auml;mpade vikten &auml;r proportionen f&ouml;r sammanfattningslagret inom polygonerna.
                    </li>
                    <li>Max &ndash; Maximalt v&auml;rde f&ouml;r de viktade v&auml;rdena i varje f&auml;lt. D&auml;r den till&auml;mpade vikten &auml;r proportionen f&ouml;r sammanfattningslagret inom polygonerna.
                    </li>
                    <li>Intervall &ndash; Skillnaden mellan de maximala och minimala viktade v&auml;rdena.
                    </li>
                </ul>
                
            </p>
            <p>Beroende p&aring; vilka typer av geoobjekt du summerar, ber&auml;knas det totala antalet n&auml;rliggande punkter, linjernas totala l&auml;ngd eller totalarean.
            </p>
        </div>
    </div>
    <div id="spatialReference">
        <div><h2>SpatialReference (wkid)</h2></div>
        <hr/>
        <div>
            <p>Det h&auml;r &auml;r en tillf&auml;llig parameter f&ouml;r f&ouml;rhandsversionen f&ouml;r att st&auml;lla in den geografiska referensen f&ouml;r bearbetning. M&aring;nga big data-verktyg kr&auml;ver att ett projicerat koordinatsystem anv&auml;nds som geografisk referens f&ouml;r bearbetning. Som standard anv&auml;nder verktyget indatakoordinatsystemet men misslyckas om det &auml;r ett geografiskt koordinatsystem. Ange WKID f&ouml;r att st&auml;lla in ett projicerat koordinatsystem. Till exempel anges  <b>Web Mercator</b> som <code>3857</code>.
            </p>
        </div>
    </div>
    <div id="dataStore">
        <div><h2>Välj datalager</h2></div>
        <hr/>
        <div>
            <p>Det h&auml;r &auml;r en tillf&auml;llig parameter f&ouml;r f&ouml;rhandsversionen f&ouml;r att ange det datalager d&auml;r resultaten sparas. B&aring;da datalagren ing&aring;r i  ArcGIS Data Store. Om du v&auml;ljer det rumstemporala datalagret men inte har ett installerat misslyckas verktyget. </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Resultatlagrets namn</h2></div>
        <hr/>
        <div>
            <p> Det h&auml;r &auml;r namnet p&aring; lagret som skapas i <b>Mitt inneh&aring;ll</b> och l&auml;ggs till i kartan. Standardnamnet baseras p&aring; verktygets namn och indatalagrets namn. Om lagret redan finns misslyckas verktyget.
            </p>
            <p>Om du anv&auml;nder listrutan  <b>Spara resultat i</b> kan du ange namnet p&aring; en mapp i <b>Mitt inneh&aring;ll</b> d&auml;r resultatet ska sparas.
            </p>
        </div>
    </div>
</div>
</html>
