<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="smallsize">
        <h2>Avrinningsområde</h2><p/>
        <h2><img src="../images/GUID-AF749369-8C2D-46FF-9D74-2CF7CAB7C7B0-web.png" alt="Avrinningsomr&aring;de &ndash; aktivitet"></h2>
        <hr/>
    <p>Det h&auml;r verktyget avg&ouml;r ackumuleringsomr&aring;det ovanf&ouml;r en upps&auml;ttning celler i ett raster.
    </p>
    <p> En indatapunkt p&aring; Mississippifloden i Louisiana kommer att skapa ett avrinningsomr&aring;desgeoobjekt som utvidgas till att omfatta omr&aring;den fr&aring;n New York till Montana och in i Kanada.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputFlowDirectionRaster">
        <div><h2>Välj flödesriktningslager</h2></div>
        <hr/>
        <div>
            <p>Det indataraster som visar riktningen f&ouml;r fl&ouml;det ut ur varje cell.
            </p>
            <p>Fl&ouml;desriktningsraster kan skapas med rasterfunktionen Fl&ouml;desriktning, med standardfl&ouml;desriktningstypen <b>D8</b>.
            </p>
        </div>
    </div>
    <div id="inPourPointRasterOrFeatures">
        <div><h2>Ange indatahällpunktsplatser</h2></div>
        <hr/>
        <div>
            <p>Indatah&auml;llpunktsplatserna.
            </p>
            <p>Detta kan vara ett raster eller punktgeoobjekt. F&ouml;r ett raster motsvarar detta celler ovanf&ouml;r vilka avrinningsomr&aring;det, eller flodomr&aring;det, kommer att fastst&auml;llas. Alla celler som inte &auml;r NoData anv&auml;nds som k&auml;llceller. F&ouml;r punktindata motsvarar detta platser ovanf&ouml;r vilka avrinningsomr&aring;det, eller flodomr&aring;det, kommer att fastst&auml;llas.
            </p>
        </div>
    </div>
    <div id="pourPointField">
        <div><h2>Välj hällpunktsfält</h2></div>
        <hr/>
        <div>
            <p>F&auml;ltet anv&auml;nds f&ouml;r att tilldela v&auml;rden till h&auml;llpunktsplatser.
            </p>
            <p>Om indatah&auml;llpunktslagret &auml;r ett raster anv&auml;nds  <i>Value</i>. Om det &auml;r geoobjekt anv&auml;nds ett numeriskt f&auml;lt. Om f&auml;ltet inneh&aring;ller flyttalsv&auml;rden kommer de att kortas av till heltal.
            </p>
        </div>
    </div>
    <div id="resultLayer">
        <div><h2>Resultatlagrets namn</h2></div>
        <hr/>
        <div>
            
            <p>Namnet p&aring; lagret som skapas i  <b>Mitt inneh&aring;ll</b> och l&auml;ggs till i kartan. Standardnamnet baseras p&aring; verktygets namn och indatalagrets namn. Om lagret redan finns uppmanas du ange ett annat namn.
            </p>
            <p>Du kan ange namnet p&aring; en mapp i  <b>Mitt inneh&aring;ll</b> d&auml;r resultatet sparas med listrutan <b>Spara resultat i</b>. Om du har behörigheter att skapa både tilelager och dynamiska bildlager kan du ange vilken lagertyp som ska genereras i utdata med hjälp av listrutan Spara resultat som. </p>
        </div>
    </div>
</div>
</html>
