<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Zonstatistik som tabell</h2><p/>
        <h2><img src="../images/GUID-2847466F-BF22-4545-BDCE-7EB7B1D15F2D-web.png" alt="Zonstatistik som tabelldiagram"></h2>
        <hr/>
    <p>Verktyget summerar v&auml;rdena i ett raster inom zonerna f&ouml;r ett annat dataset och rapporterar resultatet till en tabell.
    </p>
    <p>H&auml;r &auml;r n&aring;gra exempel p&aring; anv&auml;ndningar av det h&auml;r verktyget:
        <ul>
            <li>Med ett lager f&ouml;r avrinningsgr&auml;nser och ett lager med markanv&auml;ndningsgr&auml;nser enligt markanv&auml;ndningstyp kan du ber&auml;kna den totala arealen f&ouml;r de olika markanv&auml;ndningstyperna f&ouml;r varje avrinningsomr&aring;de.
                

            </li>
            <li>Med ett lager f&ouml;r fastigheter i ett l&auml;n och ett lager kommungr&auml;nser kan du summera snittv&auml;rdet f&ouml;r de tomma fastigheterna inom varje kommungr&auml;ns.
                

            </li>
        </ul>
        
    </p>
    <p>Om  <b>Anv&auml;nd aktuell kartutbredning</b> markeras, analyseras bara de geoobjekt i indatalagret och lagret som ska summeras som visas i den aktuella kartutbredningen. Om alternativet inte &auml;r markerat analyseras alla geoobjekt i b&aring;de indatalagret och lagret som ska summeras, &auml;ven om de ligger utanf&ouml;r den aktuella kartutbredningen.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputZoneRasterOrFeatures">
        <div><h2>Välj zonraster eller geoobjekt</h2></div>
        <hr/>
        <div>
            <p>Indata som definierar gr&auml;nserna f&ouml;r zonerna, eller omr&aring;dena, som ska summeras.
            </p>
            <p>Indata kan vara ett heltalsraster eller geoobjektdata. F&ouml;r raster definieras zonerna av alla platser i indata som har samma cellv&auml;rde. F&ouml;r geoobjekt kan zonerna &ouml;verlappas. Omr&aring;dena beh&ouml;ver inte vara sammanh&auml;ngande.
            </p>
        </div>
    </div>
    <div id="zoneField">
        <div><h2>Zonfält</h2></div>
        <hr/>
        <div>
            <p>F&auml;ltet som inneh&aring;ller de v&auml;rden som definierar varje zon.
            </p>
            <p>Det kan vara ett heltalsf&auml;lt eller str&auml;ngf&auml;lt i zondatasetet.
            </p>
        </div>
    </div>
    <div id="inputValueRaster">
        <div><h2>Välj värderaster</h2></div>
        <hr/>
        <div>
            <p>Rastret som inneh&aring;ller de v&auml;rden som statistiken ska ber&auml;knas p&aring;.
            </p>
            <p>Det kan vara antingen en heltalstyp eller flyttalstyp. Men n&auml;r det &auml;r en flyttalstyp kommer alternativen f&ouml;r att ber&auml;kna majoritet, minoritet och varians inte att finnas tillg&auml;ngliga.
            </p>
        </div>
    </div>
    <div id="ignoreNodata">
        <div><h2>Ignorera NoData i beräkningar (tillval)</h2></div>
        <hr/>
        <div>
            <p> Anger huruvida NoData-v&auml;rden ignoreras i analysen.
            </p>
            <ul>
                <li>Markerat &ndash; Analysen inneh&aring;ller de celler som har ett v&auml;rde i indatav&auml;rdesrastret inom en viss zon f&ouml;r att fastst&auml;lla utdatav&auml;rdet f&ouml;r den zonen. NoData-celler i v&auml;rderaster ignoreras i statistikber&auml;kningen. Det h&auml;r &auml;r standardinst&auml;llningen.
                </li>
                <li>Avmarkerad &ndash; Analysen resulterar i NoData om det finns NoData-v&auml;rden f&ouml;r cellerna i v&auml;rderastret inom en angiven zon.
                </li>
            </ul>
            
        </div>
    </div>
    <div id="statisticType">
        <div><h2>Statistiktyp (valfritt)</h2></div>
        <hr/>
        <div>
            <p>Statistiktypen som ska ber&auml;knas.
            </p>
            <p> Indata kan vara n&aring;got av f&ouml;ljande: <b>Alla</b>, <b>Medel</b>, <b>Majoritet</b>, <b>Maximum</b>, <b>Median</b>, <b>Minimum</b>, <b>Minoritet</b>, <b>Percentil</b>, <b>Intervall</b>, <b>Standardavvikelse</b>, <b>Summa</b>, <b>Varians</b>, <b>Minimum och Maximum</b>, <b>Medelv&auml;rde och standardavvikelse</b> eller <b>Minimum, Maximum och Medel</b>. Standardv&auml;rdet &auml;r <b>Alla</b>.
            </p>
        </div>
    </div>
    <div id="percentileValues">
        <div><h2>Percentilvärden (valfritt)</h2></div>
        <hr/>
        <div>
            <p>Percentil att ber&auml;kna. Standard &auml;r 90, som anger den nittionde percentilen.
            </p>
            <p>V&auml;rdet kan vara fr&aring;n 0 till 100. Den 0:e percentilen &auml;r i grunden samma som statistiken Minimum, och den 100:e percentilen motsvarar Maximum. V&auml;rdet 50 ger i huvudsak samma resultat som statistikkategorin Median.
            </p>
            <p> Denna parameter st&ouml;ds bara om parametern <b>Statistiktyp</b> &auml;r angiven till <b>Percentil</b> eller <b>Alla</b>.
            </p>
        </div>
    </div>
    <div id="percentileInterpolationType">
        <div><h2>Interpoleringstyp för percentil (valfritt)</h2></div>
        <hr/>
        <div>
            <p>Anger vilken metod f&ouml;r interpolering av percentil som ska anv&auml;ndas n&auml;r antalet v&auml;rden fr&aring;n indatarastret som ska ber&auml;knas &auml;r j&auml;mnt.
            </p>
            <ul>
                <li>  <b>Autoidentifiering</b> &mdash; Om indatav&auml;rderastret &auml;r av heltalspixeltyp anv&auml;nds metoden <b>N&auml;rmast</b>. Om indatav&auml;rderastret &auml;r av flyttalspixeltyp anv&auml;nds metoden <b>Linj&auml;r</b>. Det h&auml;r &auml;r standardinst&auml;llningen.
                </li>
                <li> <b>N&auml;rmast</b> &mdash; Det n&auml;rmaste tillg&auml;ngliga v&auml;rdet till &ouml;nskad percentil anv&auml;nds.
                </li>
                <li> <b>Linj&auml;r</b> &mdash; Det viktade medelv&auml;rdet av de tv&aring; omgivande v&auml;rdena fr&aring;n den &ouml;nskade percentilen anv&auml;nds.
                </li>
            </ul>
            
            <p> Denna parameter st&ouml;ds bara om parametern <b>Statistiktyp</b> &auml;r angiven till <b>Percentil</b> eller <b>Alla</b>.
            </p>
        </div>
    </div>
    <div id="processAsMultidimensional">
        <div><h2>Bearbeta flerdimensionellt (valfritt)</h2></div>
        <hr/>
        <div>
            <p>Anger hur de flerdimensionella indatabildtj&auml;nsterna bearbetas om de &auml;r flerdimensionella.
            </p>
            <ul>
                <li>Markerat &ndash; Statistiken ber&auml;knas utifr&aring;n den aktuella delen av det flerdimensionella indatasetet. Det h&auml;r &auml;r standardinst&auml;llningen.
                    

                </li>
                <li>Avmarkerat &ndash; Statistiken ber&auml;knas f&ouml;r alla dimensioner av det flerdimensionella indatasetet.
                </li>
            </ul>
            
        </div>
    </div>
    <div id="outputTableName">
        <div><h2>Resultat för tabellnamn</h2></div>
        <hr/>
        <div>
            <p>Namnet p&aring; lagret som skapas i  <b>Mitt inneh&aring;ll</b> och l&auml;ggs till i kartan. Standardnamnet baseras p&aring; verktygets namn och indatalagrets namn. Om lagret redan finns uppmanas du ange ett annat namn.
            </p>
            <p>Du kan ange namnet p&aring; en mapp i  <b>Mitt inneh&aring;ll</b> d&auml;r resultatet sparas med listrutan <b>Spara resultat i</b>.
            </p>
        </div>
    </div>
</div>
</html>
