<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="smallsize">
        <h2>Trích xuất Raster</h2><p/>
        <h2><img src="../images/GUID-DC9CBCB9-A07C-42D3-A0CB-2FB1483CBF4C-web.png" alt="C&ocirc;ng cụ Tr&iacute;ch xuất Raster cho Cổng th&ocirc;ng tin"></h2>
        <hr/>
    <p>C&ocirc;ng cụ n&agrave;y c&oacute; thể cắt một raster đến ranh giới, d&ugrave; l&agrave; th&agrave;nh h&igrave;nh chữ nhật hoặc h&igrave;nh dạng do bạn x&aacute;c định tr&ecirc;n m&agrave;n h&igrave;nh. Bạn c&oacute; thể cắt đến phạm vi v&ugrave;ng m&agrave; bạn đ&atilde; hiển thị tr&ecirc;n bản đồ v&agrave; theo v&ugrave;ng nghi&ecirc;n cứu được x&aacute;c định bởi một polygon.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputLayer">
        <div><h2>Chọn dữ liệu đầu vào để trích xuất</h2></div>
        <hr/>
        <div>
            <p>Lớp đầu v&agrave;o để cắt.
            </p>
        </div>
    </div>
    <div id="clippingGeometry">
        <div><h2>Xác định hình học cắt xén</h2></div>
        <hr/>
        <div>
            <p>Chọn loại phạm vi để sử dụng khi cắt h&igrave;nh học của lớp:
                <ul>
                    <li>Sử dụng phạm vi hiện tại&mdash;Phạm vi bản đồ hiện tại sẽ được sử dụng để cắt lớp kết quả. Đ&acirc;y l&agrave; mặc định.
                        

                    </li>
                    <li>Chọn khu vực nghi&ecirc;n cứu&mdash;Cho ph&eacute;p bạn x&aacute;c định một h&igrave;nh học cắt x&eacute;n bằng c&aacute;ch sử dụng c&ocirc;ng cụ vẽ.
                        

                    </li>
                    <li>Chọn lớp&mdash;Chọn lớp đối tượng hoặc lớp h&igrave;nh ảnh để x&aacute;c định phạm vi hoặc chọn lớp đối tượng đa gi&aacute;c để x&aacute;c định h&igrave;nh học cắt x&eacute;n. Khi một lớp đối tượng đa gi&aacute;c được chọn, một &ocirc; đ&aacute;nh dấu sẽ hiển thị để chỉ định liệu c&oacute; sử dụng c&aacute;c t&iacute;nh năng đầu v&agrave;o cho h&igrave;nh học cắt x&eacute;n hay kh&ocirc;ng. Theo mặc định l&agrave; kh&ocirc;ng được chọn. C&oacute; nghĩa l&agrave; lớp t&iacute;nh năng đầu v&agrave;o được sử dụng để x&aacute;c định phạm vi. Nếu được chọn, c&oacute; nghĩa l&agrave; c&aacute;c đối tượng đầu v&agrave;o được sử dụng cho h&igrave;nh học cắt x&eacute;n.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="clippingType">
        <div><h2>Xác định kiểu cắt</h2></div>
        <hr/>
        <div>
            <p>Chỉ định liệu bạn c&oacute; muốn giữ khu vực b&ecirc;n trong hoặc b&ecirc;n ngo&agrave;i khu&ocirc;n h&igrave;nh học cắt x&eacute;n của bạn kh&ocirc;ng:
                <ul>
                    <li>Dữ liệu b&ecirc;n trong h&igrave;nh học&mdash;H&igrave;nh ảnh b&ecirc;n trong phạm vi cắt sẽ được tr&iacute;ch xuất. Đ&acirc;y l&agrave; mặc định.
                        

                    </li>
                    <li>Dữ liệu b&ecirc;n ngo&agrave;i h&igrave;nh học&mdash;H&igrave;nh ảnh b&ecirc;n ngo&agrave;i phạm vi cắt sẽ được tr&iacute;ch xuất.
                        

                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="outputLayer">
        <div><h2>Tên lớp kết quả</h2></div>
        <hr/>
        <div>
            
            <p>T&ecirc;n lớp sẽ được tạo trong  <b>Nội dung của t&ocirc;i</b> v&agrave; được th&ecirc;m v&agrave;o bản đồ. T&ecirc;n mặc định dựa v&agrave;o t&ecirc;n c&ocirc;ng cụ v&agrave; t&ecirc;n lớp đầu v&agrave;o. Nếu lớp đ&atilde; tồn tại, bạn sẽ được y&ecirc;u cầu cung cấp t&ecirc;n kh&aacute;c.
            </p>
            <p>Bạn c&oacute; thể chỉ định t&ecirc;n của một thư mục trong  <b>Nội dung của t&ocirc;i</b> m&agrave; tại đ&oacute; kết quả sẽ được lưu bằng c&aacute;ch sử dụng hộp xổ xuống <b>Lưu kết quả v&agrave;o</b>. Nếu bạn có quyền tạo cả lớp hình ảnh động và hình ảnh dạng tile, bạn có thể chỉ định loại lớp hình ảnh đầu ra bằng cách sử dụng thanh thả xuống Lưu kết quả thành. </p>
        </div>
    </div>
</div>
</html>
