<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="smallsize">
        <h2>Dự đoán sử dụng Raster Xu hướng</h2><p/>
        <h2><img src="../images/GUID-E3758820-51A9-46DE-AAF6-E27B68DE4012-web.png" alt="Dự đo&aacute;n sử dụng Raster Xu hướng"></h2>
        <hr/>
    <p>T&iacute;nh to&aacute;n một raster đa chiều được dự đo&aacute;n sử dụng raster xu hướng đầu ra từ c&ocirc;ng cụ  Tạo Raster Xu hướng.
    </p>
    <p>Nếu chọn  <b>Sử dụng phạm vi bản đồ</b>, th&igrave; c&aacute;c biến trong lớp nh&igrave;n thấy được trong phạm vi bản đồ hiện tại sẽ được ph&acirc;n t&iacute;ch. Nếu kh&ocirc;ng được chọn, c&aacute;c biến của lớp đầy đủ sẽ được ph&acirc;n t&iacute;ch, ngay cả khi ch&uacute;ng nằm ngo&agrave;i phạm vi bản đồ hiện tại.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputMultidimensionalRaster">
        <div><h2>Chọn lớp hình ảnh đa chiều để dự đoán</h2></div>
        <hr/>
        <div>
            <p>Raster xu hướng đa chiều đầu v&agrave;o từ c&ocirc;ng cụ  Tạo Raster Xu hướng.
            </p>
        </div>
    </div>
    <div id="variables">
        <div><h2>Chọn biến sẽ được dự đoán</h2></div>
        <hr/>
        <div>
            <p>Biến hoặc c&aacute;c biến sẽ được dự đo&aacute;n trong ph&acirc;n t&iacute;ch. Nếu kh&ocirc;ng c&oacute; biến n&agrave;o được chỉ định th&igrave; tất cả c&aacute;c biến sẽ được sử dụng.
            </p>
        </div>
    </div>
    <div id="dimensionDefinition">
        <div><h2>Chọn phương thức dùng để cung cấp giá trị chiều dự đoán</h2></div>
        <hr/>
        <div>
            <p>Chỉ định phương ph&aacute;p được sử dụng để cung cấp gi&aacute; trị hướng dự đo&aacute;n.
                <ul>
                    <li> <b>Theo Gi&aacute; trị</b>&mdash;Dự đo&aacute;n sẽ được t&iacute;nh cho một gi&aacute; trị chiều hoặc một danh s&aacute;ch c&aacute;c gi&aacute; trị chiều được chỉ định trong bước tiếp theo. Đ&acirc;y l&agrave; mặc định. Chẳng hạn, nếu bạn muốn dự đo&aacute;n lượng mưa h&agrave;ng năm cho c&aacute;c năm 2050, 2100 v&agrave; 2150.
                    </li>
                    <li> <b>Theo Khoảng</b>&mdash;Dự đo&aacute;n sẽ được t&iacute;nh cho một khoảng của chiều được x&aacute;c định bằng gi&aacute; trị bắt đầu v&agrave; gi&aacute; trị kết th&uacute;c. Chẳng hạn, nếu bạn muốn dự đo&aacute;n lượng mưa h&agrave;ng năm cho mỗi năm trong khoảng từ 2050 đến 2150.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="dimensionValues">
        <div><h2>Chỉ định (các) giá trị chiều cho dự đoán</h2></div>
        <hr/>
        <div>
            <p>Gi&aacute; trị chiều được sử dụng trong dự đo&aacute;n.
            </p>
            <p>Định dạng của gi&aacute; trị thời gian, độ s&acirc;u v&agrave; chiều cao phải tr&ugrave;ng khớp với định dạng của gi&aacute; trị chiều được sử dụng để tạo raster xu hướng. Nếu raster xu hướng được tạo ra cho chiều StdTime, định dạng sẽ l&agrave; YYYY-MM-DDTHH:MM:SS, v&iacute; dụ: 2050-01-01T00:00:00. Nhiều gi&aacute; trị được ph&acirc;n t&aacute;ch nhau bằng dấu chấm phẩy.
            </p>
            <p>Khi bạn chọn phương ph&aacute;p  <b>Theo gi&aacute; trị</b> để x&aacute;c định gi&aacute; trị của chiều cho dự đo&aacute;n th&igrave; th&ocirc;ng số n&agrave;y l&agrave; bắt buộc.
            </p>
        </div>
    </div>
    <div id="start">
        <div><h2>Bắt đầu</h2></div>
        <hr/>
        <div>
            <p>Ng&agrave;y bắt đầu, chiều cao hoặc độ s&acirc;u của khoảng chiều được sử dụng trong dự đo&aacute;n.
            </p>
        </div>
    </div>
    <div id="end">
        <div><h2>Kết thúc</h2></div>
        <hr/>
        <div>
            <p>Ng&agrave;y kết th&uacute;c, chiều cao hoặc độ s&acirc;u của khoảng chiều được sử dụng trong dự đo&aacute;n.
            </p>
        </div>
    </div>
    <div id="dimensionInterval">
        <div><h2>Xác định khoảng chiều cho dự đoán</h2></div>
        <hr/>
        <div>
            <p>X&aacute;c định ng&agrave;y bắt đầu v&agrave; ng&agrave;y kết th&uacute;c, chiều cao hoặc độ s&acirc;u của khoảng chiều sẽ được sử dụng trong dự đo&aacute;n.
            </p>
        </div>
    </div>
    <div id="intervalValue">
        <div><h2>Chỉ định số bước giữa giá trị bắt đầu và kết thúc</h2></div>
        <hr/>
        <div>
            <p>Số bước giữa hai gi&aacute; trị chiều được đưa v&agrave;o dự đo&aacute;n. Gi&aacute; trị mặc định l&agrave; 1.
            </p>
            <p>V&iacute; dụ: để dự đo&aacute;n gi&aacute; trị nhiệt độ sau mỗi 5 năm, h&atilde;y sử dụng gi&aacute; trị 5.
            </p>
        </div>
    </div>
    <div id="intervalUnit">
        <div><h2>Chọn đơn vị sẽ được sử dụng cho khoảng giá trị thời gian.</h2></div>
        <hr/>
        <div>
            <p>Chỉ định đơn vị sẽ được sử dụng cho khoảng gi&aacute; trị. Mục n&agrave;y chỉ &aacute;p dụng khi chiều của ph&acirc;n t&iacute;ch l&agrave; chiều thời gian.
            </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Tên lớp kết quả</h2></div>
        <hr/>
        <div>
            
            <p>T&ecirc;n lớp sẽ được tạo trong  <b>Nội dung của t&ocirc;i</b> v&agrave; được th&ecirc;m v&agrave;o bản đồ. T&ecirc;n mặc định dựa v&agrave;o t&ecirc;n c&ocirc;ng cụ v&agrave; t&ecirc;n lớp đầu v&agrave;o. Nếu lớp đ&atilde; tồn tại, bạn sẽ được y&ecirc;u cầu cung cấp t&ecirc;n kh&aacute;c.
            </p>
            <p>Bạn c&oacute; thể chỉ định t&ecirc;n của một thư mục trong  <b>Nội dung của t&ocirc;i</b> m&agrave; tại đ&oacute; kết quả sẽ được lưu bằng c&aacute;ch sử dụng hộp xổ xuống <b>Lưu kết quả v&agrave;o</b>. Nếu bạn có quyền tạo cả lớp hình ảnh động và hình ảnh dạng tile, bạn có thể chỉ định loại lớp hình ảnh đầu ra bằng cách sử dụng thanh thả xuống Lưu kết quả thành. </p>
        </div>
    </div>
</div>
</html>
