<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Mẫu</h2><p/>
        <h2><img src="../images/GUID-3950CCA3-C1D0-493F-A33D-93673443ADD2-web.png" alt="Mẫu"></h2>
        <hr/>
    <p>C&ocirc;ng cụ n&agrave;y tạo một loại đối tượng bảng hoặc điểm hiển thị gi&aacute; trị của c&aacute;c &ocirc; từ một raster hoặc tập hợp c&aacute;c raster cho vị tr&iacute; đ&atilde; x&aacute;c định. Vị tr&iacute; được x&aacute;c định bởi c&aacute;c &ocirc; raster, đối tượng dạng v&ugrave;ng, đối tượng dạng đường hoặc bởi một tập hợp c&aacute;c điểm.
    </p>
    <p>Gi&aacute; trị pixel sẽ được tr&iacute;ch xuất từ tất cả raster đầu v&agrave;o tại mỗi vị tr&iacute;. Một lớp đối tượng dạng điểm hoặc một bảng sẽ được tạo ra c&oacute; c&aacute;c trường chứa c&aacute;c gi&aacute; trị pixel cho mỗi raster đầu v&agrave;o. Thuộc t&iacute;nh bổ sung từ bảng raster đầu v&agrave;o sẽ kh&ocirc;ng được đưa v&agrave;o bảng đầu ra.
    </p>
    <p>Bất kỳ c&aacute;ch kết hợp raster n&agrave;o, chẳng hạn như đơn dải, đa dải, đa chiều hoặc đa biến, đều c&oacute; thể được chỉ định l&agrave;m raster đầu v&agrave;o. Cấu tr&uacute;c của bảng đầu ra thay đổi khi raster đầu v&agrave;o l&agrave; đa chiều. Khi raster đa dải được chỉ định l&agrave;m một trong c&aacute;c raster đầu v&agrave;o, tất cả c&aacute;c dải trong đầu v&agrave;o đ&oacute; sẽ được sử dụng. Để xử l&yacute; lựa chọn dải từ một raster đa dải đầu v&agrave;o, trước ti&ecirc;n h&atilde;y tạo một bộ dữ liệu raster mới bao gồm c&aacute;c dải đ&oacute;. Sử dụng kết quả trong danh s&aacute;ch c&aacute;c raster đầu v&agrave;o.
    </p>
    <p>Vị tr&iacute; đầu v&agrave;o c&oacute; thể l&agrave; đối tượng raster hoặc điểm:
        <ul>
            <li>Raster&mdash;C&aacute;c pixel chứa gi&aacute; trị hợp lệ (kh&ocirc;ng phải NoData) được sử dụng để tr&iacute;ch xuất gi&aacute; trị pixel từ tất cả c&aacute;c raster đầu v&agrave;o v&agrave; t&acirc;m của pixel được sử dụng cho c&aacute;c vị tr&iacute; điểm.
            </li>
            <li>Điểm&mdash;Gi&aacute; trị sẽ được lấy mẫu tại mỗi vị tr&iacute; điểm.
            </li>
            <li>V&ugrave;ng hoặc đường&mdash;Gi&aacute; trị sẽ được lấy mẫu tại t&acirc;m v&ugrave;ng hoặc đường. Nếu raster đầu v&agrave;o l&agrave; đa chiều, c&aacute;c gi&aacute; trị sẽ được tổng hợp dựa tr&ecirc;n loại  <b>Thống k&ecirc;</b>.
            </li>
        </ul>
        
    </p>
    <p>Raster đầu v&agrave;o được lấy mẫu trong tham chiếu v&agrave; độ ph&acirc;n giải kh&ocirc;ng gian ri&ecirc;ng của ch&uacute;ng. Nếu c&oacute; nhiều raster đầu v&agrave;o c&oacute; c&aacute;c tham chiếu kh&ocirc;ng gian kh&aacute;c nhau th&igrave; vị tr&iacute; đầu v&agrave;o được chiếu đến từng tham chiếu kh&ocirc;ng gian của từng raster m&agrave; từ đ&oacute; gi&aacute; trị được tr&iacute;ch xuất. M&ocirc;i trường ph&acirc;n t&iacute;ch được &aacute;p dụng cho c&aacute;c vị tr&iacute; đầu v&agrave;o, nhưng raster đầu v&agrave;o sẽ kh&ocirc;ng theo m&ocirc;i trường ph&acirc;n t&iacute;ch.
    </p>
    <p>C&aacute;c vị tr&iacute; tr&iacute;ch xuất gi&aacute; trị từ c&aacute;c &ocirc; NoData trong raster đầu v&agrave;o sẽ được cho một gi&aacute; trị &lt;null&gt; trong bảng đầu ra.
    </p>
    <p>Để thực hiện ph&acirc;n t&iacute;ch với đối tượng đa điểm, trước ti&ecirc;n h&atilde;y chuyển đổi ch&uacute;ng th&agrave;nh đối tượng đơn điểm trước khi sử dụng trong c&ocirc;ng cụ n&agrave;y.
    </p>
    <p>Tham chiếu kh&ocirc;ng gian của tọa độ x, y trong bảng mẫu đầu ra giống c&aacute;c đối tượng raster vị tr&iacute; hoặc điểm đầu v&agrave;o, trừ khi được chỉ định trong m&ocirc;i trường  <b>Hệ tọa độ Đầu ra</b>. Nếu tham chiếu kh&ocirc;ng gian của dữ liệu vị tr&iacute; đầu v&agrave;o l&agrave; kh&ocirc;ng x&aacute;c định, tham chiếu kh&ocirc;ng gian của tọa độ x, y cũng kh&ocirc;ng x&aacute;c định.
    </p>
    <p>Tham chiếu kh&ocirc;ng gian của loại đối tượng đầu ra giống c&aacute;c đối tượng raster vị tr&iacute; hoặc điểm đầu v&agrave;o, trừ khi được chỉ định trong m&ocirc;i trường  <b>Hệ tọa độ Đầu ra</b>.
    </p>
    <p>M&ocirc;i trường  <b>Hệ số xử l&yacute; song song</b> chỉ được hỗ trợ khi đầu v&agrave;o l&agrave; một raster đa chiều.
    </p>
    <p>Nếu chọn  <b>Sử dụng phạm vi bản đồ hiện tại</b>, th&igrave; c&aacute;c biến hoặc dải trong lớp nh&igrave;n thấy được trong phạm vi bản đồ hiện tại sẽ được ph&acirc;n t&iacute;ch. Nếu kh&ocirc;ng được chọn, c&aacute;c biến hoặc dải trong lớp đầy đủ sẽ được ph&acirc;n t&iacute;ch, ngay cả khi ch&uacute;ng nằm ngo&agrave;i phạm vi bản đồ hiện tại.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inRasters">
        <div><h2>Chọn (các) lớp hình ảnh để lấy mẫu</h2></div>
        <hr/>
        <div>
            <p>Một lớp h&igrave;nh ảnh duy nhất hoặc một danh s&aacute;ch c&aacute;c lớp h&igrave;nh ảnh c&oacute; gi&aacute; trị sẽ được lấy mẫu dựa tr&ecirc;n dữ liệu vị tr&iacute; đầu v&agrave;o.
            </p>
            <p>Để lấy mẫu tất cả c&aacute;c l&aacute;t cắt từ một lớp h&igrave;nh ảnh đa chiều th&igrave; n&oacute; phải l&agrave; raster đầu v&agrave;o duy nhất.
            </p>
        </div>
    </div>
    <div id="inLocationData">
        <div><h2>Chọn lớp vị trí</h2></div>
        <hr/>
        <div>
            <p>Dữ liệu x&aacute;c định vị tr&iacute; bạn muốn lấy mẫu.
            </p>
            <p>Dữ liệu vị tr&iacute; đầu v&agrave;o c&oacute; thể l&agrave; một raster hoặc một lớp đối tượng dạng điểm, đường hoặc v&ugrave;ng.
            </p>
        </div>
    </div>
    <div id="uniqueIdField">
        <div><h2>Chỉ định trường ID duy nhất</h2></div>
        <hr/>
        <div>
            <p>Một trường chứa một gi&aacute; trị kh&aacute;c nhau cho từng vị tr&iacute; hoặc đối tượng nằm trong raster vị tr&iacute; hoặc loại đối tượng đầu v&agrave;o.
            </p>
        </div>
    </div>
    <div id="acquisitionDefinition">
        <div><h2>Chỉ định thông tin thu thập dữ liệu vị trí (Tùy chọn)</h2></div>
        <hr/>
        <div>
            <p>Chỉ định thời gian, độ s&acirc;u hoặc dữ liệu thu thập kh&aacute;c được li&ecirc;n kết với c&aacute;c &ocirc; hoặc đối tượng vị tr&iacute;.
            </p>
            <p>Mỗi chiều c&oacute; ba t&ugrave;y chọn chỉ định th&ocirc;ng tin thu thập được li&ecirc;n kết với c&aacute;c &ocirc; hoặc đối tượng vị tr&iacute;:

                <ul>
                    <li> <b>Trường hoặc gi&aacute; trị đơn</b>&mdash;Khi chọn t&ugrave;y chọn n&agrave;y, cần chỉ định th&ocirc;ng tin sau:
                        <ul>
                            <li> <b>Trường hoặc gi&aacute; trị chiều</b>&mdash;chọn trường gi&aacute; trị chiều từ dữ liệu vị tr&iacute; hoặc nhập gi&aacute; trị chiều cụ thể.
                            </li>
                        </ul>
                        
                        

                    </li>
                    <li> <b>Trường hoặc gi&aacute; trị đơn c&oacute; c&aacute;c gi&aacute; trị tương đối</b>&mdash;Nếu chọn t&ugrave;y chọn n&agrave;y, cần chỉ định th&ocirc;ng tin sau c&ugrave;ng nhau để x&aacute;c định phạm vi t&iacute;nh to&aacute;n số liệu thống k&ecirc; cho c&aacute;c biến:
                        <ul>
                            <li> <b>Trường hoặc gi&aacute; trị chiều</b>&mdash;chọn trường gi&aacute; trị chiều từ dữ liệu vị tr&iacute;.
                            </li>
                            <li> <b>Gi&aacute; trị tương đối trước</b>&mdash;chỉ định một số kh&ocirc;ng &acirc;m d&ugrave;ng để trừ đi <b>Trường hoặc gi&aacute; trị chiều</b> nhằm x&aacute;c định điểm bắt đầu một phạm vi gi&aacute; trị chiều. Gi&aacute; trị n&agrave;y biểu thị số ng&agrave;y nếu chiều l&agrave; thời gian.
                            </li>
                            <li> <b>Gi&aacute; trị tương đối sau</b>&mdash;chỉ định một số kh&ocirc;ng &acirc;m d&ugrave;ng để cộng th&ecirc;m <b>Trường hoặc gi&aacute; trị chiều</b> nhằm x&aacute;c định điểm kết th&uacute;c một phạm vi gi&aacute; trị chiều. Gi&aacute; trị n&agrave;y biểu thị số ng&agrave;y nếu chiều l&agrave; thời gian.
                            </li>
                        </ul>
                        
                    </li>
                    <li> <b>Trường hoặc gi&aacute; trị bắt đầu v&agrave; kết th&uacute;c</b>&mdash;Nếu chọn t&ugrave;y chọn n&agrave;y, cần chỉ định th&ocirc;ng tin sau c&ugrave;ng nhau để x&aacute;c định phạm vi t&iacute;nh to&aacute;n số liệu thống k&ecirc; cho c&aacute;c biến:
                        <ul>
                            <li> <b>Trường hoặc gi&aacute; trị bắt đầu</b>&mdash;chọn trường gi&aacute; trị chiều từ dữ liệu vị tr&iacute; hoặc nhập gi&aacute; trị chiều cụ thể để x&aacute;c định điểm bắt đầu một phạm vi gi&aacute; trị chiều.
                            </li>
                            <li> <b>Trường hoặc gi&aacute; trị kết th&uacute;c</b>&mdash;chọn trường gi&aacute; trị chiều từ dữ liệu vị tr&iacute; hoặc nhập gi&aacute; trị chiều cụ thể để x&aacute;c định điểm kết th&uacute;c một phạm vi gi&aacute; trị chiều.
                            </li>
                        </ul>
                        
                        

                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="bufferDistance">
        <div><h2>Chỉ định trường hoặc giá trị khoảng cách đệm</h2></div>
        <hr/>
        <div>
            <p>Khoảng c&aacute;ch được chỉ định xung quanh c&aacute;c đối tượng dữ liệu vị tr&iacute;. Khoảng c&aacute;ch đệm được chỉ định trong c&aacute;c đơn vị tuyến t&iacute;nh của tham chiếu kh&ocirc;ng gian của đối tượng vị tr&iacute;. Nếu đối tượng sử dụng tham chiếu địa l&yacute;, đơn vị sẽ l&agrave; độ.
            </p>
            <p>Số liệu thống k&ecirc; sẽ được t&iacute;nh to&aacute;n trong v&ugrave;ng đệm n&agrave;y.
            </p>
        </div>
    </div>
    <div id="statisticsType">
        <div><h2>Chọn loại thống kê</h2></div>
        <hr/>
        <div>
            <p>C&aacute;c loại thống k&ecirc; được t&iacute;nh to&aacute;n.
            </p>
            <ul>
                <li> <b>Tối thiểu</b>&mdash;T&igrave;m gi&aacute; trị tối thiểu trong phạm vi chỉ định.
                </li>
                <li> <b>Tối đa</b>&mdash;T&igrave;m gi&aacute; trị tối đa trong phạm vi chỉ định.
                </li>
                <li> <b>B&igrave;nh qu&acirc;n</b>&mdash;T&igrave;m gi&aacute; trị b&igrave;nh qu&acirc;n trong phạm vi chỉ định.
                </li>
                <li> <b>Trung b&igrave;nh</b>&mdash;T&iacute;nh to&aacute;n trung b&igrave;nh cho phạm vi chỉ định.
                </li>
                <li> <b>Tổng</b>&mdash;T&iacute;nh tổng c&aacute;c biến trong phạm vi chỉ định.
                </li>
                <li> <b>Đa số</b>&mdash;T&igrave;m gi&aacute; trị xảy ra thường xuy&ecirc;n nhất.
                </li>
                <li> <b>Thiểu số</b>&mdash;T&igrave;m gi&aacute; trị &iacute;t xảy ra nhất.
                </li>
                <li> <b>Độ lệch chuẩn</b>&mdash;T&iacute;nh to&aacute;n độ lệch chuẩn.
                </li>
                <li> <b>Ph&acirc;n vị</b>&mdash;T&iacute;nh to&aacute;n tỷ lệ phần trăm x&aacute;c định trong phạm vi được chỉ định.
                </li>
            </ul>
            
        </div>
    </div>
    <div id="percentileValue">
        <div><h2>Giá trị phân vị</h2></div>
        <hr/>
        <div>
            <p>Tỷ lệ phần trăm cần t&iacute;nh khi th&ocirc;ng số  <b>Loại thống k&ecirc;</b> được thiết lập th&agrave;nh <b>Ph&acirc;n vị</b>.
            </p>
            <p>Gi&aacute; trị n&agrave;y c&oacute; thể nằm trong khoảng từ 0 đến 100. Gi&aacute; trị mặc định l&agrave; 90.
            </p>
        </div>
    </div>
    <div id="resamplingType">
        <div><h2>Chỉ định kỹ thuật lấy mẫu lại</h2></div>
        <hr/>
        <div>
            <p>Thuật to&aacute;n lấy mẫu lại được sử dụng khi lấy mẫu raster.
            </p>
            <ul>
                <li> <b>Gần nhất</b>&mdash;Vị tr&iacute; l&acirc;n cận gần nhất. Đ&acirc;y l&agrave; mặc định.
                </li>
                <li> <b>Song tuyến</b>&mdash;Nội suy song tuyến
                </li>
                <li> <b>Lập phương</b>&mdash;Nội suy xoắn bậc ba
                </li>
            </ul>
            
        </div>
    </div>
    <div id="layout">
        <div><h2>Chỉ định bố cục đầu ra</h2></div>
        <hr/>
        <div>
            <p>Chỉ định xem c&aacute;c gi&aacute; trị được lấy mẫu c&oacute; xuất hiện trong h&agrave;ng hoặc cột trong bảng đầu ra hay kh&ocirc;ng. T&ugrave;y chọn n&agrave;y chỉ &aacute;p dụng khi raster đa chiều đầu v&agrave;o chứa một biến v&agrave; một chiều v&agrave; mỗi l&aacute;t cắt l&agrave; một raster đơn dải.
            </p>
            <ul>
                <li> <b>Gi&aacute; trị được lấy mẫu xuất hiện trong h&agrave;ng</b>&mdash;C&aacute;c gi&aacute; trị được lấy mẫu xuất hiện trong c&aacute;c h&agrave;ng ri&ecirc;ng trong bảng đầu ra. Đ&acirc;y l&agrave; mặc định.
                </li>
                <li> <b>Gi&aacute; trị được lấy mẫu xuất hiện trong cột</b>&mdash;C&aacute;c gi&aacute; trị được lấy mẫu xuất hiện trong c&aacute;c cột ri&ecirc;ng trong bảng đầu ra. T&ugrave;y chọn n&agrave;y chỉ &aacute;p dụng khi raster đa chiều đầu v&agrave;o chứa một biến v&agrave; một chiều v&agrave; mỗi l&aacute;t cắt l&agrave; một raster band đơn.
                </li>
            </ul>
            
        </div>
    </div>
    <div id="outputType">
        <div><h2>Chỉ định loại đầu ra</h2></div>
        <hr/>
        <div>
            <p>Chỉ định xem c&oacute; tạo một loại đối tượng điểm với c&aacute;c gi&aacute; trị được lấy mẫu trong bảng của n&oacute; hay chỉ một bảng c&oacute; c&aacute;c gi&aacute; trị được lấy mẫu.
            </p>
            <ul>
                <li> <b>Bảng</b>&mdash;Tạo một bảng với c&aacute;c gi&aacute; trị được lấy mẫu. Đ&acirc;y l&agrave; mặc định.
                </li>
                <li> <b>Đối tượng</b>&mdash;Tạo một lớp đối tượng điểm với c&aacute;c gi&aacute; trị được lấy mẫu trong bảng của n&oacute;. Nếu đối tượng vị tr&iacute; đầu v&agrave;o l&agrave; dạng v&ugrave;ng hoặc đường th&igrave; mỗi điểm trong lớp đầu ra sẽ l&agrave; t&acirc;m của mỗi h&igrave;nh dạng của c&aacute;c đối tượng vị tr&iacute; đầu v&agrave;o.
                </li>
            </ul>
            
        </div>
    </div>
    <div id="outputName">
        <div><h2>Tên lớp kết quả</h2></div>
        <hr/>
        <div>
            <p>T&ecirc;n lớp sẽ được tạo trong mục  <b>Nội dung của T&ocirc;i</b> v&agrave; th&ecirc;m v&agrave;o bản đồ. T&ecirc;n mặc định dựa v&agrave;o t&ecirc;n c&ocirc;ng cụ v&agrave; t&ecirc;n lớp đầu v&agrave;o. Nếu lớp đ&atilde; tồn tại, bạn sẽ được y&ecirc;u cầu cung cấp t&ecirc;n kh&aacute;c.
            </p>
            <p>Bạn c&oacute; thể chỉ định t&ecirc;n của một thư mục trong  <b>Nội dung của t&ocirc;i</b> m&agrave; tại đ&oacute; kết quả sẽ được lưu bằng c&aacute;ch sử dụng hộp xổ xuống <b>Lưu kết quả v&agrave;o</b>.
            </p>
        </div>
    </div>
</div>
</html>
