<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="smallsize">
        <h2>Portāla analīzes darba vides iestatījumi</h2><p/>
        <h2></h2>
        <hr/>
    <p> Portāla analīzes darba vides iestatījumi Portal for ArcGIS un  ArcGIS Online. 
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="overwriteResult">
        <div><h2>Pārrakstīt rezultātu slāni</h2></div>
        <hr/>
        <div>
            
            <p>Opcija pārrakstīt eso&scaron;os slāņus.    Ja atzīmēsiet &scaron;o opciju, tad gadījumā, ja jūsu saturā jau eksistē slānis ar tādu pa&scaron;u nosaukumu, tas tiks pārrakstīts.
            </p>
            <p>
                <ul>
                    <li>Atzīmēta&nbsp;&mdash; ja jūsu saturā jau eksistē slānis ar tādu pa&scaron;u nosaukumu, tas tiks pārrakstīts. Izvadē tiks izmantota tāda pati koordinātu sistēma, kāda tiek izmantota ievadē.
                    </li>
                    <li>Neatzīmēta&nbsp;&mdash; ja norādītais rezultātu slāņa nosaukums jau eksistē, radīsies kļūda un rezultātu slānis būs jāpārdēvē, lai varētu izpildīt rīku. Tā ir noklusējuma vērtība.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="closeAnalysisWidget">
        <div><h2>Aizvērt analīzes logrīku pēc analīzes izpildes</h2></div>
        <hr/>
        <div>
            
            <p>Opcija paturēt analīzes dialoglodziņu atvērtu un aktivizētu, kamēr rīkā notiek apstrāde.     Izmantojot &scaron;o iestatījumu, varēsiet vienkār&scaron;i modificēt savus analīzes parametrus, kamēr iepriek&scaron;ējais analīzes uzdevums turpinās darboties.  Analīze ir iteratīvs process, tāpēc, ja rīka dialoglodziņ&scaron; paliks atvērts, jūs varēsiet vienkār&scaron;i mainīt parametrus un atkārtoti palaist analīzi.
            </p>
            <p>
                <ul>
                    <li>Atzīmēta&nbsp;&mdash; analīzes rīka logs tiks aizvērts un fokusā atkal būs satura tabula. Tā ir noklusējuma vērtība
                    </li>
                    <li>Neatzīmēta&nbsp;&mdash; analīzes rīka logs paliks atvērts un aktivizēts.   
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="storeAnalysisResults">
        <div><h2>Saglabāt analīzes rezultātus kā viesotu elementu slāņus</h2></div>
        <hr/>
        <div>
            
            <p>Iespēja norādīt, vai no jūsu analīzes izveidotais rezultātu slānis būs elementu kolekcija vai viesots elementu slānis. 
            </p>
            <p>
                <ul>
                    <li>Atzīmēta&nbsp;&mdash; jūsu analīzes rezultāti izveidos viesotu elementu slāni un jūsu saturā tiks izveidota vienība. Tā ir noklusējuma vērtība.
                    </li>
                    <li>Neatzīmēta&nbsp;&mdash; no jūsu analīzes rezultātiem tiks izveidots elementu kopums.     
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="outputCoordinateSystem">
        <div><h2>Izvades koordinātu sistēma</h2></div>
        <hr/>
        <div>
            <p>Rastra analīzes darba vides iestatījums, kas tiek izmantots, lai definētu rezultātu slāņa koordinātu sistēmu.    
            </p>
            <p>
                <ul>
                    <li> <b>Atbilsto&scaron;a ievadei</b>&nbsp;&mdash; jūsu analīzes rezultātā tiks izmantota tāda pati koordinātu sistēma kā ievadē. Tā ir noklusējuma vērtība.
                    </li>
                    <li> <b>Kā norādīta</b>&nbsp;&mdash; izvēlieties savas analīzes rezultātu koordinātu sistēmu.   Ja ir atzīmēta &scaron;ī opcija, noklik&scaron;ķiniet uz globusa ikonas, lai izvēlētos no zināmo koordinātu sistēmu saraksta, vai norādītajā lodziņā pievienojiet telpiskās atskaites WKID.
                    </li>
                    <li> <b>Slānis
&lt;nosaukums&gt;</b>&nbsp;&mdash; izvēlieties eksistējo&scaron;u slāni savā tīmekļa kartē. &Scaron;is slānis tiks izmantots, lai noteiktu jūsu analīzes rezultāta koordinātu sistēmu.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="processingCoordinateSystem">
        <div><h2>Notiek koordinātu sistēmas apstrāde</h2></div>
        <hr/>
        <div>
            <p>GeoAnalytics darba vides iestatījums, kas tiek izmantots, lai noteiktu, kādu koordinātu sistēmu jūsu analīze izmantos analīzes izpildes laikā.   
            </p>
            <p>GeoAnalytics ietvaros dažu analīžu veik&scaron;anai ir nepiecie&scaron;ams izpildīt apstrādi projicētā koordinātu sistēmā.   Jebkuram rīkam, kurā ir ieviesta datu nodalī&scaron;ana vai lineāras mērvienības, ir nepiecie&scaron;ama projicēta koordinātu sistēma. 
            </p>
            <p>
                <ul>
                    <li> <b>Atbilsto&scaron;a ievadei</b>&nbsp;&mdash; jūsu analīze tiks apstrādāta tāda pa&scaron;ā koordinātu sistēmā kā ievade. Tā ir noklusējuma vērtība.
                    </li>
                    <li> <b>Kā norādīta</b>&nbsp;&mdash; izvēlieties koordinātu sistēmu, kurā tiks apstrādāta jūsu analīze.   Ja ir atzīmēta &scaron;ī opcija, noklik&scaron;ķiniet uz globusa ikonas, lai izvēlētos no zināmo projicēto koordinātu sistēmu saraksta, vai norādītajā lodziņā pievienojiet telpiskās atskaites WKID.
                    </li>
                    <li> <b>Slānis
&lt;nosaukums&gt;</b>&nbsp;&mdash; izvēlieties eksistējo&scaron;u slāni no savas tīmekļa kartes.  Izvēlētā slāņa koordinātu sistēma tiks lietota, lai noteiktu koordinātu sistēmu, kas tiks izmantota, lai apstrādātu jūsu analīzi.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="processingExtent">
        <div><h2>Pārklājums</h2></div>
        <hr/>
        <div>
            <p>Darba vides iestatījums, kas tiek izmantots, lai noteiktu pārklājumu vai robežu, kas tiks izmantota, izpildot analīzi.  Analīzē tiks izmantoti visi ievades elementi, kas ir pilnībā iekļauti norādītajā pārklājumā vai to &scaron;ķērso.
            </p>
            <p>
                <ul>
                    <li> <b>Noklusējums</b>&nbsp;&mdash; izmanto rīka nodro&scaron;ināto pārklājumu.
                    </li>
                    <li> <b>Kā norādīts</b>&nbsp;&mdash; lai definētu pārklājumu, manuāli ievadiet koordinātas.
                    </li>
                    <li> <b>Slānis
&lt;nosaukums&gt;</b>&nbsp;&mdash; izvēlieties eksistējo&scaron;u slāni no savas tīmekļa kartes. Izvēlētā slāņa telpiskais pārklājums tiks lietots, lai noteiktu pārklājumu, kas tiks izmantots, lai apstrādātu jūsu analīzi. 
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="snapRaster">
        <div><h2>Fiksēt rastru</h2></div>
        <hr/>
        <div>
            <p>Ja rastra analīzes veik&scaron;anas laikā iestatīsiet darba vidi  <b>Fiksēt rastru</b>, izvades rastra slāņa pārklājums tiks līdzināts tā, lai saskanētu ar &scaron;ūnu līdzinājumu norādītajā <b>Fiksēt rastru</b> slānī.
            </p>
        </div>
    </div>
    <div id="cellSize">
        <div><h2>Šūnu izmērs</h2></div>
        <hr/>
        <div>
            <p>Rastra analīzes veik&scaron;anas laikā &scaron;ī darba vide iestata &scaron;ūnu izmēru vai iz&scaron;ķirtspēju, kas tiks izmantota, lai izveidotu izvades rastra slāni. Noklusējuma izvades iz&scaron;ķirtspēju nosaka ievades rastra slāņa lielākais &scaron;ūnas izmērs.
            </p>
            <p>
                <ul>
                    <li> <b>Ievažu minimālā vērtība</b>&nbsp;&mdash; izmantojiet visu ievades slāņu mazāko &scaron;ūnu izmēru.
                    </li>
                    <li> <b>Ievažu maksimālā vērtība</b>&nbsp;&mdash; izmantojiet visu ievades slāņu lielāko &scaron;ūnu izmēru. Tā ir noklusējuma vērtība.
                    </li>
                    <li> <b>Kā norādīts</b>&nbsp;&mdash; norādiet ciparu vērtību, lai iestatītu &scaron;ūnu izmēru. Ja izvēlaties &scaron;o iespēju, noklusējuma vērtība ir&nbsp;1,
                    </li>
                    <li> <b>Slānis &lt;nosaukums&gt;</b>&nbsp;&mdash; izvēlēta &scaron;ūnu izmēru iestatī&scaron;ana atbilsto&scaron;i izvēlētajam rastra slānim.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="mask">
        <div><h2>Maska</h2></div>
        <hr/>
        <div>
            <p> Veicot rastra analīzi, izmantojiet darba vidi <b>Maska</b>, lai norādītu slāni, kas tiks izmantots, lai definētu jūs interesējo&scaron;o platību.   Analīzes darbībās tiks ņemtas vērā tikai tās &scaron;ūnas, kas ietilpst analīzes maskā.
            </p>
            <ul>
                <li>Maska var būt rastrs vai elementu slānis.
                </li>
                <li>Ja analīzes maska ir rastrs, visas &scaron;ūnas, kam ir pie&scaron;ķirta vērtība, tiks ņemtas vērā, definējot masku. Maskas rastrā iekļautās &scaron;ūnas &ldquo;NoData&rdquo; tiks uzskatītas par ārpus maskas eso&scaron;ām un analīzes rezultātu slānī tiks iekļautas ar vērtību &ldquo;NoData&rdquo;. 
                </li>
                <li>Ja analīzes maska ir elementu slānis, tas tiks izpildes laikā iek&scaron;ēji konvertēts par rastru. &Scaron;ī iemesla dēļ ir ieteicams pārliecināties, lai analīzē būtu pareizi iestatīts
 <a href="MK:@MSITSTORE:C:\PROGRAM%20FILES%20(X86)\ARCGIS\DESKTOP10.5\HELP\ENVIRONMENTS.CHM::/001W0000001S000000.HTM" target="blank"></a> un <a href="MK:@MSITSTORE:C:\PROGRAM%20FILES%20(X86)\ARCGIS\DESKTOP10.5\HELP\ENVIRONMENTS.CHM::/001W0000000M000000.HTM" target="blank"></a> vērtības.
                </li>
            </ul>
             
        </div>
    </div>
    <div id="dataStore">
        <div><h2>ArcGIS datu krātuve</h2></div>
        <hr/>
        <div>
            <p>GeoAnalytic rezultāti tiek glabāti ArcGIS datu krātuvē un parādīts kā elementu slānis   Portal for ArcGIS. Vairumā gadījumu rezultāti ir jāglabā telpas un laika datu krātuvē. Tā ir noklusējuma vērtība. Iemesli, kādēļ rezultātus vajadzētu glabāt saistītajā datu krātuvē: 
                <ul>
                    <li>Lai rezultātus izmantotu starpportālu sadarbībā
                    </li>
                    <li>Lai aktivizētu sinhronizācijas iespējas ar rezultātiem
                    </li>
                </ul>
                
            </p>
            <p>Saistīto datu krātuvi nevajadzētu izmantot, ja ir sagaidāms, ka palielināsies jūsu GeoAnalytics rezultāti, un jūs vēlēsieties izmantot telpas un laika lielo datu krātuves iespējas, lai rīkotos ar lielu datu apjomu. 
            </p>
        </div>
    </div>
</div>
</html>
