<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Pārvērst rastru par elementu</h2><p/>
        <h2><img src="../images/GUID-7BBBCE28-2FDA-46B8-99D7-65F560AB2F2B-web.png" alt="Rīks Pārvērst rastru par elementu"></h2>
        <hr/>
    <p>&Scaron;is rīks pārvēr&scaron; rastru elementu datu kopā par punktiem, līnijām vai laukumiem.
    </p>
    <p>Parametrs  <b>Izvēlēties lauku</b> ļauj izvēlēties, kur&scaron; ievades rastra datu kopas atribūtu lauks kļūs par atribūtu izvades elementu klasē. &Scaron;is parametrs ir pieejams tikai veselu skaitļu rastriem, kuriem saistītajā tabulā ir papildu atribūti.
    </p>
    <p>Ievades rastram var būt jebkāds &scaron;ūnas izmērs.
    </p>
    <p>Veselu skaitļu rastrus var konvertēt par punktu, līniju vai laukumu elementiem. Taču peldo&scaron;ā komata skaitļu rastrus var konvertēt tikai par punktu elementiem.
    </p>
    <p>Ja ir atzīmēta opcija  <b>Izmantot pa&scaron;reizējo kartes pārklājumu</b>, tiks konvertētas tikai tās rastra &scaron;ūnas, kas ir redzamas pa&scaron;reizējā kartes skatā. Ja opcija nav atzīmēta, tiks konvertētas visas rastra slāņa &scaron;ūnas; arī tās, kas atrodas ārpus pa&scaron;reizējā kartes pārklājuma. Ņemiet to vērā, ja rastra slānis ir liels vai tam ir augsta iz&scaron;ķirtspēja.
    </p>
    <p>&Scaron;ī rīka lieto&scaron;anas gadījumi ietver:
        <ul>
            <li>Daudzstūra elementu izveide no zemes lietojuma klasifikācijas rastra.
                

            </li>
            <li>DEM identificētās upes var konvertēt par līniju elementiem.
                

            </li>
            <li>DEM var konvertēt par punktu elementiem, ko var izmantot darbplūsmā, kas nav balstīta uz rastru.
                

            </li>
        </ul>
        
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputLayer">
        <div><h2>Izvēlēties konvertējamo rastra slāni</h2></div>
        <hr/>
        <div>
            <p>Ievades rastra slānis, kas tiks konvertēts par elementu slāņiem.
            </p>
        </div>
    </div>
    <div id="field">
        <div><h2>Izvēlēties lauku</h2></div>
        <hr/>
        <div>
            <p>Lauks, kas norāda pārveido&scaron;anas vērtību.
            </p>
            <p>Tā var būt jebkāda vesela skaitļa vai teksta vērtība.
            </p>
            <p>Lauku ar peldo&scaron;ā komata skaitļa vērtību var izmantot tikai tad, ja izvade ir punktu datu kopa.
            </p>
            <p>Noklusējums ir lauks  <i>Value</i>, kurā ir ietverta vērtība katrā rastra &scaron;ūnā.
            </p>
        </div>
    </div>
    <div id="outputType">
        <div><h2>Izvēlieties izvades tipu</h2></div>
        <hr/>
        <div>
            <p>Norāda izvades veidu.
            </p>
            <ul>
                <li> <b>Punkts</b>&nbsp;&mdash; rastrs tiks pārvērsts par punktu datu kopu. Tā ir noklusējuma vērtība.
                    
 
                </li>
                <li> <b>Līnija</b>&nbsp;&mdash; rastrs tiks pārvērsts par līniju elementu datu kopu.
                    
 
                </li>
                <li> <b>Daudzstūris</b>&nbsp;&mdash; rastrs tiks pārvērsts par daudzstūra elementu datu kopu.
                    

                </li>
            </ul>
            
        </div>
    </div>
    <div id="simplifyLinesOrPolygons">
        <div><h2>Vienkāršot līnijas vai daudzstūrus</h2></div>
        <hr/>
        <div>
            <p>Norāda, vai līnijas vai daudzstūri tiks vienkār&scaron;oti&nbsp;(izlīdzināti). Līdzinā&scaron;ana tiek veikta &scaron;ādi: līnijā iekļauj minimālu segmentu skaitu, bet paliek iespējami tuvu sākotnējām rastra &scaron;ūnas malām.
            </p>
            <ul>
                <li>Atzīmēts&nbsp;&mdash; līnijas vai daudzstūra elementi tiks izlīdzināti, lai radītu vispārīgāku rezultātu. Tā ir noklusējuma vērtība.
                    

                </li>
                <li>Neatzīmēts&nbsp;&mdash; līnijas vai daudzstūra elementi ievēros rastra datu kopas &scaron;ūnu robežas.
                    

                </li>
            </ul>
            
            <p>&Scaron;is parametrs tiek atbalstīts tikai tad, ja izvades veids ir līnija vai daudzstūris.
            </p>
        </div>
    </div>
    <div id="createMultipartFeatures">
        <div><h2>Izveidot vairākdaļu elementus</h2></div>
        <hr/>
        <div>
            <p>Norāda, vai izvades daudzstūrus veidos vienas daļas vai vairāku daļu elementi.
            </p>
            <ul>
                <li>Atzīmēts&nbsp;&mdash; vairākdaļu elementi tiks izveidoti, pamatojoties uz daudzstūriem, kuriem ir tā pati vērtība.
                    

                </li>
                <li>Neatzīmēts&nbsp;&mdash; katram daudzstūrim tiks izveidoti atsevi&scaron;ķi&nbsp;(vienas daļas) elementi. Tā ir noklusējuma vērtība.
                    

                </li>
            </ul>
            
            <p>&Scaron;is parametrs tiek atbalstīts tikai tad, ja izvades veids ir daudzstūris.
            </p>
        </div>
    </div>
    <div id="maxVerticesPerFeature">
        <div><h2>Maksimālais virsotņu skaits daudzstūra elementā</h2></div>
        <hr/>
        <div>
            <p>Virsotņu skaita ierobežojumu izmanto, lai sadalītu daudzstūri mazākos daudzstūros.
            </p>
            <p>Ja &scaron;is lauks atstāts tuk&scaron;s, izvades daudzstūri netiks sadalīti. Tā ir noklusējuma vērtība.
            </p>
            <p>&Scaron;is parametrs tiek atbalstīts tikai tad, ja izvades veids ir daudzstūris.
            </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Rezultātu slāņa nosaukums</h2></div>
        <hr/>
        <div>
            
            <p>Slāņa nosaukums, kas tiks izveidots sadaļā  <b>Mans saturs</b> un pievienots kartei. Noklusējuma nosaukums ir balstīts uz rīka nosaukumu un ievades slāņa nosaukumu. Ja &scaron;āds slānis jau pastāv, jums tikts lūgts norādīt citu nosaukumu.
            </p>
            <p>Mapes nosaukumu var norādīt mapē  <b>Mans saturs</b> kur rezultāts tiks saglabāts, izmantojot nolaižamo lodziņu <b>Saglabāt rezultātu</b>.
            </p>
        </div>
    </div>
</div>
</html>
