<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Izveidot braukšanas laika laukumus</h2><p/>
        <h2><img src="../images/GUID-6F629A09-768D-4C04-88A4-AB941811ADE9-web.png" alt="Izveidot brauk&scaron;anas laika laukumus"></h2>
        <hr/>
    <p>Izveidot brauk&scaron;anas laika laukumus izveido teritorijas, kuras var sasniegt noteiktā brauk&scaron;anas laikā, brauk&scaron;anas attālumā, ie&scaron;anas attālumā u.tml. Gar ceļiem vai takām tiek mērīts no viena vai vairākiem punktiem (līdz 1000), lai izveidotu slāni, kas var palīdzēt atbildēt uz sekojo&scaron;iem jautājumiem:
        <ul>
            <li>Kur es varu nokļūt no pa&scaron;reizējās atra&scaron;anās vietas 30 minū&scaron;u brauk&scaron;anas laikā?
            </li>
            <li>Kur es varu nokļūt, izbraucot plkst. 05:30:00 sastrēgumu laikā, no pa&scaron;reizējās atra&scaron;anās vietas 30 minū&scaron;u brauk&scaron;anas laikā?
            </li>
            <li>Kas atrodas divu kilometru gājiena attālumā no manas viesnīcas?
            </li>
            <li>Kuras pilsētas teritorijas ugunsdzēsēju departaments var sasniegt 5 minū&scaron;u laikā? 
            </li>
            <li>Kā uzlabotos ugunsdzēsēju brigāžu pārklājuma zona, izbūvējot jaunu ugunsdzēsēju depo &scaron;eit?
            </li>
            <li>Kādas tirdzniecības teritorijas nosedz mans bizness?
            </li>
        </ul>
        
    </p>
    <p>Jūs iespējams spēsiet atbildēt uz saviem jautājumiem tikai vizualizējot izvades teritorijas. Alternatīvi, jūs varat veikt tālāku telpisko analīzi, izmantojot izejas teritorijas. Piemēram, izmantojot Apkopot punktus, lietojot brauk&scaron;anas laika teritorijas ar demogrāfiskajiem datiem, var palīdzēt noteikt, kura ir labākā potenciālā veikala atra&scaron;anās vieta, kas varētu nodro&scaron;ināt lielāko klientu bāzi Jūsu biznesam. 
    </p>
    <p>
        <table>
        <tr><td colspan="3"><hr size="1" noshade="noshade"></td></tr>
        <tr><td valign="baseline"><img src="../images/tip.png"></td><td valign="baseline"><h2>Tip:&ensp;</h2></td>
        <td valign="baseline">
            <p>Lai izveidotu teritorijas, mērot lineāro distanci, nevis mērot gar ceļiem, izmantojiet Izveidot buferus.
            </p>
        </td></tr>
        <tr><td colspan="3"><hr size="1" noshade="noshade"></td></tr>
        </table>
    </p>
    <p>Ja atzīmēsiet izvēles rūtiņu  <b>Izmantot pa&scaron;reizējo kartes pārklājumu</b>, tikai pa&scaron;reizējā kartes pārklājumā redzamie elementi tiks izmantoti, lai izveidotu teritorijas, kuru pamatā ir brauk&scaron;anas laiks vai attālums. Ja nav iezīmēts, tad tiks izmantoti visi ievades slāņa elementi, pat ja tie atrodas ārpus pa&scaron;reizējā kartes pārklājuma.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputLayer">
        <div><h2>Izvēlieties punktu slāni, lai aprēķinātu braukšanas laikus tuvumā esošajām teritorijām</h2></div>
        <hr/>
        <div>
            <p>Punktu elementi, ap kuriem tiks aprēķināta teritorija. Varat izvēlēties pārvieto&scaron;anās veidu (vieglā automa&scaron;īna, smagā automa&scaron;īna vai ie&scaron;ana kājām) un mērījumu (laiks vai attālums).
            </p>
            <p class="OnlineOnly">Papildus slāņa izvēlei no kartes nolaižamā saraksta apak&scaron;ā varat atlasīt  <b>Izvēlēties Living Atlas analīzes slāni</b> vai <b>Izvēlēties analīzes slāni</b>. Tādējādi tiek atvērta galerija, kurā apskatāmi dažādi analīzes slāņi. 
            </p>
            <p>Rīks atbalsta līdz 1000&nbsp;elementiem ievades slānī.

            </p>
        </div>
    </div>
    <div id="MeasurementMethod">
        <div><h2>Izmērīt</h2></div>
        <hr/>
        <div>
            <p>Izvēlieties pārvieto&scaron;anās veidu (vieglā automa&scaron;īna, smagā automa&scaron;īna vai ie&scaron;ana kājām) un mērījumu (laiks vai attālums). Pieejamos ceļo&scaron;anas veidus nosaka jūsu organizācijas administrators.   Pēc pārvieto&scaron;anās veida un mērījuma izvēles ievadiet ilgumu vai attālumu līdz  5 stundām (300 minūtēm) vai  300 jūdzēm (482.80 kilometriem). 
            </p>
            <p>Ja izvēlaties iespēju  <b>Brauk&scaron;anas laiks</b>, <b>Brauk&scaron;anas laiks ārpus pilsētas</b> vai <b>Brauk&scaron;anas laiks ar kravas automa&scaron;īnu</b>, tiek piedāvātas brauk&scaron;anas laika mērī&scaron;anas opcijas.
                <ul>
                    <li>
                        <p>Noņemiet atzīmi no izvēles rūtiņas  <b>Lietot satiksmi</b>, lai izveidotu brauk&scaron;anas laika teritorijas, balstoties uz fiksētu ātrumu. &Scaron;ī izvēlne jāizvēlas, ja jūs vēlaties iegūt vispārēju brauk&scaron;anas laika teritoriju, kas nav aprēķināts izmantojot mainīgus satiksmes apstākļus noteiktam izbrauk&scaron;anas laikam.
                        </p>
                    </li>
                    <li>
                        <p>Atzīmējiet  <b>Lietot satiksmi</b>, lai izveidotu brauk&scaron;anas laika teritorijas, balstoties uz noteiktu izbrauk&scaron;anas laiku un mainīgiem satiksmes apstākļiem. Arī, izvēloties <b>Dzīva satiksme</b> opciju, izbrauk&scaron;anas laiks no ievades punktiem ir iestatīts uz pa&scaron;reizējo laiku, un pa&scaron;reizējās un prognozētās satiksmes ātrums ir atsauce uz sensoriem un ir pamats, lai izveidotu brauk&scaron;anas laika teritorijas. Prognozētais satiksmes ātrums tiek aprēķināts, atsaucoties uz dzīvās satiksmes ātrumu, vēsturisko ātrumu un pa&scaron;reizējiem notikumiem, piem., laika apstākļiem. Satiksmes ātrums tiek prognozēts 12 stundām, lai jūs varētu pārvietot slīdni, lai iestatītu izbrauk&scaron;anas laiku līdz pat 12 stundām.
                        </p>
                        <p>Izmantojiet &scaron;os dzīvās satiksmes iestatījumus, lai atrastu, kuras teritorijas var tikt sasniegtas izbraucot tagad, izbraucot pēc stundas utt.
                        </p>
                    </li>
                    <li>
                        <p>Iezīmējot  <b>Lietot satiksmi</b> un izvēloties <b>Satiksmi ar tipiskiem nosacījumiem </b> dienai un laikam, rīks izveido brauk&scaron;anas laika teritorijas, balsotties uz vēsturiskiem vidējiem ātrumiem, katram piecminū&scaron;u intervālam nedēļā. &Scaron;ie rezultāti ietver satiksmi, bet neietver pa&scaron;reizējās satiksmes nosacījumus un notikumus, kas var ievērojami at&scaron;ķirties no normas.
                        </p>
                        <p>Jūs varat izmantot &scaron;os vēsturiskos satiksmes uzstādījumus, lai pajautātu, piemēram, &quot;Kādas teritorijas es varu sasniegt izbraucot tre&scaron;dien plkst. 11:30?&quot; 
                        </p>
                        <p>Laiks, ko jūs iestatāt, attiecas uz laika zonu, kurā atrodas jūsu ievades punkti. Tātad, ja jūs norādāt laiku 8:00 un ir divi sākumpunkti, viens Ņujorkā un otrs Losandželosā, brauk&scaron;anas laika teritorijas tiks ģenerētas laikam attiecīgi 8:00 pēc Austrumu laika un 08:00 pēc Klusā okeāna laika.
                        </p>
                    </li>
                </ul>
                
            </p>
            <p>Ņemiet vērā, ka transportlīdzeklis dodas virzienā prom no punkta, laiks ir pagājis un satiksmes apstākļi mainās. Brauk&scaron;anas laika teritoriju rīks rēķina &scaron;īs variācijas, kad jūs izvēlaties  <b>Brauk&scaron;anas laiks</b> un atzīmējat <b>Lietot satiksmi</b>; tomēr, ne visi reģioni atbalsta satiksmi. Noklik&scaron;ķiniet uz rīka saites <b>Skatīt pieejamību</b>, lai noskaidrotu, vai tas tiek piedāvāts jūsu izpētes teritorijā.
            </p>
            <p>Iespēja  <b>Brauk&scaron;anas laiks ar kravas automa&scaron;īnu</b> var izmantot dinamisku brauk&scaron;anas ātrumu atkarībā no satiksmes (nepārsniedzot likumā noteikto kravas automa&scaron;īnas brauk&scaron;anas ātruma ierobežojumu). Piemēram, ja dinamiskais ātrums brauk&scaron;anai pa ielu atkarībā no reāllaika satiksmes ir 65&nbsp;jūdzes stundā, bet kravas automa&scaron;īnas brauk&scaron;anas ātruma ierobežojums attiecīgajā ielā ir 55&nbsp;jūdzes stundā, brauciena aprēķinā attiecīgajā ielā tiks izmantots ātrums 55&nbsp;jūdzes stundā.
            </p>
            <p> <b>Ie&scaron;anas laiks</b> un <b>Ie&scaron;anas attālums</b> izmanto fiksētu ātrumu 5 kilometri stundā (3.1 jūdzes stundā) un ievēro gājēju ceļus, kā arī īpa&scaron;i paredzētas ielas (ignorējot likumus, kas ietekmē autotransportu, piemēram, vienvirziena ielas). </p>
            <p>Iespēja  <b>Attālums, braucot ar kravas automa&scaron;īnu</b> izmanto fiksētu brauk&scaron;anas ātrumu un ievēro noteikumus, kas attiecas uz kravas automa&scaron;īnām, savukārt <b>Brauk&scaron;anas attālums</b> un <b>Brauk&scaron;anas attālums ārpus pilsētas</b> izmanto fiksētu brauk&scaron;anas ātrumu un ievēro noteikumus, kas attiecas uz automobiļiem, piemēram, automa&scaron;īnām.
            </p> 
        </div>
    </div>
    <div id="DissolveType">
        <div><h2>Laukumi no dažādiem punktiem</h2></div>
        <hr/>
        <div>
            <p>Izvēlieties kā koplietotās teritorijas no dažādiem ievades punktiem tiek apstrādātas, kad tās sasniedz viena otru. Tie var:
                <ul>
                    <li> <b>Pārklāties</b>&mdash;Teritorijas no dažādiem ievades punktiem var pārklāt to pa&scaron;u ceļu. Tas ir noderīgi, kad jums jāzina visi ievades punkti, kas var sasniegt noteiktu novietojumu dotajā laikā un attālumā.
                    </li>
                    <li> <b>Iz&scaron;ķīdināt</b>&mdash;Visi laukumi tiek apvienoti vienā un ne vairāk kā viens laukums var pārklāt noteiktu novietojumu. Tas ir noderīgi, jo viss, kas jums jāzina, ir- ka teritoriju var sasniegt dotajā laikā vai attālumā, bet nav nepiecie&scaron;ams zināt, tie&scaron;i kuri ievades punkti var sasniegt ievadīto novietojumu.
                    </li>
                    <li> <b>Sa&scaron;ķelt</b>&mdash;laukumi no dažādiem ievades novietojumiem, kas daļēji pārklātos ir sa&scaron;ķelti vidū, tādejādi tā vietā tie robežojas viens ar otru. &Scaron;is ir noderīgi, kad jūs vēlaties redzēt kuras teritorijas atrodas dotā laika vai attāluma robežās no ievades punkta, un ,tajā pat laikā nosaka, kuri ievades punkti atrodas tuvāk &scaron;ai teritorijai.
                    </li>
                </ul>
                
            </p>
        </div>
    </div>
    <div id="OutputLayer">
        <div><h2>Rezultāta slāņa nosaukums</h2></div>
        <hr/>
        <div>
            <p>Tas ir slāņa nosaukums, kas tiks izveidots lapā  <b>Mans saturs</b> un pievienots kartei. Noklusējuma nosaukums ir balstīts uz rīka nosaukumu un ievades slāņa nosaukumu. Ja slānis jau pastāv, jums tiks lūgts norādīt citu nosaukumu.
            </p>
            <p>Lietojot iespēju  <b>Saglabāt rezultātu</b> nolaižamajā sarakstlodziņā, jūs varat norādīt mapes nosaukumu sadaļā <b>Mans saturs</b>, kur tiks saglabāts rezultāts.
            </p>
        </div>
    </div>
</div>
</html>
