<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Rekonstruēt maršrutus</h2><p/>
        <h2><img src="../images/GUID-80807DB7-0CA7-4FD8-9702-B4486285D4FC-web.png" alt="Rekonstruēt mar&scaron;rutus"></h2>
        <hr/>
    <p>&Scaron;is rīks darbojas ar laika iespējotu punktu vai laukumu elementu slāni, kas apzīmē laika  <code>momentu</code>. Tas vispirms nosaka, kuri elementi pieder mar&scaron;rutam, izmantojot identifikatoru. Izmantojot laiku katrā atra&scaron;anās vietā, mar&scaron;ruti tiek sakārtoti secīgi un pārveidoti par līniju vai laukumu, kas apzīmē kustības ceļu laika gaitā. Pēc izvēles, ievades laukam var tikt pielietota buferis, kas katrā atra&scaron;anās vietā izveidos laukumu. &Scaron;ie buferzonu punkti (vai laukumu ievades) tiek savienoti secīgi, lai izveidotu mar&scaron;rutu kā laukumu, kura platums pārstāv intereses atribūtu. Rezultātu mar&scaron;rutiem ir sākuma un beigu laiks, kas temporāli apzīmē pirmo un pēdējo noteikta mar&scaron;ruta elementu. Kad mar&scaron;ruti tiek izveidoti, tiek aprēķināta ievades elementu statistika un pie&scaron;ķirta izvades mar&scaron;rutam. Visvienkār&scaron;ākā statistika ir punktu skaits teritorijā, bet iespējams aprēķināt arī citu statistiku.
    </p>
    <p>Laika iespējotu slāņu elementus var apzīmēt vienā no diviem veidiem:
        <ul>
            <li>Tūlītējs. Atsevi&scaron;ķs laika moments.
            </li>
            <li>Intervāls. Sākuma un beigu laiks.
            </li>
        </ul>
        
    </p>
    <p>Piemēram, pieņemsim, ka jums ir ik pēc 10&nbsp;minūtēm veikti GPS mērījumi par viesuļvētru. Katrs GPS mērījums reģistrē viesuļvētras nosaukumu, atra&scaron;anās vietu, ieraksta laiku un vēja ātrumu. Ar &scaron;o informāciju varat izveidot katras viesuļvētras mar&scaron;rutus, izmantojot nosaukumu mar&scaron;ruta identifikācijai, un katrai viesuļvētrai tiek ģenerēti mar&scaron;ruti. Turklāt, varat aprēķināt statistiku, piemēram, katras viesuļvētras vidējo, maksimālo un minimālo vēja ātrumu, kā arī katra mar&scaron;ruta mērījumu skaitu.
    </p>
    <p>Izmantojot &scaron;o pa&scaron;u piemēru, jūs varat izveidot mar&scaron;rutu buferzonas pēc vēja ātruma. Tādējādi katra mērījuma buferzona tiek izveidota pēc vēja ātruma lauka &scaron;ajā atra&scaron;anās vietā, kā savienos buferzonas, izveidojot laukumu, kas apzīmē mar&scaron;ruta ceļu, kā arī vēja ātruma izmaiņas viesuļvētras gaitā.   
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inputLayer">
        <div><h2>Izvēlēties elementus, no kuriem rekonstruēt maršrutus</h2></div>
        <hr/>
        <div>
            <p>Punktu vai laukumu slānis, kas tiks rekonstruēts mar&scaron;rutos. Ievades slānim ir jābūt aktivizētam laikam ar elementiem, kas apzīmē laika momentu. Slānim ir jābūt plānotajā koordinātu sistēmā, vai, ja tiek lietota buferzona, apstrādes telpiskā atskaite ir jāiestata uz plānoto koordinātu sistēmu, izmantojot  <b>Analīzes darba vidi</b>.
            </p>
            <p>Papildus slāņa izvēlei kartē varat izvēlēties  <b>Pārlūkot slāņus</b> nolaižamā saraksta apak&scaron;ā, lai saturā atrastu Big Data koplietojuma datu kopu vai elementu slāni.
            </p>
        </div>
    </div>
    <div id="trackFields">
        <div><h2>Izveidot vienu vai vairākus laukus, lai identificētu maršrutus</h2></div>
        <hr/>
        <div>
            <p>Lauki, kas apzīmē mar&scaron;rutu identifikatoru. 
            </p>
            <p>Piemēram, ja rekonstruējat viesuļvētru mar&scaron;rutus, varat izmantot viesuļvētras nosaukumu kā mar&scaron;ruta lauku.
            </p>
        </div>
    </div>
    <div id="method">
        <div><h2>Izvēlēties metodi, kas tiek izmantota maršrutu rekonstruēšanai</h2></div>
        <hr/>
        <div>
            <p>Metode, kas tiek izmantota, lai savienotu mar&scaron;rutus un izveidotu buferzonu (ja pieejama).  <b>Plaknes</b> metode aprēķina rezultātus ātrāk, bet neaptīs mar&scaron;rutus ap starptautisko datuma maiņas līniju, kā arī neierēķinās zemes faktisko zemes formu, veidojot buferzonu. <b>Ģeodēziskā</b> metode, ja nepiecie&scaron;ams, aplieks mar&scaron;rutus ap datuma maiņas līniju un izveidos ģeodēzisko buferzonu, lai ierēķinātu zemes formu.
            </p>
        </div>
    </div>
    <div id="bufferField">
        <div><h2>Izvēlēties izteiksmi, pēc kuras izveidot ievades elementu buferzonu (pēc izvēles)</h2></div>
        <hr/>
        <div>
            <p>Vienādojums, kas tiek izmantots, lai aprēķinātu buferzonas attālumu ap ievades elementiem. &Scaron;o vienādojumu var ģenerēt, izmantojot buferzonas kalkulatoru. Ir pieejamas pamata darbības, piemēram, saskaitī&scaron;ana, atņem&scaron;ana, reizinā&scaron;ana un dalī&scaron;ana. Vērtības tiek aprēķinātas, izmantojot analīzes koordinātu sistēmu. Slānim ir jābūt plānotajā koordinātu sistēmā, vai, ja tiek lietota buferzona, apstrādes telpiskā atskaite ir jāiestata uz plānoto koordinātu sistēmu, izmantojot  <b>Analīzes darba vidi</b>.
            </p>
            <p>Vienādojums  <code>$feature.windspeed * 1000</code> lietos buferzonu&nbsp;1000, kas reizināta ar lauka <i>vēja ātrums</i> vērtību. Buferzonas kalkulatorā var izmantot vairāk nekā vienu lauku.
            </p>
        </div>
    </div>
    <div id="timeSplit">
        <div><h2>Izvēlēties laiku, pēc kura sadalīt maršrutus (pēc izvēles)</h2></div>
        <hr/>
        <div>
            <p>Mar&scaron;rutu sadalei izmantotais laiks. Ja ilgums starp ievades punktiem vai laukumiem ir lielāks par laika dalījumu, tie tiks sadalīti atsevi&scaron;ķos mar&scaron;rutos.
            </p>
            <p>Ja norādāt laika sadalījumu un attāluma sadalījumu, mar&scaron;ruti tiks sadalīti, kad tiks panākta atbilstība vienam vai abiem stāvokļiem. 
            </p>
            <p>Iedomājieties, ka ir pieejami punktu elementi, kas apzīmē lidma&scaron;īnu reisus, kuru mar&scaron;ruta lauks ir lidma&scaron;īnas ID. &Scaron;ī lidma&scaron;īna var veikt vairākus lidojumus, kas tiks apzīmēti kā viens mar&scaron;ruts. Ja zināt, ka starp lidojumiem ir 1&nbsp;stundas pārtraukums, varat izmantot  <code>1&nbsp;stundu</code> kā mar&scaron;rutu dalījumu, un katrs lidojums tiek sadalīts atsevi&scaron;ķā mar&scaron;rutā.
            </p>
        </div>
    </div>
    <div id="distanceSplit">
        <div><h2>Izvēlēties attālumu, pēc kura sadalīt maršrutus (pēc izvēles)</h2></div>
        <hr/>
        <div>
            <p> Mar&scaron;rutu sadalei izmantotais attālums. Ja attālums starp ievades punktiem vai daudzstūriem ir platāks par attāluma dalījumu, tie tiks sadalīti atsevi&scaron;ķos mar&scaron;rutos.
            </p>
            <p>Ja norādāt laika sadalījumu un attāluma sadalījumu, mar&scaron;ruti tiks sadalīti, kad tiks panākta atbilstība vienam vai abiem stāvokļiem. 
            </p>
        </div>
    </div>
    <div id="summaryFields">
        <div><h2>Pievienot statistiku (pēc izvēles)</h2></div>
        <hr/>
        <div>
            <p> Varat aprēķināt apkopoto elementu statistiku. Ciparu laukos iespējams aprēķināt &scaron;ādas vērtības:
                <ul>
                    <li>Skaits&nbsp;&mdash; aprēķina vērtību, kas nav nulle, skaitu. To var lietot ciparu laukiem un virknēm. [nulle, 0, 2] skaits ir&nbsp;2.
                    </li>
                    <li>Summa&nbsp;&mdash; katra lauka skaitlisko vērtību summa. [nulle, nulle, 3] summa ir&nbsp;3.
                    </li>
                    <li>Vidējais&nbsp;&mdash; vidējā skaitliskā vērtība. [0, 2, nulle] vidējā vērtība ir&nbsp;1.
                    </li>
                    <li>Minimums&nbsp;&mdash; ciparu lauka minimālā vērtība. [0, 2, nulle] minimums ir&nbsp;0. 
                    </li>
                    <li>Maksimums&nbsp;&mdash; ciparu lauka maksimālā vērtība. [0, 2, nulle] maksimums ir&nbsp;2.
                    </li>
                    <li>Diapazons&nbsp;&mdash; ciparu lauka diapazons. To aprēķina, minimālo vērtību atņemot no maksimālās vērtības. [0, nulle, 1] diapazons ir&nbsp;1. [nulle, 4] diapazons ir&nbsp;0.
                    </li>
                    <li>Novirze&nbsp;&mdash; mar&scaron;ruta ciparu lauka novirze. [1] novirze ir nulle. [nulle, 1, 1, 1] novirze ir&nbsp;1.
                    </li>
                    <li>Standarta novirze&nbsp;&mdash; ciparu lauka standarta novirze. [1] standarta novirze ir nulle. [nulle, 1, 1, 1] standarta novirze ir&nbsp;1. 
                    </li>
                </ul>
                
            </p>
            <p>Virkņu laukos iespējams aprēķināt &scaron;ādas vērtības:
                <ul>
                    <li>Skaits&nbsp;&mdash; virkņu, kas nav nulle, skaits.
                    </li>
                    <li>Jebkāda. &Scaron;ī statistika ir nejau&scaron;s virknes vērtības paraugs norādītajā laukā.
                    </li>
                </ul>
                Jebkāda statistika tiek aprēķināta no vērtībām, kas nav nulle. Rezultātu slānī ir ietverts jauns lauks par katru aprēķināto statistiku. Jebkurus statistikas datus var pievienot, izvēloties atribūtu un statistikas datus. 
            </p>
        </div>
    </div>
    <div id="dataStore">
        <div><h2>Izvēlieties ArcGIS Data Store, lai saglabātu rezultātus</h2></div>
        <hr/>
        <div>
            <p>GeoAnalytics rezultāti ir krātuves ArcGIS datu krātuvei, kas tiek parādīts kā elementu slānis   Portal for ArcGIS. Vairumā gadījumu rezultāti jāglabā laika un telpas datu krātuvē, kas tiek darīts pēc noklusējuma. Dažos gadījumos noderīga opcija ir saglabāt rezultātus saistītajā datu krātuvē. Iemesli rezultātu glabā&scaron;anai saistītajā datu krātuvē: 
                <ul>
                    <li>Lai izmantotu rezultātus portālu sadarbībā ar portālu.
                    </li>
                    <li>Lai aktivizētu sinhronizācijas iespējas ar rezultātiem.
                    </li>
                </ul>
                
            </p>
            <p>Saistīto datu krātuvi nevajadzētu izmantot tad, ja ir sagaidāms, ka palielināsies GeoAnalytics rezultātu apjoms, kā arī ir vajadzīgs izmantot telpas un laika big data krātuves iespējas, lai rīkotos ar lielu datu apjomu. 
            </p>
        </div>
    </div>
    <div id="outputName">
        <div><h2>Rezultātu slāņa nosaukums</h2></div>
        <hr/>
        <div>
            <p> &Scaron;is ir slāņa nosaukums, kas tiks izveidots sadaļā <b>Mans Saturs</b> un pievienots kartei. Noklusējuma nosaukums ir balstīts uz rīka nosaukumu un ievades slāņa nosaukumu. Ja slānis jau pastāv, rīks nedarbosies.
            </p>
            <p>Lietojot  <b>Saglabāt rezultātus</b> nolaižamajā sarakstlodziņā, jūs varat norādīt nosaukumu mapē <b>Mans saturs</b>, kur tiks saglabāti rezultāti.
            </p>
        </div>
    </div>
</div>
</html>
