<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Paraugs</h2><p/>
        <h2><img src="../images/GUID-3950CCA3-C1D0-493F-A33D-93673443ADD2-web.png" alt="Paraugs"></h2>
        <hr/>
    <p>&Scaron;is rīks izveido tabulu vai punktu elementu klasi, kas parāda rastra vai rastru kopas &scaron;ūnu vērtības norādītajām atra&scaron;anās vietām. Atra&scaron;anās vietas norāda rastra &scaron;ūnas, daudzstūra elementi, lauztas līnijas elementi vai punktu kopas.
    </p>
    <p>Daži no &scaron;ī rīka pielietojumu piemēriem ietver:
        <ul>
            <li> Izgūt &scaron;ūnu torņa atra&scaron;anās vietas atribūtus no vairākiem rastriem, piemēram, zemes izmanto&scaron;ana, augsnes veids, augstums un attālums līdz ceļam.
            </li>
            <li>Izgūt augsnes temperatūru dažādos dziļumos norādītajam punktu kopumam.
            </li>
            <li>Izmantojot 30 gadu laikā iegūtos jūras virsmas temperatūras mēne&scaron;a datus, apkopot temperatūras datus dzīvnieku atra&scaron;anās vietās vai mājvietu teritorijās par noteiktu laiku, kurā tika novērota dzīvnieku suga.
            </li>
        </ul>
        
    </p>
    <p>Ja ir atzīmēta iespēja  <b>Izmantot pa&scaron;reizējo kartes pārklājumu</b>, tiks analizēti tikai tā slāņa mainīgie vai joslas, kas ir redzamas pa&scaron;reizējā kartes pārklājumā. Ja &scaron;ī iespēja nav atzīmēta, tiks analizēti pilna slāņa mainīgie vai joslas, pat ja tās atrodas ārpus pa&scaron;reizējā kartes pārklājuma.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="inRasters">
        <div><h2>Izvēlēties iztveramos attēlu slāņus</h2></div>
        <hr/>
        <div>
            <p>Atsevi&scaron;ķs attēls vai attēlu saraksts, kuru vērtības tiks iztvertas, ņemot vērā ievades atra&scaron;anās vietas datus. 
            </p>
            <p>Lai no daudzdimensiju attēlu slāņa izgūtu paraugus no visiem sektoriem, tam jābūt vienīgajam ievades rastram.
            </p>
        </div>
    </div>
    <div id="inLocationData">
        <div><h2>Izvēlēties atrašanās vietas slāni</h2></div>
        <hr/>
        <div>
            <p>Dati, kas norāda izveramās atra&scaron;anās vietas.
            </p>
            <p>Ievades atra&scaron;anās vietas dati var būt rastra punkta, lauztas līnijas vai daudzstūra elementu klase.
            </p>
        </div>
    </div>
    <div id="uniqueIdField">
        <div><h2>Norādīt unikālā ID lauku</h2></div>
        <hr/>
        <div>
            <p>Lauks, kurā ir at&scaron;ķirīga vērtība katrai atra&scaron;anās vietai vai elementam ievades atra&scaron;anās vietu rastrā vai elementu klasē.
            </p>
        </div>
    </div>
    <div id="acquisitionDefinition">
        <div><h2>Norādīt atrašanās vietas datu ieguves informāciju (papildiespēja)</h2></div>
        <hr/>
        <div>
            <p>Norādiet laiku, dziļumu vai citus ieguves datus, kas saistīti ar atra&scaron;anās vietu &scaron;ūnām vai elementiem.
            </p>
            <p>Katrai dimensijai ir trīs iespējas, lai norādītu ieguves informāciju, kas saistīta ar atra&scaron;anās vietu &scaron;ūnām vai elementiem.
            </p>
            <ul>
                <li> <b>Viens lauks vai vērtība</b>&nbsp;&mdash; atlasot &scaron;o opciju, jānorāda &scaron;āda informācija:
                    <ul>
                        <li> <b>Dimensijas lauks vai vērtība</b>&nbsp;&mdash; no atra&scaron;anās vietas datiem atlasiet dimensijas vērtību lauku vai ievadiet konkrētu dimensijas vērtību.
                        </li>
                    </ul>
                    
                    

                </li>
                <li> <b>Viens lauks vai vērtība ar saistītajām vērtībām</b>&nbsp;&mdash; atlasot &scaron;o opciju, jānorāda zemāk minētā informācija, lai noteiktu diapazonu, kādā tiks aprēķināta mainīgo statistika:
                    <ul>
                        <li> <b>Dimensijas lauks vai vērtība</b>&nbsp;&mdash; no atra&scaron;anās vietas datiem atlasiet dimensijas vērtības.
                        </li>
                        <li> <b>Saistītā vērtība pirms</b>&nbsp;&mdash; norādiet skaitli, kas nav negatīvs, lai to atņemtu no parametra <b>Dimensijas lauks vai vērtība</b> un norādītu dimensijas vērtību diapazona sākumu. &Scaron;ī vērtība ir dienu skaits, ja dimensija ir laiks.
                        </li>
                        <li> <b>Saistītā vērtība pēc</b>&nbsp;&mdash; norādiet skaitli, kas nav negatīvs, lai to pieskaitītu parametram <b>Dimensijas lauks vai vērtība</b> un norādītu dimensijas vērtību diapazona beigas. &Scaron;ī vērtība ir dienu skaits, ja dimensija ir laiks.
                        </li>
                    </ul>
                    
                </li>
                <li> <b>Sākuma un beigu lauki vai vērtības</b>&nbsp;&mdash; atlasot &scaron;o opciju, zemāk minētā informācija jānorāda kopā, lai noteiktu diapazonu, kādā tiks aprēķināta mainīgo statistika:
                    <ul>
                        <li> <b>Sākuma lauks vai vērtības</b>&nbsp;&mdash; no atra&scaron;anās vietas datiem atlasiet dimensijas vērtību lauku vai ievadiet konkrētu dimensijas vērtību, lai norādītu dimensijas vērtību diapazona sākumu.
                        </li>
                        <li> <b>Beigu lauks vai vērtība</b>&nbsp;&mdash; no atra&scaron;anās vietas datiem atlasiet dimensijas vērtību lauku vai ievadiet konkrētu dimensijas vērtību, lai norādītu dimensijas vērtību diapazona beigas.
                        </li>
                    </ul>
                    
                    

                </li>
            </ul>
            
            <p>&Scaron;is parametrs ir pieejams tikai tad, ja parametrs  <b>Izvēlēties iztveramos attēlu slāņus</b> ir daudzdimensiju rastrs.
            </p>
        </div>
    </div>
    <div id="bufferDistance">
        <div><h2>Norādīt buferzonas attāluma lauku vai vērtību</h2></div>
        <hr/>
        <div>
            <p>Norādītais attālums ap atra&scaron;anās vietas datu elementiem. Buferzonas attālums ir norādīts atra&scaron;anās vietas elementu telpiskās atsauces lineārajās mērvienībās. Ja elements izmanto ģeogrāfisku atsauci, mērvienība būs grādi.
            </p>
            <p>Statistika tiks aprēķināta &scaron;ajā buferzonā.
            </p>
            <p>&Scaron;is parametrs ir pieejams tikai tad, ja  <b>Izvēlēties iztveramos attēlu slāņus</b> ir daudzdimensiju rastrs.
            </p>
        </div>
    </div>
    <div id="statisticsType">
        <div><h2>Izvēlēties statistikas veidu</h2></div>
        <hr/>
        <div>
            <p>Aprēķināmās statistikas veids.
            </p>
            <ul>
                <li> <b>Minimums</b>&nbsp;&mdash; atrod minimālo vērtību norādītajā diapazonā.
                </li>
                <li> <b>Maksimums</b>&nbsp;&mdash; atrod maksimālo vērtību norādītajā diapazonā.
                </li>
                <li> <b>Mediāna</b>&nbsp;&mdash; atrod mediānas vērtību norādītajā diapazonā.
                </li>
                <li> <b>Vidējā vērtība</b>&nbsp;&mdash; aprēķina norādītā diapazona vidējo vērtību.
                </li>
                <li> <b>Summa</b>&nbsp;&mdash; aprēķina mainīgo summu norādītajā diapazonā.
                </li>
                <li> <b>Vairākums</b>&nbsp;&mdash; atrod vērtību, kas tiek uzrādīta visbiežāk.
                </li>
                <li> <b>Mazākums</b>&nbsp;&mdash; atrod vērtību, kas tiek uzrādīta visretāk.
                </li>
                <li> <b>Standartnovirze</b>&nbsp;&mdash; aprēķina standarta novirzi.
                </li>
                <li> <b>Procentile</b>&nbsp;&mdash; aprēķina definēto procentili norādītajā diapazonā.
                </li>
            </ul>
            
            <p>&Scaron;is parametrs ir pieejams tikai tad, ja parametrs  <b>Izvēlēties iztveramos attēlu slāņus</b> ir daudzdimensiju rastrs, un parametri <b>Izvēlēties atra&scaron;anās vietas slāni</b> ir lauztas līnijas vai daudzstūri, kā arī ir norādīti vai <b>Norādīt buferzonas attāluma lauku vai vērtību</b> (pēc izvēles).
            </p>
        </div>
    </div>
    <div id="percentileValue">
        <div><h2>Procentiles vērtība</h2></div>
        <hr/>
        <div>
            <p>&Scaron;ī vērtība var būt diapazonā no 0&nbsp;līdz&nbsp;100. Noklusējuma vērtība ir 90.
            </p>
            <p>&Scaron;is parametrs ir pieejams tikai tad, ja parametra  <b>Izvēlēties statistikas veidu</b> iestatījums ir <b>Procentile</b>.
            </p>
        </div>
    </div>
    <div id="resamplingType">
        <div><h2>Norādīt atkārtotas iztveršanas paņēmienu</h2></div>
        <hr/>
        <div>
            <p>Atkārtotas iztver&scaron;anas algoritms, iztverot rastru.
            </p>
            <ul>
                <li> <b>Tuvākais</b>&nbsp;&mdash; tuvākā apkārtne, kas izmanto tuvākās &scaron;ūnas vērtību, lai izvades &scaron;ūnai pie&scaron;ķirtu vērtību, veicot atkārtotu iztver&scaron;anu. Tā ir noklusējuma vērtība.
                </li>
                <li> <b>Bilineāri</b>&nbsp;&mdash; bilineārā interpolācija, kas nosaka &scaron;ūnas jauno vērtību, ņemot vērā četru tuvāko ievades &scaron;ūnu centru vidējo svērto attālumu.
                </li>
                <li> <b>Kubiski</b>&nbsp;&mdash; kubiskā konvolūcija, kas nosaka &scaron;ūnas jauno vērtību, ņemot vērā lēzenu līkni, kas iet caur 16&nbsp;vistuvāko ievades pikseļu centriem.
                </li>
            </ul>
            
        </div>
    </div>
    <div id="layout">
        <div><h2>Norādīt izvades izkārtojumu</h2></div>
        <hr/>
        <div>
            <p>Norāda, vai iztvertās vērtības būs redzamas rezultātu tabulas rindās vai kolonnās.
            </p>
            <ul>
                <li> <b>Iztvertās vērtības redzamas rindā</b>&nbsp;&mdash; iztvertās vērtības tiek parādītas atsevi&scaron;ķās rezultātu tabulas rindās. Tā ir noklusējuma vērtība.
                </li>
                <li> <b>Iztvertās vērtības redzamas ailē</b>&nbsp;&mdash; iztvertās vērtības tiek parādītas atsevi&scaron;ķās rezultātu tabulas ailēs.
                </li>
            </ul>
            
            <p>&Scaron;is parametrs ir pieejams tikai tad, ja parametrs  <b>Izvēlēties iztveramos attēlu slāņus</b> ir daudzdimensiju rastrs, kurā ir viens mainīgais un viena dimensija, kā arī katrs sektors ir vienas joslas rastrs.
            </p>
        </div>
    </div>
    <div id="outputType">
        <div><h2>Norādīt izvades veidu</h2></div>
        <hr/>
        <div>
            <p>Norāda, vai ģenerēt punktu elementu klasi ar iztvertām vērtībām tās tabulā vai tikai tabulu ar iztvertām vērtībām.
            </p>
            <ul>
                <li> <b>Tabula</b>&nbsp;&mdash; ģenerē tabulu ar iztvertām vērtībām. Tā ir noklusējuma vērtība.
                </li>
                <li> <b>Elementi</b>&nbsp;&mdash; ģenerē punkta elementu klasi ar iztvertām vērtībām tās tabulā. Ja <b>Izvēlēties atra&scaron;anās vietas slāni</b> parametri ir lauztas līnijas vai daudzstūri, katrs punkts rezultātā ir ievades atra&scaron;anās vietas elementu ģeometriskās figūras centrs. 
                </li>
            </ul>
            
        </div>
    </div>
    <div id="outputName">
        <div><h2>Rezultātu slāņa nosaukums</h2></div>
        <hr/>
        <div>
            
            <p>Slāņa nosaukums, kas tiks izveidots sadaļā  <b>Mans saturs</b> un pievienots kartei. Noklusējuma nosaukums ir balstīts uz rīka nosaukumu un ievades slāņa nosaukumu. Ja &scaron;āds slānis jau pastāv, jums tikts lūgts norādīt citu nosaukumu.
            </p>
            <p>Mapes nosaukumu var norādīt mapē  <b>Mans saturs</b> kur rezultāts tiks saglabāts, izmantojot nolaižamo lodziņu <b>Saglabāt rezultātu</b>.
            </p>
        </div>
    </div>
</div>
</html>
