<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
    <title></title>
    <link rel="Stylesheet" href="../css/analysis.css" />
    <script type="text/javascript">
        function init() {
            if (window.location.hash) {
                var parentDiv, nodes, i, helpInfo, helpId, helpInfoArr, helpEnvFilter, envContent, hideEnvClass, hideNodes;
                helpInfo = window.location.hash.substring(1);
                    if(helpInfo.indexOf("-")) {
                        helpInfoArr = helpInfo.split("-");
                        helpId = helpInfoArr[0];
                        helpEnvFilter = helpInfoArr[1];
                    }
                    else {
                        helpId = helpInfo;
                    }
                parentDiv = document.getElementById("topics");
                nodes = parentDiv.children;
                    hideEnvClass = (helpEnvFilter === "OnlineOnly"? "PortalOnly": "OnlineOnly");
                    if(document.getElementsByClassName) {
                        hideNodes = document.getElementsByClassName(hideEnvClass);
                    }
                    else {
                        hideNodes = document.querySelectorAll(hideEnvClass);
                    }
                for(i=0; i < nodes.length; i++) {
                    if(nodes[i].id !== helpId) {
                        nodes[i].style.display ="none";
                    }
                    }
                    for(i=0; i < hideNodes.length; i++) {
                        hideNodes[i].style.display ="none";
                    }
                }
            }
    </script>
</head>
<body onload="init()">
<div id="topics">
    <div id="toolDescription" class="largesize">
        <h2>Apkopot tuvumā esošo</h2><p/>
        <h2><img src="../images/GUID-A5033D27-81B6-42E7-BA38-50D25C1CCCCA-web.png" alt="Apkopot blakus"></h2>
        <hr/>
    <p>  &Scaron;is rīks atrod un apkopo elementus, kas atrodas noteiktā attālumā no pirmā ievades slāņa elementiem.  Attālumu var izmērīt kā lineāro attālumu vai izmantojot atlasīto ceļo&scaron;anas veidu. Ceļo&scaron;anas veida opcijas ir brauk&scaron;anas attālums, brauk&scaron;anas laiks, brauk&scaron;anas attālums ar kravas automa&scaron;īnu, brauk&scaron;anas laiks ar kravas automa&scaron;īnu, ie&scaron;anas attālums un ie&scaron;anas laiks. Statistika tiek aprēķināta par tuvējiem elementiem. Piemēram:
        <ul>
            <li>Aprēķināt kopējo iedzīvotāju skaitu piecu minū&scaron;u brauk&scaron;anas laikā no piedāvātā jaunā veikala izvietojuma.
            </li>
            <li>Aprēķināt automaģistrāļu pieejas rampu, skaitu vienas jūdzes brauk&scaron;anas distancē, no piedāvātā jaunā veikala izvietojuma, lai to izmantotu kā veikala pieejamības mēru.
            </li>
        </ul>
        
    </p>
    <p>Ja atzīmēts  <b>Lietot pa&scaron;reizējo kartes pārklājumu</b>, tiks analizēti tikai tie analīzes slāņa un apkopojamā slāņa elementi, kas ir redzami pa&scaron;reizējā kartes pārklājumā.  Ja nav atzīmēts, tiks analizēti visi elementi ievades slānī un apkopo&scaron;anas slānī, arī pa&scaron;reizējā kartes pārklājuma ārpusē.
    </p>
    </div>
    <!--Parameter divs for each param-->
    <div id="sumNearbyLayer">
        <div><h2>Izvēlieties slāni, no kura tiks mērīti attālumi līdz apkopojamā slāņa elementiem</h2></div>
        <hr/>
        <div>
            <p>Punkts, līnija vai apgabala slānis, kas tiks izmantots kā sākuma vietas tuvējo elementu apkopo&scaron;anai.
            </p>
            <p class="OnlineOnly">Papildus slāņa izvēlei no kartes nolaižamā saraksta apak&scaron;ā varat atlasīt  <b>Izvēlēties Living Atlas analīzes slāni</b> vai <b>Izvēlēties analīzes slāni</b>. Tādējādi tiek atvērta galerija, kurā apskatāmi dažādi analīzes slāņi. 
            </p>
            <p>Rīks atbalsta līdz 1000&nbsp;elementiem katrā slānī. 
            </p>
        </div>
    </div>
    <div id="Summarize">
        <div><h2>Izvēlieties slāni, ko apkopot</h2></div>
        <hr/>
        <div>
            <p>Tiks apkopoti &scaron;ī slāņa elementi, kas atrodas norādītajā attālumā līdz iepriek&scaron; norādītā slāņa elementiem. 
            </p>
            <p class="OnlineOnly">Papildus slāņa izvēlei no kartes nolaižamā saraksta apak&scaron;ā varat atlasīt  <b>Izvēlēties Living Atlas analīzes slāni</b> vai <b>Izvēlēties analīzes slāni</b>. Tādējādi tiek atvērta galerija, kurā apskatāmi dažādi analīzes slāņi. 
            </p> 
        </div>
    </div>
    <div id="BufferOption">
        <div><h2>Apkopot tuvākos elementus, izmantojot</h2></div>
        <hr/>
        <div>
            <p> Varat definēt, kāda veida attāluma mērī&scaron;anu izmantot&nbsp;&mdash; lineāro attālumu vai atlasīto ceļo&scaron;anas veidu. Ceļo&scaron;anas veidi ir iespējoti tikai tad, ja pirmais ievades slānis (slānis, no kura tiek mērīti attālumi) satur punktus.  Pieejamos ceļo&scaron;anas veidus nosaka jūsu organizācijas administrators. Izmantojot kādu no ceļo&scaron;anas veidiem, mērījumi tiek veikti pa ceļu vai taku, respektējot attiecīgos noteikumus, piemēram, vienvirziena ielas, neatļautus pagriezienus u.tml. Brauk&scaron;anas laika aprēķinā tiek ņemts vērā jūsu izvēlētais brauk&scaron;anas ātrums, vai nu pamatojoties uz konkrēto satiksmi vai parasto satiksmi. Konkrētie ātruma dati tiek apkopoti no pa&scaron;reizējiem sensoru rādījumiem un tipiskie ātruma dati tiek aprēķināti no vēsturiskajiem vidējiem datiem.
            </p>
            <p>Jūs varat ievadīt vairākas distances. Tiks apkopoti elementi, kas atrodas jūsu ievadītajās distancēs (vai ir vienādi ar tām).  
            </p>
            <p>Ja ir atzīmēta izvēles rūtiņa  <b>Atgriezt robežojo&scaron;os apgabalus</b>, tiek atgriezts norādītā attāluma mērījuma definēto apgabalu rezultātu slānis. Rezultāta slānis ietvers visu pieprasīto apkopojuma informāciju. Piemēram, ja, apkopojot tuvējos punktus, tiek izmantots <b>Līnijas attālums</b> 5&nbsp;jūdzes, rezultāts saturēs apgabalus, kas ir 5&nbsp;jūdžu rādiusā ap ievades elementiem, un visu apkopoto informāciju, piemēram, punktu skaitu un pievienoto statistiku. Ja izvēles rūtiņa nav atzīmēta, rezultāta slānis atgriež tos pa&scaron;us pirmā ievades slāņa elementus ar visu pieprasīto apkopojuma informāciju.
            </p>
        </div>
    </div>
    <div id="StatisticsPoint">
        <div><h2>Pievienot statistiku no apkopojamā slāņa</h2></div>
        <hr/>
        <div>
            <p>Pēc izvēles jūs varat aprēķināt statistiku par visiem tuvējo punktu skaitliskajiem atribūtiem. 
            </p>
            <p>Ja tiks atzīmēta rūtiņa  <b>Punktu skaits</b>, tiks aprēķināts tuvumā eso&scaron;o punktu kopējais skaits. Turklāt, jūs varat kalkulēt statistiku par tuvējo punktu skaitliskiem atribūtiem.
            </p>
            <ul>
                <li> <b>Summa</b>&nbsp;&mdash; norādītā lauka kopējā vērtība
                </li>
                <li> <b>Vidējais</b>&nbsp;&mdash; norādītā lauka vidus vai vidējais skaitlis
                </li>
                <li> <b>Minimums</b>&nbsp;&mdash; mazākā vērtība norādītajā laukā
                </li>
                <li> <b>Maksimums</b>&nbsp;&mdash; lielākā vērtība norādītajā laukā
                </li>
                <li> <b>Standarta Novirze</b>&nbsp;&mdash; standarta novirze no vērtībām norādītajā laukā
                </li>
            </ul>
            
        </div>
    </div>
    <div id="StatisticsLine">
        <div><h2>Pievienot statistiku no apkopojamā slāņa</h2></div>
        <hr/>
        <div>
            <p>Jūs varat pēc izvēles kalkulēt statistiku par visiem tuvējo līniju skaitliskajiem atribūtiem. 
            </p>
            <p> <b>Kopējais garums</b> ja rūtiņa ir atzīmēta, tiks kalkulēts tuvējo līniju kopējais garums. Papildus jūs varat aprēķināt, tuvumā eso&scaron;u līniju skaitlisko lauku statistiku.
            </p>
            <ul>
                <li> <b>Summa</b>&nbsp;&mdash; norādītā lauka kopējā vērtība
                </li>
                <li> <b>Vidējais</b>&nbsp;&mdash; norādītā lauka vidus vai vidējais skaitlis
                </li>
                <li> <b>Minimums</b>&nbsp;&mdash; mazākā vērtība norādītajā laukā
                </li>
                <li> <b>Maksimums</b>&nbsp;&mdash; lielākā vērtība norādītajā laukā
                </li>
                <li> <b>Standarta Novirze</b>&nbsp;&mdash; standarta novirze no vērtībām norādītajā laukā
                </li>
            </ul>
            
        </div>
    </div>
    <div id="StatisticsPolygon">
        <div><h2>Pievienot statistiku no apkopojamā slāņa</h2></div>
        <hr/>
        <div>
            <p>Jūs varat pēc izvēles kalkulēt statistiku par visiem tuvējo līniju skaitliskajiem atribūtiem. 
            </p>
            <p> <b>Kopējais garums</b> ja rūtiņa ir atzīmēta, tiks kalkulēts tuvējo līniju kopējais garums. Papildus jūs varat aprēķināt, tuvumā eso&scaron;u elementu skaitlisko lauku statistiku.
            </p>
            <ul>
                <li> <b>Summa</b>&nbsp;&mdash; norādītā lauka kopējā vērtība
                </li>
                <li> <b>Vidējais</b>&nbsp;&mdash; norādītā lauka vidus vai vidējais skaitlis
                </li>
                <li> <b>Minimums</b>&nbsp;&mdash; mazākā vērtība norādītajā laukā
                </li>
                <li> <b>Maksimums</b>&nbsp;&mdash; lielākā vērtība norādītajā laukā
                </li>
                <li> <b>Standarta Novirze</b>&nbsp;&mdash; standarta novirze no vērtībām norādītajā laukā
                </li>
            </ul>
            
        </div>
    </div>
    <div id="StatisticsNoLayer">
        <div><h2>Pievienot statistiku no apkopojamā slāņa</h2></div>
        <hr/>
        <div>
            <p>Kad esat izvēlējies apkopojamo slāni, varat pēc izvēles aprēķināt statistiku par visiem tuvējo punktu, līniju vai apgabalu skaitliskajiem atribūtiem. 
            </p>
            <ul>
                <li> <b>Summa</b>&nbsp;&mdash; norādītā lauka kopējā vērtība
                </li>
                <li> <b>Vidējais</b>&nbsp;&mdash; norādītā lauka vidus vai vidējais skaitlis
                </li>
                <li> <b>Minimums</b>&nbsp;&mdash; mazākā vērtība norādītajā laukā
                </li>
                <li> <b>Maksimums</b>&nbsp;&mdash; lielākā vērtība norādītajā laukā
                </li>
                <li> <b>Standarta Novirze</b>&nbsp;&mdash; standarta novirze no vērtībām norādītajā laukā
                </li>
            </ul>
            
            <p>Atkarībā no apkopojamo elementu veida varat aprēķināt kopējo tuvumā eso&scaron;o punktu skaitu, kopējo tuvumā eso&scaron;o līniju garumu vai kopējo tuvumā eso&scaron;o elementu apgabalu.
            </p>
        </div>
    </div>
    <div id="GroupBy">
        <div><h2>Izvēlieties lauku, pēc kura grupēt</h2></div>
        <hr/>
        <div>
            <p> &Scaron;is ir tuvējo elementu atribūts, ko var lietot, lai aprēķinātu statistiku atsevi&scaron;ķi katrai unikālajai atribūta vērtībai. Piemēram, pieņemsim, ka jūsu pirmais ievades slānis (slānis, no kura tiek mērīti attālumi) satur neapbūvētus zemes gabalus pārdo&scaron;anai un jūsu tuvējie elementi ir ēkas.  Viens no ēkas atribūtiem ir <i>Lieto&scaron;anas veids</i>, kas ietver vērtības, piemēram, MAZUMTIRDZNIECĪBA, DZĪVOJAMĀS ĒKAS, RAŽO&Scaron;ANA vai SABIEDRISKĀS ĒKAS.  Lai raksturotu ēku veidu pie katra vakantā zemes gabala, varat aprēķināt kopējo platību katram unikālajam ēku veidam divu kilometru attālumā no brīvajiem zemes gabaliem, izmantojot <i>Lieto&scaron;anas veids</i> kā grupu pēc atribūta.   Katras grupas statistika, kā arī netālu eso&scaron;o elementu skaits tiks parādīti rezultātu slāņa uznirsto&scaron;ajā logā.
            </p>    
        </div>
    </div>
    <div id="MinorityMajority">
        <div><h2>Pievienot mazākumu, vairākumu</h2></div>
        <hr/>
        <div>
            <p>&Scaron;ī izvēles rūtiņa tiek iespējota, kad izvēlaties lauku, pēc kura grupēt. Ja vēlaties noskaidrot, kuras atribūtu vērtības katrā grupā ir mazākums (vismazāk dominējo&scaron;as) vai vairākums (visvairāk dominējo&scaron;as) jūsu norādītajā attālumā vai laikā, atlasiet  <b>Pievienot mazākumu, vairākumu</b>. Ja izvēlēsieties <b>Pievienot mazākumu, vairākumu</b>, rezultātu slānim tiks pievienoti divi jauni lauki. Ja izvēlēsieties arī <b>Pievienot procentus</b>, rezultātu slānim tiks pievienoti divi papildu lauki, kuros būs ietverts katrā grupā eso&scaron;ais mazākuma un vairākuma atribūtu vērtību skaits procentos.
            </p>
            <ul>
                <li>Ja apkopojat tuvumā eso&scaron;us punktus, mazākuma un vairākuma vērtības tiek aprēķinātas, ņemot vērā punktu skaitu jūsu norādītajā attālumā vai laikā.
                </li>
                <li>Ja apkopojat tuvumā eso&scaron;as līnijas, mazākuma un vairākuma vērtības tiek aprēķinātas, ņemot vērā līniju garumu jūsu norādītajā attālumā vai laikā.  
                </li>
                <li>Ja apkopojat tuvumā eso&scaron;us apgabalus, mazākuma un vairākuma vērtības tiek aprēķinātas, ņemot vērā apgabalus jūsu norādītajā attālumā vai laikā.
                </li>
            </ul>
             
        </div>
    </div>
    <div id="PercentShape">
        <div><h2>Pievienot procentus</h2></div>
        <hr/>
        <div>
            <p>&Scaron;ī izvēles rūtiņa tiek iespējota, kad izvēlaties lauku, pēc kura grupēt. Izvēlieties  <b>Pievienot procentus</b>, ja vēlaties atrast katra atribūta vērtības skaitu procentos katrā grupā. Rezultātu tabulai tiek pievienots jauns lauks, kurā ir ietverts katra atribūta vērtības skaits procentos katrā grupā. Ja ir atzīmēta arī opcija <b>Pievienot mazākumu, vairākumu</b>, rezultātu slānim tiks pievienoti divi papildu lauki, kuros būs ietverts katrā grupā eso&scaron;ais mazākuma un vairākuma atribūtu vērtību skaits procentos.
            </p>
        </div>
    </div>
    <div id="OutputName">
        <div><h2>Rezultātu slāņa nosaukums</h2></div>
        <hr/>
        <div>
            <p>Tas ir slāņa nosaukuns, kas tiks izveidots  <b>Mans saturs</b> un pievienots kartei. Noklusējuma nosaukums ir balstīts uz rīka nosaukumu un ievades slāņa nosaukumu. Ja slānis jau pastāv, jums tiks lūgts norādīt citu nosaukumu.
            </p>
            <p>Lietojot  <b>Saglabāt rezultātus</b> nolaižamajā sarakstlodziņā, jūs varat norādīt nosaukumu mapē <b>Mans saturs</b>, kur tiks saglabāti rezultāti.
            </p>
        </div>
    </div>
</div>
</html>
